{"releaseAt":755276400,"sequence":117,"version":"1.0","items":[{"comments":"iOS 18 버전까지 나왔지만 여전히 앱이 백그라운드에서 무언가 하는 것은 제한적입니다. 백그라운드에서 URLSession 에서 uploadTask로 업로드하는 방식을 설명합니다. ","title":"Background upload in iOS | by Diana Nareiko ","keywords":["UIKit"],"location":"https:\/\/medium.com\/@diananareiko8\/background-upload-in-ios-f885ed439bd3","summary":""},{"comments":"데이터 바인딩을 하기 위해 사용하는 프로퍼티 래퍼 `@Bindable` 과 `@Binding` 에 대한 간단한 설명입니다. ","location":"https:\/\/medium.com\/@paulwall_21\/bindable-vs-binding-f89d790deb94","summary":"","title":"@Bindable vs @Binding | by Paul O","keywords":["SwiftUI"]},{"title":"10 Crucial Reasons to Choose the M3 Over the New M4 Pro | Mac O","summary":"","keywords":["Hardware"],"location":"https:\/\/medium.com\/macoclock\/10-crucial-reasons-to-choose-the-m3-over-the-new-m4-pro-681df41d8bfe","comments":"새로운 M4 Pro 맥을 선택해야 하는 이유를 설명합니다. 가격도 저렴하고 성능도 좋고 기본 메모리도 올라가고 GPU까지 좋아졌으니 안 살 이유가 없다고 하네요 "},{"summary":"","location":"https:\/\/medium.com\/macoclock\/5-essential-ios-18-shortcuts-you-need-for-a-better-daily-workflow-e7c2812e2254","comments":"단축어 자주 쓰시나요? 아이폰 뿐만 아니라 맥에서도 자동화 시키기 좋습니다. 베터리가 없을 때 문자보내는 것은 편리할 것 같네요","title":"5 Essential iOS 18 Shortcuts To Automate Your Daily Life | by The Useful Tech ","keywords":["Culture"]},{"location":"https:\/\/medium.com\/macoclock\/apple-intelligence-writing-tools-vs-grammarly-a-comprehensive-comparison-between-the-best-ai-b515b96f7d68","title":"Apple Intelligence Writing Tools Vs Grammarly: A Comprehensive Comparison | by Aditya Darekar ","keywords":["AI\/ML"],"summary":"","comments":"애플 인텔리전스에 포함된 쓰기 도구를 Grammarly 서비스와 직접적으로 비교한 글이네요. 여러모로 Grammarly 서비스가 최적화도 잘 되어 있고 품질도 좋지만 이제막 베타로 시작한 애플 인텔리전스 쓰기 도구도 쓸만하다는 평가입니다"},{"location":"https:\/\/www.apple.com\/kr\/newsroom\/2024\/12\/apple-honors-2024-app-store-award-winners\/","keywords":["APPLE"],"title":"Apple, 2024년 App Store Award 수상작 발표 - Apple (KR)","summary":"","comments":"디자인 어워드와 다르게 앱 스토어에서 영향력이 큰 앱에 대한 연말 시상식 느낌으로 앱 스토어 어워드 수상작이 발표됐습니다. "},{"comments":"Task로 throw 함수를 감쌀 때 어떻게 하고 계신가요? Task 내부는 비동기니까 에러를 던질 필요가 없는 경우도 있지만 흐름 제어 관점에서는 놓치기 쉬운 실수가 됩니다","title":"Be careful wrapping a throwing function in a Task — Swift with Vincent","summary":"","keywords":["Swift","영어"],"location":"https:\/\/www.swiftwithvincent.com\/blog\/be-careful-wrapping-a-throwing-function-in-a-task?"},{"title":"Common Misconceptions About SwiftUI | by fatbobman ","location":"https:\/\/itnext.io\/common-misconceptions-about-swiftui-413ebd7bc2ae","comments":"SwiftUI를 설명할 때 선언적인 뷰 프레임워크라고 부르지만 함께 사용하는 방식이나 상호 작용, 데이터 흐름 관리까지 고려하면 단지 뷰만 다룬다고 하기 너무 광범위한 이야기가 되기도 합니다. 단지 뷰를 다루는 코드 양을 줄이기 위한 접근보다는 효율적으로 동작하고 신뢰할 만한 앱을 만드는 방식 중에 하나라는 것을 강조합니다","keywords":["SwiftUI"],"summary":"이 글에서는 SwiftUI에 대한 일반적인 오해들을 다루고 있으며, 이를 통해 개발자들이 SwiftUI의 본질을 더 잘 이해하고 활용할 수 있도록 돕고자 합니다. SwiftUI는 간결한 코드와 선언적 프레임워크로 유명하지만, 많은 사용자들이 이를 단순히 쉽게 배울 수 있는 것으로 오해할 수 있습니다. 실제로 복잡한 레이아웃과 상호작용에서는 SwiftUI의 구조적 특성을 깊이 이해하지 않으면 원활한 개발이 어려울 수 있습니다.\n\nSwiftUI의 크로스 플랫폼 개발은 \"Write Once, Run Anywhere\"라는 기대와 달리 여러 플랫폼에서의 상이한 동작으로 인해 복잡함이 동반됩니다. Apple은 “Learn once, apply anywhere”라는 접근 방식을 강조하며, 개발자들이 각 플랫폼에 따른 독특한 특성을 이해해야 한다고 주장합니다. SwiftUI는 단순한 UI 프레임워크가 아니라 새로운 개발 패러다임을 제시하며, 데이터 흐름 관리와 성능 최적화에 대한 새로운 접근이 필요합니다.\n\nSwiftUI는 코드의 양을 줄이는 것만이 목표가 아니라, 적절한 코드 구조와 최선의 관행을 통해 효율적이고 신뢰할 수 있는 애플리케이션을 만드는 것임을 강조합니다.\n\n**주요 키워드:**\n1. SwiftUI 오해\n2. 크로스 플랫폼\n3. 학습 곡선\n4. 데이터 흐름 관리\n5. 코드 구조"},{"summary":"","keywords":["SwiftUI"],"location":"https:\/\/medium.com\/@wesleymatlock\/custom-animations-with-timing-curves-in-swiftui-make-your-ui-rock-61962355f888","title":"Custom Animations with Timing Curves in SwiftUI: Make Your UI Rock | by Wesley Matlock ","comments":"애니메이션과 타이밍 함수를 다루는 방식을 설명합니다"},{"keywords":["Culture"],"location":"https:\/\/medium.com\/macoclock\/every-product-apple-discontinued-in-2024-068756bf342a","title":"Every Product Apple DISCONTINUED in 2024 | by Sareena ","comments":"2024년에 단종된 제품들을 정리한 글이네요. M1 제품들도 사라지고 라이트닝 케이블도 사라지고 은근 변화가 많네요","summary":""},{"comments":"iOS 18.2 정식 버전에서 애플 인텔리전스 이외에 주목할 만한 기능들을 소개합니다. 공식 메일 앱에서 카테고리 분류가 되서 편하더군요","summary":"","keywords":["Culture"],"title":"Exciting new FEATURES in iOS 18.2 that aren’t about AI | by Sareena ","location":"https:\/\/medium.com\/macoclock\/exciting-new-features-in-ios-18-2-that-arent-about-ai-55795606ef46"},{"summary":"","keywords":["AI\/ML","영어"],"location":"https:\/\/www.createwithswift.com\/exploring-apple-intelligence-image-generation\/?","title":"Exploring Apple Intelligence: Image Generation","comments":"182 애플 인텔리전스 기능 중에 이미지 플레이그라운드 관련해서 개발할 때 필요한 사항을 소개합니다. 이제 모든 앱에서 사용할 수 있는 시점이 가까워졌네요"},{"title":"Exploring MLX Swift: Adding On-Device Inference to your App","keywords":["AI\/ML","영어"],"summary":"","location":"https:\/\/www.rudrank.com\/exploring-mlx-swift-adding-on-device-inference-to-your-app\/?","comments":"MLX 는 애플에서 제공하는 애플 실리콘에 최적화한 ML 가속 프레임워크로 Swift API도 제공해줍니다. 온디바이스에서 유명한 LLM 모델을 실행하는 것도 가능하기 때문에 살펴보기 좋습니다. "},{"summary":"이 글은 제품 설계에서 '기능'과 '경험'의 차이점에 대해 설명하며, 사용자가 자연스럽게 상호작용할 수 있도록 제품을 설계해야 한다고 강조합니다. 사용자가 기계적으로 기능을 배우는 것이 아니라, 자신의 작업 흐름에 자연스럽게 통합된 경험을 해야 한다는 것입니다. 이 과정에서 사용자의 요구를 이해하고, 불필요한 복잡성을 제거하며, 자동화와 직관적인 설계를 지향해야 한다고 합니다. 저자는 사용자가 제품을 사용할 때 느끼는 불편한 요소들을 찾아내고 이를 해결하는 것이 중요하다고 설명하며, 매끄러운 사용자 경험이야말로 제품의 성공을 결정짓는 핵심임을 강조합니다.\n\n제품 설계가 기능 중심에서 경험 중심으로 전환될 때, 사용자는 더 이상 기능을 의식하지 않고, 자연스럽게 원하는 작업을 수행할 수 있습니다. 따라서, 사용자의 흐름을 중단시키지 않도록 설계하고, 사용자가 쉽게 인식하고 활용할 수 있도록 만드는 것이 최종 목표입니다.\n\n**핵심 키워드**: 경험 중심 디자인, 사용자 흐름, 불편 제거, 자동화, 직관적 사용.","title":"Features shouldn’t feel like features | by Avi Siegel ","location":"https:\/\/uxdesign.cc\/features-shouldnt-feel-like-features-fba44644f961","comments":"기능과 경험 차이점에 대해 설명하고 사용자가 기능을 기계적으로 학습하는 게 아니라 자연스럽게 사용하도록 설계하라는 글입니다. 조금 길긴하네요 ","keywords":["Design"]},{"title":"Float vs. CGFloat in iOS Swift: An In-Depth Exploration | by Kalidoss Shanmugam ","comments":"Float 와 CGFloat 차이점에 대해 설명합니다. 타입별 메모리 레이아웃이 다르고, 맥인지 아이폰인지에 따라 다르기 때문에 내용은 알고 써야 할 것 같습니다","location":"https:\/\/medium.com\/@kalidoss.shanmugam\/float-vs-cgfloat-in-ios-swift-an-in-depth-exploration-3b3bd8d21649","keywords":["Swift"],"summary":""},{"summary":"","comments":"게임 상태와 반복 작용에 대한 내용입니다","keywords":["Culture"],"location":"https:\/\/stanislav-stankovic.medium.com\/game-mechanics-interaction-loop-and-the-game-state-c38e6e4584dd","title":"Game Mechanics — Interaction Loop and the Game State | by Stanislav Stankovic "},{"keywords":["Hardware","AI\/ML","DeveloperTools"],"location":"https:\/\/evilgeek.medium.com\/how-i-use-my-airpods-pro-2-will-amaze-you-f42f5548861b","title":"How I Use My AirPods Pro 2 Will Amaze You | by The Evil Geek ","comments":"","summary":""},{"location":"https:\/\/blog.stackademic.com\/how-to-prevent-massive-viewmodels-in-mvvm-and-maintain-solid-principles-b1d26bb31e92","title":"How to Prevent Massive ViewModels in MVVM and Maintain SOLID Principles | by Shobhakar Tiwari ","keywords":["Architecture"],"summary":"","comments":"기능이 많아지다보면 어딘가 커지는 형태가 생기게 됩니다. ViewController가 아니더라도 ViewModel도 가능하고 그냥 View도 커질 수 있습니다. 이 글을 읽고 크기를 줄인다.는 의미가 무엇인가 생각해보게 되네요"},{"location":"https:\/\/www.polpiella.dev\/paid-app-to-freemium?","keywords":["Framework","영어"],"title":"How to change your app's business model from paid to freemium using StoreKit","comments":"앱 스토어에서 유료 앱을 무료 사용후 전환하하는 freemium 앱으로 바꾸는 방식에 대한 소개입니다","summary":""},{"location":"https:\/\/medium.com\/@herlandro\/how-to-make-a-swift-function-10-625-000-times-faster-218808a7c4c2","keywords":["Swift"],"comments":"함수 실행에 대한 비교입니다. 실행 횟수와 알고리즘 비교 자체도 있지만 익숙하게 선언하는 함수 하나가 발목 잡는 경우가 있으니 조심할 필요는 있겠습니다","summary":"","title":"How to make a Swift function 10,625,000 times faster | by Herlandro Hermogenes "},{"keywords":["Architecture","pick"],"location":"https:\/\/eng.lyft.com\/integrating-extensions-into-large-scale-ios-apps-8f15dc5f3be9","title":"Integrating Extensions into Large-Scale iOS apps | by Max Husar ","comments":"Lyft 앱 개발팀이 큰 규모의 앱 모듈 의존성을 시각화해서 메모리 구조를 파악하는 과정을 상세하게 설명합니다. 앱 구조을 개선하고 용량을 줄이는 좋은 사례인 것 같습니다","summary":""},{"comments":"애플 비전 프로는 정말 공간 컴퓨팅일까요? 최고 사양으로 앞으로 공간 컴퓨팅 가능성을 열어준 것은 맞지만 아직은 눈이나 손의 움직임으로 할 수 있는 것이 제한적이라고 말합니다","title":"Is Apple Vision Pro Truly a Spatial Computer? | Mac O","location":"https:\/\/medium.com\/macoclock\/is-apple-vision-pro-truly-a-spatial-computer-838e800d1a9c","keywords":["VisionOS","pick"],"summary":"Apple의 Vision Pro는 '스페이셜 컴퓨터'라는 이름 아래 많은 기대를 모으고 있지만, 그 진정한 의미와 한계에 대한 논의가 필요하다. 첫째, Vision Pro는 가상 현실(VR) 기술을 대체할 가능성이 있지만, 아직 많은 기술적 문제를 해결하지 못했다. Apple은 ultra 고해상도의 화면을 통해 사용자에게 마치 실제처럼 느껴지는 시각적 경험을 제공하며, 손이나 눈의 움직임으로 인터페이스를 조작하는 기능도 갖추고 있다.\n\n이 장치는 영화 관람, 개인 콘서트와 같은 몰입형 경험을 통해 사용자에게 깊은 감동을 줄 수 있지만, 일상적인 작업을 완수하기 위한 실용성은 부족하다. 특히, Vision Pro는 iPad OS에 기반을 두고 있어 Mac의 많은 앱을 사용할 수 없다. 따라서, 사용자는 여전히 Mac과 연결해야 하며, 이 점에서 많은 기술적 제약이 느껴진다. \n\nApple이 강조하는 사회적 상호작용과 실재감 또한 중요한 이슈이다. 사용자가 외부를 볼 수 있도록 디자인된 외부 디스플레이는 소셜 연결을 촉진하는 반면, 헤드셋은 궁극적으로 고립된 환경을 제공하기 때문이다. \n\n결론적으로, Vision Pro는 기술적으로 인상적이지만, 일상생활에서 그 가치를 증명하기까지는 시간이 걸릴 것으로 예상된다. 소비자들이 이 제품을 '미래'로 인식하게 만들기 위해서는 Apple이 사용자 경험을 혁신적으로 개선해야 할 필요가 있다.\n\n**핵심 키워드**: Apple, Vision Pro, 스페이셜 컴퓨터, 가상 현실, 기술적 한계"},{"location":"https:\/\/medium.com\/macoclock\/m4-pro-mac-mini-whats-really-inside-mine-5e2ee42e6e72","keywords":["Hardware"],"title":"M4 Pro Mac mini — what’s REALLY inside mine? | by David Lewis ","comments":"M4 맥 미니 또 다른 리뷰글이네요. 맥 장비들도 매년 업그레이드가 빨라지고 있고 성능 개선이 꾸준히만 된다면 앞으로가 더 기대되는 것 같습니다","summary":""},{"keywords":["Culture"],"title":"MacOS: The Ultimate Productivity Setup | by Andrii ","location":"https:\/\/medium.com\/macoclock\/macos-the-ultimate-productivity-setup-4f72eab63c90","comments":"맥 환경 설정을 얼마나 조정해서 사용하시나요? 생산성을 높여주는 나만의 설정 방법들 - 팁에 해당하는 데 가볍게 살펴보기 좋습니다","summary":""},{"keywords":["Testing","영어"],"summary":"","location":"https:\/\/useyourloaf.com\/blog\/migrating-xctest-to-swift-testing\/?","comments":"저도 최근에야 Swift Testing 을 직접적으로 사용해보고 있습니다. XCTest 로 작성한 것을 마이그레이션해야 하나까지는 생각하지 않았는데요. 왜냐하면 Swift Testing 내부에서 동작은 XCTest로 동작하기 때문이죠. 아무튼 마이그레이션이 필요하다고 가정하고 어떻게 옮겨지는 지 살펴보시면 좋습니다","title":"Migrating XCTest to Swift Testing"},{"location":"https:\/\/nilcoalescing.com\/blog\/NoncopyableTypesInSwift\/?","comments":"스위프트가 복사하지 못하도록 선언하는 Noncopyable 타입을 선언하고 작성하는 방식을 설명합니다. 컴파일 시점에 바꾸지 못하도록 막히는 경우가 점차 많아질 것 같습니다","title":"Noncopyable types in Swift","summary":"","keywords":["Swift","영어"]},{"keywords":["APPLE","pick"],"summary":"","location":"https:\/\/developer.apple.com\/documentation\/Security\/notarizing-macos-software-before-distribution","title":"Notarizing macOS software before distribution | Apple Developer Documentation","comments":"며칠전에 맥용 앱을 베타 테스트할 겸 직접 배포할 일이 있었는데요, Xcode 최신 버전부터는 (찾아보니 Xcode 15.3 부터라고) notarizing을 직접 해주네요. 앱 스토어에 올리지 않아도 등록된 개발자가 배포하는 것으로 인식하도록 해줍니다. Xcode 16 스샷은 아니지만 관련 개발 문서를 소개합니다"},{"location":"https:\/\/michaellong.medium.com\/now-previewing-navigator-faebf290a1da","keywords":["OpenSources"],"title":"Now Previewing Navigator! | by Michael Long ","comments":"iOS 16부터 지원하는 SwiftUI 내비게이터를 구현한 오픈 소스입니다. 항상 이름을 직관적으로 짓는 분이긴 합니다","summary":""},{"location":"https:\/\/stevenpcurtis.medium.com\/practical-mvvm-c-in-swiftui-930f8134ba4d","title":"Practical MVVM-C in SwiftUI. A Clear Separation of Concerns | by Steven Curtis ","summary":"","keywords":["Architecture"],"comments":"MVVM-C 형태로 내비게이션을 처리하려면 결국 내비게이터 혹은 코디네이터를 넘겨줄 수 밖에 없겠죠. SwiftUI 는 여전히 내비게이션 해결책이 다양합니다"},{"summary":"디자인의 미래에 대한 AI의 영향을 다룬 기사는 사용자 기대치가 어떻게 변하는지를 역사적 관점에서 설명합니다. 과거 아날로그 제품의 시대에는 장인정신과 품질이 중요한 요소였으나, 대량생산의 대두로 효율성과 가격이 우선시되면서 품질 기준이 낮아졌습니다. 현대의 AI 기술이 디지털 디자인의 효율성을 높여주고 있지만, 이는 품질을 희생하게 만들 수 있습니다. \n\nAI가 생성하는 콘텐츠는 그 깊이와 창의성에서 인간 의도를 따라가지 못하더라도, 비용 효율성과 신속함 덕분에 많은 이들에게 더 매력적인 옵션으로 자리 잡을 가능성이 높습니다. 사용자의 기대는 시간이 지남에 따라 변하고 있으며, 이는 디지털 디자인의 기준에도 확인할 수 있습니다.\n\n디자이너들은 AI의 효율성을 인정하면서도, 이로 인해 품질이 저하되는 것을 우려해야 합니다. 그러나 사용자들이 찾는 것은 점점 더 실용성과 접근성으로 옮겨가고 있으며, 이는 디지털 디자인의 미래에 큰 영향을 미칠 것입니다.\n\n결국, 디자인의 정의는 바뀌고, 이러한 변화에 적응하지 않으면 디자이너들은 뒤처질 것입니다. AI 시대에서의 성공은 품질의 재정의와 함께 AI를 효과적으로 활용하는 방식에 따라 달려 있습니다.\n\n**핵심 키워드:** 디자인, AI, 효율성, 사용자 기대, 품질","title":"Quality won’t save designers from AI | by Michael F. Buckley ","location":"https:\/\/uxdesign.cc\/quality-wont-save-designers-from-ai-ba687e91167f","keywords":["Design"],"comments":"디자인 작업에도 인공지능 도구가 효율성을 높여주고 있지만 품질은 떨어지고 희생하게 된다는 논점입니다. 어디서나 자동화가 생산성을 높여주면서도 품질 저하 문제가 있기 때문에 본질적인 디자인 작업도 완전히 사라지지 않을 꺼라는 이야기네요"},{"location":"https:\/\/medium.com\/@samuliak\/running-macos-apps-on-ios-8c6448a8057e","comments":"이거 흥미롭네요. 맥 앱을 iOS 에서 실행할 수 있을까요? 게임을 직접 포팅하면서 여러 래핑 계층을 두고 양쪽에서 동작하는 앱을 구현했나 봅니다. 아쉽게도 세부적인 내용이나 코드가 공개되지는 않았지만 맥용 앱을 옮기는 작업에 대한 아이디어 정도는 얻을 수 있을 것 같습니다","summary":"","title":"Running macOS apps on iOS | by Samuel Žúbor ","keywords":["AppKit"]},{"keywords":["Framework"],"location":"https:\/\/www.avanderlee.com\/swift\/sf-symbol-guide\/?","comments":"SF 심볼이 벡터 형태로 제공되고 참조하기도 워낙 간단해서 점차 많이 사용하게 되는 것 같습니다. 이제 애니메이션이나 멀티 컬러까지 되기 때문에 더 매력적인 것 같습니다","title":"SF Symbol: How to for Swift & SwiftUI","summary":""},{"keywords":["Swift"],"comments":"프로퍼티 래퍼와 매크로를 직접적으로 비교해줍니다. 사용하는 곳, 컴파일 타임과 런타임 동작까지 꽤 구분을 잘 해주네요","summary":"","location":"https:\/\/stevenpcurtis.medium.com\/swift-property-wrappers-vs-macros-49de216f83d4","title":"Swift Property Wrappers vs. Macros | by Steven Curtis "},{"location":"https:\/\/www.avanderlee.com\/swiftui\/swiftui-button-styles\/?","summary":"","comments":"다양한 형태의 버튼을 만드는 경우에 스타일 변화를 주기 위해서 필요한 사항들을 점검할 수 있어서 좋습니다","keywords":["SwiftUI","영어"],"title":"SwiftUI Button: Custom Styles, Variants, and Best Practices"},{"comments":"의존성을 관리하면서 실제로 로그인 하지 않고도 인증을 처리하는 동작을 구현하는 예시입니다. 인증 Repository 구현체가 Mock을 처리하도록 구현하네요","location":"https:\/\/medium.com\/comsystoreply\/swiftui-best-practices-project-showcase-c9834a448c53","title":"SwiftUI best practices project showcase | by Filip Kisić ","keywords":["SwiftUI"],"summary":""},{"title":"SwiftUI\/MacOS: Detect Mouse Location & Show Auxiliary Window | by Itsuki ","summary":"","comments":"맥 앱을 만들 때 NSEvent 에서 마우스 움직임을 감지해서 윈도우 위치를 지정하는 방식을 설명합니다","location":"https:\/\/levelup.gitconnected.com\/swiftui-macos-detect-mouse-location-show-auxiliary-window-20e2acb593b0","keywords":["AppKit"]},{"comments":"공유 익스텐션을 만드는 방식과 화면 처리 방식을 설명합니다. 익스텐션 만드는 게 간단하면서도 테스트 하기 어려운 데 에러 메시지를 확인하는 방법은 꼭 알아두는 게 편하더군요","location":"https:\/\/levelup.gitconnected.com\/swiftui-make-app-a-destination-app-for-a-share-with-share-extension-a90deffa3bfa","summary":"","title":"SwiftUI: Make App a Destination App for Share (With Share Extension) | by Itsuki ","keywords":["SwiftUI"]},{"summary":"","keywords":["Testing"],"comments":"스위프트 테스팅 프레임워크 상세한 소개 버전입니다. 예제가 꽤 상세해서 애플 공식 문서보다 친절하다고(?) 느낄 수 있습니다 ","title":"Swifter and Swifty: Mastering the Swift Testing Framework | ITNEXT","location":"https:\/\/itnext.io\/swifter-and-swifty-mastering-the-swift-testing-framework-6431764fbf00"},{"title":"The 4 don’ts of Swift Concurrency | by Sergey Petrachkov ","summary":"","location":"https:\/\/blog.devgenius.io\/the-4-donts-of-swift-concurrency-5614f39f8246","keywords":["Swift"],"comments":"스위프트 동시성을 사용할 때 하지말아야 할 것 4가지를 설명합니다. 간단하지만 실수하기 좋은 요소들이긴 합니다. "},{"summary":"최근 아이폰 16 프로의 카메라 기능에 대한 리뷰와 관련된 내용으로 시작합니다. 이 리뷰에서 가장 매력적인 특징 중 하나는 계산적 사진 처리 기능을 꺼버리거나 최소화할 수 있는 기능입니다. 작성자는 현대 스마트폰 사진의 HDR 효과가 과도하다고 느끼며, 자연스러운 사진을 선호해 왔습니다. 구글 픽셀 카메라를 선호했던 이유도 이러한 자연스러운 이미지 때문이라는 점을 강조합니다.\n\n과거의 카메라 사용 경험을 이야기하면서, 자동 설정으로 인해 중요한 순간을 놓친 경험을 공유합니다. 이를 해결하기 위해 다이얼에 슈퍼 글루를 사용하는 기발한 방법을 적용한 사례를 소개합니다. 이러한 경험을 통해, 그는 카메라의 기본 설정만 사용하는 것을 선호하게 되었고, 최근에는 아이폰과 픽셀로 사진을 찍고 있다고 밝혔습니다. HDR 기능이 점점 강해져 자연스러운 느낌을 잃고 있다는 점에서 고전 필름 카메라를 다시 사용하는 이유를 들며, 아이폰 16의 업그레이드를 생각하고 있다고 전합니다.\n\n결국 그는 더 많은 개인적 실수를 통해 진정성을 찾고 있으며, 아이폰으로도 이러한 조절이 가능해지기를 기대하고 있습니다.\n\n**핵심 키워드:** 아이폰 16 프로, 카메라 기능, HDR, 필름 카메라, 자연스러운 이미지","comments":"과거 카메라들에 비해서 요즘은 HDR 정보나 AI\/ML 기술로 보정하는 기능이 좀 과하기 때문에 끄고 찍는 게 더 낫다는 관점입니다","location":"https:\/\/medium.com\/@Happicamp\/the-iphone-16-pros-best-camera-feature-is-an-off-button-359a481c06ba","title":"The iPhone 16 Pro’s best camera feature is an ‘off button’ | by James Bareham ","keywords":["Hardware"]},{"location":"https:\/\/simaspavlos.medium.com\/top-10-libraries-to-write-less-code-in-swiftui-9ca9bd26c33a","summary":"","title":"Top 10 Libraries to Write Less Code in SwiftUI | by Pavlos Simas ","comments":"","keywords":["SwiftUI"]},{"location":"https:\/\/andrewzuo.com\/transferrable-passkeys-are-a-bad-idea-365c21a8dfcf","comments":"이전 글 중에서 패스키가 나쁜 방식이라고 강조했던 글에 대해 이어서 쓴 글이네요. 서버에서 검증하는 다중 인증 방식이 아니라서 보안에 취약할 수 있다고 강조합니다. 간편한 방식일 수록 위험할 수 있을 것 같습니다","summary":"이 글은 Andrew Zuo가 작성한 \"전달 가능한 패스키는 좋지 않은 아이디어\"라는 내용을 다룹니다. 그는 패스키와 그 보안성에 대해 비판하며, 패스키가 개인 장치에 묶여 있는 것이 아니라 전달 가능하다는 점을 강조합니다. 패스키의 기본 원리는 '당신이 가지고 있는 것'과 '당신이 누구인지'에 기반하지만, 단순한 클라이언트 인증에 그친다고 주장합니다. 이는 서버에서 검증하는 다중 인증 방식이 아닌 하나의 요소만을 검증하게 되어 보안이 취약해질 수 있다는 것입니다.\n\nZuo는 또한 패스키를 비밀번호 관리 프로그램과 비교하면서, 안전한 관리 프로그램이 없으면 패스키를 통해 데이터가 유출될 위험이 커진다고 지적합니다. 궁극적으로 그는 패스키가 주된 인증 방법으로 사용되는 것을 경계해야 한다고 강조하며, 인증 방식의 간편함과 보안성을 조화롭게 유지하기 힘든 '저주받은 문제'를 언급합니다. 그는 비밀번호와 시간 기반 인증 코드를 사용하는 방법이 더 안전하다고 주장합니다.\n\n패스키는 보조 인증 방법으로 사용 될 수 있지만, 주 인증 방법으로는 부적합하다는 결론을 내립니다.\n\n### 요약 키워드:\n1. 패스키\n2. 인증\n3. 보안\n4. 비밀번호 관리\n5. 간편성 vs 보안성","title":"Transferrable Passkeys Are A Bad Idea | by Andrew Zuo ","keywords":["Culture"]},{"title":"Why Hiring High-Performance Developers is the Biggest Mistake for ROI. Do This Instead. | by Eiki Takeuchi ","comments":"소프트웨어 프로젝트는 자주 실패합니다. 쉽게 성공만 하려고 하면 쉽게 실패하기 때문이죠. 가장 큰 실수는 성과가 높은 개발자를 채용하려고 하는 게 오히려 ROI 관점에서 나쁘다는 것을 이야기 합니다.","keywords":["Culture"],"summary":"이 기사는 소프트웨어 개발에서 성능이 높은 개발자를 고용하는 것이 ROI(투자수익률) 측면에서 가장 큰 실수라고 주장합니다. 저자 에이키 타케우치는 일본에서 소프트웨어 엔지니어로 일하며 여러 프로젝트가 실패한 경험을 바탕으로, 소프트웨어 개발의 본질은 기술적 능력보다 문제를 이해하고 해결하는 사람들을 고용하는 것에 있다고 강조합니다. 그는 프로젝트 실패의 주된 원인이 고객의 필요를 고려하지 않은 제품 개발에 있다고 설명합니다.\n\n애자일(Agile) 접근법은 이 문제를 해결하기 위해 개발된 체계로, 고객 피드백을 조기에 반복적으로 받아들여 가치를 제공하는 데 중점을 둡니다. 저자는 시몬 사이넥의 '왜(Why)', '어떻게(How)', '무엇(What)' 방식을 통해, 제품 소유자(Product Owner)의 역할이 최우선으로 중요하다고 주장합니다. 제품 소유자는 제품의 목표와 방향을 정하는 핵심 인물이며, 그 뒤를 이어 스크럼 마스터(Scrum Master)와 개발자들이 중요하다고 덧붙였습니다. 특히, 팀 동역학이 개별 재능보다 더 중요하다는 연구 결과를 인용하며, 작은 팀 구조가 성공적인 팀 운영에 효과적임을 설명합니다.\n\n결론적으로, 저자는 성공적인 소프트웨어 개발 팀을 위해 올바른 인재를 선발하고 팀의 상호작용과 작업 구조를 중시해야 한다고 강조합니다.\n\n**키워드:** 소프트웨어 개발, ROI, 애자일, 제품 소유자, 팀 동역학","location":"https:\/\/medium.com\/beyond-agile-leadership\/why-hiring-high-performance-developers-is-the-biggest-mistake-for-roi-do-this-instead-717ce5403228"},{"keywords":["Culture"],"summary":"이 글에서는 Apple 생태계의 작동 방식과 그에 대한 다양한 의견을 다룹니다. 저자는 자신의 아버지에게 새로운 AirPods Pro 2를 선물하며 Apple 생태계의 편리함을 직접 경험한 일화를 공유합니다. Apple 생태계는 기기 간의 무선 연결 및 데이터 공유 기능이 통합되어 있어 사용자에게 편리함을 제공합니다. 저자는 타 브랜드의 생태계를 사용한 후, Apple이 제공하는 통합성과 안정성을 부각시키며 다른 브랜드와의 대비를 강조합니다. 삼성 생태계를 경험한 후, 저자는 Apple의 체계적이고 일관된 사용자 경험이 타 브랜드를 초월한다고 주장합니다.\n\n일부 사람들은 Apple 생태계를 ‘덫’으로 간주하지만, 저자는 이것이 단순한 선입견이라고 설명합니다. 그들은 다른 선택지를 동경하면서 Apple 제품이 제공하는 미적 평가와 기능적 장점들을 간과하고 있습니다. 저자는 Apple의 하드웨어와 소프트웨어의 통합으로 인해 사용자가 만족할 수 있는 원활한 경험을 경험할 수 있다고 강조합니다.\n\n결론적으로, Apple 생태계는 단순한 소비가 아니라 최상의 기술을 중시하는 사용자들에게 최적화된 경험을 제공하는 것으로, 저자는 이를 ‘덫’이 아닌 ‘작품’으로 묘사합니다.\n\n**주요 키워드**: Apple 생태계, 편리함, 사용자 경험, 덫, 통합성","title":"Why the Apple Ecosystem Isn’t a Trap — Unless You Think It Is | by Manav Tyagi ","location":"https:\/\/medium.com\/macoclock\/why-the-apple-ecosystem-isnt-a-trap-unless-you-think-it-is-c39c4e124442","comments":"애플 생태계는 정말 덫일까요. 사용자들이 바보처럼 덫에 걸려서 사지도 않아도 되는 것을 마구 사는 것은 아닐 겁니다. 기술적으로 하드웨어와 소프트웨어 통합한 서비스 경험은 기술을 중시하는 사용자들에게 최고니까요"},{"comments":"SPM 플러그인 기능을 활용해서 동적으로 SwiftUI 뷰와 Modifier를 찾거나 활용할 수 있는 방법을 제안합니다","location":"https:\/\/www.artemnovichkov.com\/blog\/xcode-library-customization-with-spm-plugin?","title":"Xcode Library customization with SPM plugin","summary":"이 글에서는 Xcode 라이브러리를 Swift Package Manager(SPM) 플러그인을 사용하여 맞춤 설정하는 방법에 대해 설명합니다. Xcode 라이브러리를 통해 사용자는 SwiftUI 뷰와 변형을 검색하고 발견할 수 있으며, 이는 코드 에디터에 드래그-앤-드롭하거나 더블 클릭하여 사용할 수 있습니다. 사용자는 LibraryContentProvider 프로토콜을 구현하여 사용자 정의 뷰와 변형을 추가할 수 있습니다.\n\n작성된 코드의 예시는 Swift Macro 출력을 간단화하고자 했으나, Xcode 라이브러리가 그 안에서 코드를 인식하지 못하는 문제를 가지고 있었습니다. 이 문제를 해결하기 위해 SPM 명령형 플러그인을 만들었습니다. 플러그인을 작성한 후, 사용자는 Xcode 내에서 특정 메뉴를 통해 라이브러리 콘텐츠를 생성할 수 있습니다. \n\n이 과정에서 사용자는 SwiftSyntax 패키지를 이용하여 소스 코드를 구문 분석하고, 관련 정보를 추출합니다. 최종적으로 생성된 코드는 Xcode 라이브러리에서 사용할 수 있으며, 이는 자동으로 뷰 섹션을 업데이트합니다. 또한, SwiftSyntax에 대한 문서와 예제가 부족하다는 점과 Xcode 라이브러리가 큰 주목을 받지 못하고 있다는 점을 언급하며, 이러한 기능들이 더 개선되기를 기대합니다.\n\n**핵심 키워드**: Xcode, Swift Package Manager, 라이브러리, SwiftSyntax, 플러그인","keywords":["DeveloperTools","영어","pick"]},{"comments":"iOS 18.2 와 함께 변경된 내용들 - 새로운 기능들을 정리한 글입니다","keywords":["Culture"],"summary":"","title":"iOS 18.2 Released — 25+ Amazing New Features You NEED To Try Now! | by Nikhil Vemu ","location":"https:\/\/medium.com\/macoclock\/ios-18-2-released-25-amazing-new-features-you-need-to-try-now-edd799bf22d5"},{"summary":"","keywords":["Culture"],"comments":"벌써 아이폰 17 루머가 나오는군요. 아이폰 에어가 나오려나요?","location":"https:\/\/medium.com\/macoclock\/iphone-17-everything-we-know-so-far-3501f5499334","title":"iPhone 17: Everything we know so far | by Sareena "},{"keywords":["Swift","영어"],"location":"https:\/\/www.swiftwithvincent.com\/blog\/let-is-a-lie-sometimes?","title":"let is a lie (sometimes) — Swift with Vincent","comments":"let 표기는 가끔씩 거짓말을 한다고 실험적으로 증명하려고 합니다. let 으로 한다고 절대 바뀌지 않는 걸까요? ","summary":""}]}