{"version":"1.0","sequence":122,"items":[{"comments":"애플 사용자들은 애플이 어떤 제품을 만들기를 원할까요. 10가지 가장 기대하는 것들이 있다고 말합니다. 이 중에 어떤게 관심있으신가요? ","summary":"","keywords":["Culture"],"title":"10 Things We Apple Users Desperately Want | by The Evil Geek ","location":"https:\/\/evilgeek.medium.com\/10-things-we-apple-users-desperately-want-b27e2e91b610"},{"keywords":["Framework"],"location":"https:\/\/medium.com\/@AshAsoyan\/10-ios-performance-optimization-hacks-every-developer-should-know-8d5cfd421aec","summary":"","title":"10 iOS Performance Hacks for Faster Apps | Medium","comments":"앱 동작을 더 빠릿하게 만드는 10가지 방법을 제안합니다. 뷰 레이아웃 계산을 줄이거나 동작을 최소화하는 방식들 팁이라고 할 수 있습니다"},{"location":"https:\/\/medium.com\/macoclock\/8-ios-18-accessibility-features-i-use-daily-and-you-should-too-31ccd42c371f","title":"8 iOS 18 Accessibility Features I Use Daily (And You Should Too) | by The Useful Tech ","comments":"개발 단계에서 접근성을 지원하는 것은 iOS 에서 접근성 기능이 무엇이 있는지 인식하는 것부터 일 겁니다. iOS 18에서 새로운 제공하는 접근성 기능들을 소개합니다","summary":"","keywords":["Accessibility"]},{"title":"9 Takeaways from The Pragmatic Programmer | by Kay Jan Wong ","summary":"\"실용주의 프로그래머\" 책에서는 프로그래밍 및 개발에 대한 유용한 원칙과 실천을 강조하며, 다음과 같은 주요 개념을 제시합니다. 첫째, 책임감과 적극성을 가지고 코드를 즉시 수정하고, 나쁜 디자인과 고유 코드를 다루어야 합니다. 둘째로 항시 변화하는 프로젝트에 적합한 유연한 코드를 작성해야 하며, \"트레이서 총알\" 개념을 활용해 프로토타입의 연속적 진화를 고려합니다. 셋째, 도구 사용 능력을 향상시켜 개발 효율성을 높이고, 네 번째로 다른 사람을 신뢰하지 않고 방어적인 코딩을 실천해야 합니다. 다섯째, 유연한 코드는 적은 양의 코드로도 작성하지만, 디커플링을 통해 더 많은 코드를 필요로 할 수 있습니다. 여섯째, 동시성을 안전하게 구현하며, 일곱 번째는 코드 작성 시 다양한 판단 기준을 사용하여 품질 높은 코드를 만들어야 합니다. 여덟 번째, 요구 사항 수집 과정에서 사용자와 협력해 상호작용해야 하며, 마지막으로 아홉 번째는 각 팀에 적합한 방법을 채택해야 합니다. 이들은 모두 지속적인 학습과 적응력을 필요로 합니다.\n\n**주요 키워드:** 프로그래밍, 책임감, 유연한 코드, 요구 사항 수집, 지속적인 학습","keywords":["Culture"],"location":"https:\/\/medium.com\/data-science-collective\/9-takeaways-from-the-pragmatic-programmer-3221ee77d045","comments":"\"실용주의 프로그래머\" 책에서 배울 수 있는 9가지에 대해 이야기합니다. 책임감 있고 적극적인 자세로 방어적인 코드를 작성하는 것이 말처럼 쉬운 게 아니니까 강조하는 것 같습니다. 오래된 책이지만 한국어 번역도 훌륭해서 추천할 만 합니다"},{"title":"Advice I Wish I Had Gotten Earlier","keywords":["Culture","영어"],"summary":"이 글에서는 기술 산업에서의 경력을 통해 얻은 몇 가지 조언을 공유하고 있습니다. 각 조언은 독립적이며 독자가 현재의 상황에 어떻게 적용할 수 있을지 반영해보기를 권장합니다.\n\n주요 내용은 다음과 같습니다:\n\n1. **학습**: 기술 서적과 블로그 게시물을 읽고, 질문을 많이 하며 호기심을 유지하는 것이 중요합니다. 사이드 프로젝트에 참여해 실질적인 학습 경험을 쌓고, CI나 백엔드와 같은 새로운 분야를 탐색하는 것을 추천합니다.\n   \n2. **성장**: 적극적이고 팀 플레이어가 되어야 합니다. 단위 테스트와 자동화의 중요성 또한 강조되며, 이는 실습을 통해 배워나가야 합니다.\n\n3. **네트워킹**: 강력하고 광범위한 네트워크를 구축하는 것의 중요성을 설명합니다. 더 많은 사람들과 연결될수록 더 많은 기회를 얻게 됩니다.\n\n4. **문서화**: 블로그를 시작하고, 주간 작업 로그를 유지함으로써 자신의 작업을 문서화하고 베스트 프랙티스를 정리하는 것이 좋습니다. 이는 무형의 자산을 쌓는 데 큰 도움이 됩니다.\n\n마지막으로, 긍정적인 에너지를 항상 유지해야 한다고 강조하며, 이 태도가 모든 과제에 긍정적인 영향을 미친다고 말하며 글을 마감합니다.\n\n**핵심 키워드**: 학습, 성장, 네트워킹, 문서화, 긍정적 에너지","location":"https:\/\/manu.show\/2025-02-22-advice-i-wish-i-had-gotten-earlier\/?","comments":"이번 호에는 개발자 자세에 대한 글이 몇 개 있네요. 학습하고 팀에 기여하도록 성장하며 더 많은 사람들과 연결되도록 네트워킹을 하면서 자신의 작업을 기록하도록 권장하네요"},{"title":"Animatable Protocol - Taming Unruly SwiftUI Animations","comments":"SwiftUI Animatable 애니메이션 다루는 설명 중에서 가장 좋은 글 중에 하나 같습니다. ","summary":"","keywords":["SwiftUI","영어"],"location":"https:\/\/fatbobman.github.io\/en\/posts\/animatable-protocol-taming-unruly-swiftui-animation\/"},{"keywords":["Culture","영어"],"title":"Apple's Software Quality Crisis: When Premium Hardware Meets Subpar Software - Eliseo Martelli","location":"https:\/\/www.eliseomartelli.it\/blog\/2025-03-02-apple-quality","comments":"애플 제품이 고품질 하드웨어에 저품질 소프트웨어가 문제가 되고 있다고 지적합니다. 최적화보다 기능 추가에 집중하는 애플의 요즘 분위기를 지적하는 글입니다. ","summary":"2025년 3월 5일에 업데이트된 글에서, 필자는 애플의 iPad Air 11\" M2에서 애플 펜슬 프로로 필기를 할 때 발생하는 과열과 지연 문제를 경험했습니다. 이는 단순한 하드웨어 문제가 아닌 소프트웨어 최적화의 문제로 보입니다. 기본적인 애플 애플리케이션인 노트와 프리폼을 사용할 때 심각한 성능 저하가 발생하고, 기기가 과열되어 사용이 불편해지는 상황을 겪었습니다. 필자는 이러한 문제가 단순히 개인적인 문제뿐만 아니라 많은 사용자들이 경험하고 있는 공동의 것임을 강조하며, 애플의 소프트웨어 품질 저하를 지적하고 있습니다.\n\n애플의 제품이 프리미엄 가격을 지불해야 할 만큼의 가치를 제공하지 못하게 된 상황에서, 사용자 경험과 안정성이 우선시되어야 한다고 주장합니다. 최적화가 아닌 기능 추가에 더 집중하는 애플의 방향성도 문제로 지적하며, 사용자들은 투명성을 요구하고 기본적인 성능 향상에 중점을 두어야 한다고 강조하고 있습니다. 결국, 애플은 사용자 경험을 다시금 중시해야 한다고 결론짓습니다.\n\n**핵심 키워드**: 애플, 소프트웨어 품질, 문제, 하드웨어, 사용자 경험."},{"summary":"","title":"Apple, Apple Silicon의 능력을 한층 끌어올릴 M3 Ultra 칩 공개 - Apple (KR)","location":"https:\/\/www.apple.com\/kr\/newsroom\/2025\/03\/apple-reveals-m3-ultra-taking-apple-silicon-to-a-new-extreme\/","comments":"드디어 M3 Ultra 칩이 나왔네요. M4 Max 까지 나온 순간에서야 M3 Ultra 가 나온 것은 제품 출시 주기에도 영향을 주는 것 같습니다","keywords":["APPLE"]},{"location":"https:\/\/www.apple.com\/kr\/newsroom\/2025\/03\/apple-introduces-the-new-macbook-air-with-the-m4-chip-and-a-sky-blue-color\/","comments":"신형 M4 칩을 달고 맥북 에어가 나왔습니다. 외장 디스플레이를 닫지않고 2대까지 연결할 수 있다고 합니다","summary":"","keywords":["APPLE"],"title":"Apple, M4 칩을 탑재한 신규 MacBook Air를 새로운 스카이 블루 색상과 함께 공개 - Apple (KR)"},{"title":"Apple, Mac 사상 가장 강력한 신규 Mac Studio 공개 - Apple (KR)","comments":"이제 맥 스튜디오도 M4 Max 와 M3 Ultra 를 선택할 수 있습니다. 썬더볼트 5를 지원하며 512GB 메모리를 선택할 수 있습니다. 512GB 옵션 선택 가격은 1천480만원이네요!","summary":"","keywords":["APPLE"],"location":"https:\/\/www.apple.com\/kr\/newsroom\/2025\/03\/apple-unveils-new-mac-studio-the-most-powerful-mac-ever\/"},{"comments":"아이패드 급나누기로 M3 칩을 탑재한 아이패드 에어가 나왔습니다. 이전 세대 아이패드 프로에 가까워졌네요","location":"https:\/\/www.apple.com\/kr\/newsroom\/2025\/03\/apple-introduces-ipad-air-with-powerful-m3-chip-and-new-magic-keyboard\/","title":"Apple, 강력한 M3 탑재 iPad Air 및 신규 Magic Keyboard 공개 - Apple (KR)","summary":"","keywords":["APPLE"]},{"summary":"애플이 최근 영국 정부의 결정으로 iOS 사용자들의 보안 시스템을 비밀스럽게 조작하라는 명령을 받았습니다. 이에 따라 애플은 영국 사용자에 대한 보안 기능을 비활성화할 것이라고 발표했습니다. 이는 영국에서 통과된 '조사 권한법(스누퍼스 찰터)'의 일환으로, 정부가 기술 기업들에 대해 감시를 위해 소프트웨어를 조작할 수 있는 권한을 부여한 법입니다. 법의 불안정성은 해커들이 보안 시스템의 약점을 이용할 수 있다는 점에서 더욱 부각됩니다. \n\n2022년부터 애플은 '고급 데이터 보호' 기능을 통해 클라우드 백업에 전방위 암호화를 제공해 왔으나, 이번 조치로 인해 모든 영국 iOS 사용자들이 심각한 위험에 처할 가능성이 큽니다. 이는 애플이 사용자 정보를 보호하기 위한 고유의 기능을 해제하는 결과를 초래합니다. \n\n애플은 그동안도 법적 압력 아래에서 보안 기능을 수정해 온 사례가 있으며, 그로 인해 사용자는 점점 더 많은 개인정보 노출 위험에 직면하게 됩니다. 애플의 비즈니스 모델이 기본적으로 사용자 보안 관리를 부정적으로 영향을 미치는 방식으로 운영되고 있다는 점에서도 문제의 심각성이 더해집니다.\n\n따라서 기술 기업이 정부의 요구를 협조할 경우 그 리스크와 두려움은 대폭 증가하며, 이는 결국 일반 사용자에게 치명적인 영향을 미칩니다.\n\n**주요 키워드**: 애플, 스누퍼스 찰터, 보안, 암호화, 사용자 개인정보.","keywords":["Culture"],"title":"Apple’s encryption capitulation | by Cory Doctorow ","comments":"영국에서 제정한 '조사 권한법'에 따라서 정부가 기술 기업들에게 감시를 위한 조작을 요청할 수 있고 애플도 결국 보안 기능을 비활성화하게 되며, 감시 대상이 될 사람들은 해외에서 아이폰을 구매하는 식으로 우회하면, 결국 일반 소비자들이 피해볼 꺼라는 얘기입니다","location":"https:\/\/doctorow.medium.com\/https-pluralistic-net-2025-02-25-sneak-and-peek-pavel-chekov-ccdaec5fb03b"},{"comments":"디자이너가 팬톤 컬러를 기준으로 데이터 컬러를 구분할 수 있도록 ChatGPT 와 DeepSeek를 사용하면 어떤 결과를 얻게 될까 궁금하시다면 추천드립니다","summary":"","title":"ChatGPT vs DeepSeek: suggestions of diverging data color schemes | by Theresa-Marie Rhyne ","keywords":["Design"],"location":"https:\/\/uxdesign.cc\/chatgpt-vs-deepseek-suggestions-of-diverging-data-color-schemes-bb2e58e6c374"},{"title":"Clean your dead code with Periphery 3.0 on iOS - Ultimate guide | by Christopher Saez ","comments":"Periphery 를 활용해서 사용하지 않는 죽은 코드를 찾아서 지우는 과정을 설명합니다. CI 도구에서 적용하는 것은 할만 한 것 같습니다","location":"https:\/\/medium.com\/@SaezChristopher\/clean-your-dead-code-with-periphery-3-0-on-ios-ultimate-guide-23b86aa93fc5","keywords":["DeveloperTools"],"summary":""},{"comments":"","summary":"","location":"https:\/\/serialcoder.dev\/text-tutorials\/swiftui\/customizing-and-animating-sf-symbols-in-swiftui\/","keywords":["SwiftUI","영어"],"title":"Customizing and Animating SF Symbols in SwiftUI - SerialCoder.dev"},{"comments":"존 그루버에 의하면 \"더 개인화한 시리\"를 애플 인텔리전스 기능이 늦춰져서 다음 iOS 메이저 버전에나 들어갈 것 같다고 합니다. 이게 들어가야 앱 끼리 연결도 훨씬 수월할 것 같은 데 아쉽네요","summary":"","title":"Daring Fireball: Apple Is Delaying the ‘More Personalized Siri’ Apple Intelligence Features","keywords":["AI\/ML","영어"],"location":"https:\/\/daringfireball.net\/2025\/03\/apple_is_delaying_the_more_personalized_siri_apple_intelligence_features"},{"keywords":["SwiftUI","영어"],"comments":"스크롤 할 때 보여지는 영역에 대해서 미리 계산해서 마치 테이블뷰처럼 보여지도록 표시하는 방식을 설명합니다","title":"Designing a custom lazy list in SwiftUI with better performance","summary":"","location":"https:\/\/nilcoalescing.com\/blog\/CustomLazyListInSwiftUI\/"},{"summary":"이 글에서는 generative AI 경험을 위한 디자인의 중요성과 이를 구현하기 위한 디자이너의 역할에 대해 다룹니다. 저자 버로니카 페이통 첸은 AI와의 첫 만남과 그로 인해 디자인 분야에서 변화된 사용자 기대에 대해 설명합니다. 사용자들은 이제 개인화된 추천과 직관적인 시스템을 요구하며, 이는 UX 디자이너가 보다 자연스럽고 인간 중심의 경험을 만들어 나가야 하는 필요성을 강조합니다.\n\nAI는 데이터 패턴 인식과 분류, 예측 및 추천 기능 등 다양한 가능성을 가지고 있지만, 여전히 인간의 감정이나 문화적 맥락을 완벽하게 반영하지 못합니다. 디자이너는 사용자와 AI 간의 상호작용을 강화하고 인간적 요소를 끌어내는 데 집중해야 합니다. 이를 위해 AI 경험 설계에서 사용자의 피드백을 반영하고, 개인의 선택을 존중하는 디자인이 필요합니다.\n\nAI 디자인의 핵심 책임으로는 사용자 주도의 경험 설계, 기술에 대한 신뢰 구축, 그리고 실험과 학습을 통한 지속적인 혁신이 있습니다. 디자이너는 데이터 과학에 대한 기본 지식을 갖추고, AI 툴을 활용해보며 커뮤니티와 협력하는 것도 중요합니다. AI가 통합된 제품의 성공은 이러한 디자인 접근 방식에 달려 있습니다.\n\n**주요 키워드:** AI 디자인, 사용자 경험, 개인화, 신뢰 구축, 데이터 과학","comments":"어도비 블로그 글을 공유할 줄은 몰랐습니다. 생성형 AI 경험을 위한 디자이너의 역할과 디자인하기 위한 방식을 설명합니다. AI 와 사용자 상호 작용은 새로운 준비가 필요한 것 같습니다","title":"Designing for generative AI experiences | by Adobe Design ","keywords":["Design"],"location":"https:\/\/medium.com\/@Adobe_Design\/designing-for-generative-ai-experiences-a8df484dc61f"},{"summary":"VSCode의 인기 테마 중 하나인 'Material Theme - Free'의 개발자인 Mattia Astorino는 최근 이 테마에 악의적인 코드가 포함되어 있다고 주장한 Amir Assaraf의 분석 후, Microsoft에 의해 비극적인 조치가 취해졌습니다. Microsoft는 이 테마를 VSCode 마켓플레이스에서 삭제하고, 관련된 모든 확장 프로그램을 제거하며, Mattia를 VSCode 에코시스템에서 차단했습니다. 이로 인해 약 300만 대의 기기에서 해당 확장 프로그램이 비활성화되었습니다.\n\nMattia는 그의 테마에 악성 코드가 포함되어 있지 않다고 주장하며, 문제가 된 것은 더 오래된 의존성이 업데이트되지 않은 것일 수 있다고 밝혔습니다. Microsoft 측에서도 이 확장 프로그램이 악의적인 활동을 하지 않았음을 인정했지만, 당초 조치는 심각한 보안 우려로 인해 내려진 것이었습니다.\n\n이 사건은 VSCode 사용자들 사이에서 큰 논란을 일으켰습니다. Microsoft의 신속한 조치가 과도한 것은 아닌지에 대한 논의가 이어졌으며, 개발자들은 신뢰를 잃을 수도 있다는 우려를 나타냈습니다. 사건의 전말과 관련된 여러 주장과 의견이 교환되면서, VSCode의 보안 신뢰도가 중요한 문제로 부각되었습니다.\n\n**키워드:**\n1. 악성 코드\n2. Microsoft\n3. VSCode\n4. 확장 프로그램\n5. 보안","comments":"VSCode 인기 테마 중에 하나인 'Material Theme' 테마에 악성코드가 포함되어 있다고 알려진 직후에 MS는 마켓에서 삭제하고 개발자 Mattia를 차단한 사건이 있었습니다. 추후에 오래된 의존성이 업데이트되지 않았고 악의적인 활동이 아니라고 인정했지만 이미 조치가 늦었다고 말합니다","title":"Developers Shocked. Microsoft Disabled VSCode Theme On 3 Million Devices | by Tom Smykowski ","keywords":["Culture"],"location":"https:\/\/tomaszs2.medium.com\/developers-shocked-microsoft-disabled-vscode-theme-on-3-million-devices-b04480b68e63"},{"location":"https:\/\/mahmudul-razib.medium.com\/effective-debugging-and-centralized-logging-in-ios-swift-swiftui-using-unified-logging-system-3e1f54a2409b","summary":"","keywords":["Framework"],"title":"Effective Debugging and Centralized Logging in iOS (Swift, SwiftUI) using Unified Logging System | by Mohammad Mahmudul Hasan ","comments":"뷰와 로직에 로그를 통합해서 기록하고 효과적인 디버깅을 하는 방식을 제안합니다. 거창한 방식이라기 보다는 어찌보면 단순한 접근이죠"},{"title":"Finding Balance in Software Development — The Importance of Context | by Mario Bittencourt ","summary":"\n마리오 비텐쿠르트는 소프트웨어 개발 및 아키텍처 분야에서 다양한 원칙과 패턴(예: SOLID 원칙, 클린 코드, 육각형 아키텍처 등)의 중요성에 대해 다루고 있습니다. 하지만 이러한 패턴을 모든 프로젝트에 일괄적으로 적용해야 한다는 주장과 이를 회의적으로 바라보는 주장이 대립하고 있으며, 이 극단적인 접근은 바람직하지 않다고 강조합니다. \n\n개발자는 작업의 성격에 따라 적절한 방식을 선택하는 것이 중요합니다. 특정 도구나 패턴의 복잡성을 이유로 과도하게 사용하지 않거나, 항상 일관되게 사용해야 한다고 주장하는 것은 위험합니다. 특히, 문제를 잘 이해하지 않고 사용하게 되면 오히려 역효과를 초래할 수 있습니다. 따라서, 개발팀은 그들이 사용하는 패턴이나 도구가 적합한지를 판단할 수 있는 지식이 필요합니다. 이러한 지식은 지속적으로 쌓아가야 하며, 팀원 간의 소통과 협력이 중요합니다.\n\n결론적으로, 비텐쿠르트는 상황과 맥락을 이해하고, 그에 맞춰 적절한 원칙과 패턴을 선택하는 것이 소프트웨어 개발의 성공에 필수적이라고 강조합니다.\n\n**핵심 키워드:** 소프트웨어 개발, 균형, 패턴, 맥락, 지식","comments":"소프트웨어 개발 업계에서 SOLID 나 클린 코드처럼 유명한 규칙이나 관점이 있지만, 그걸 맹목적으로 극단적으로 따라하는 접근은 바람직하지 않다고 말합니다. 개발 과정에서 균형을 찾는다는 것은 어떤 의미일까요","keywords":["Culture"],"location":"https:\/\/medium.com\/ssense-tech\/finding-balance-in-software-development-the-importance-of-context-463ececf309b"},{"location":"https:\/\/medium.com\/@AshAsoyan\/cross-platform-vs-native-why-i-regret-using-flutter-for-my-ios-app-ade386139ed2","comments":"크로스 플랫폼으로 모바일 앱 개발하는 사례가 점점 늘어나고 있지만, 반면에 그 어두운 측면에 대해서는 잘 공유가 안되는 것 같습니다. 크로스 개발 환경에서도 신경써야 하지만 결국 디버깅을 위해서는 모든 플랫폼에서 네이티브로 접근해야 하는 경우가 많죠. 그 후회를 솔직하게 설명하는 글입니다","keywords":["Culture","pick"],"summary":"","title":"Flutter vs Native iOS: My Cross-Platform Regret | Medium"},{"location":"https:\/\/uxdesign.cc\/how-culture-shapes-ux-western-vs-asian-product-design-3f0116c19581","keywords":["Design"],"comments":"서양 선호 UX 와 동양 선호 UX가 문화적으로 다를 수 있지만 모바일 앱 만큼 글로벌 마켓에 접근한다면 어떤 고민이 필요한지 설명하는 글입니다","title":"How culture shapes UX: Western vs. Asian product design | by Kristina Volchek ","summary":""},{"comments":"macOS 커널에서 커널 모드로 동작하는 코드를 작성하려면 커널 익스텐션으로 구현해야 합니다. 줄여서 kext 라고 부르는 커널 익스텐션을 만들고 구현하는 방식을 설명합니다. 저도 공부용으로 가져왔습니다","location":"https:\/\/karol-mazurek.medium.com\/kernel-extensions-on-macos-1b0f38b632ea","keywords":["AppKit"],"title":"Kernel Extensions on macOS | Medium","summary":""},{"keywords":["AppKit"],"location":"https:\/\/karol-mazurek.medium.com\/mach-ipc-security-on-macos-63ee350cb59b","title":"Mach IPC Security on macOS | Medium","summary":"","comments":"macOS 커널 익스텐션과 함께 살펴봐야 하는 것이 마하 커널 기반 IPC 보안입니다. 커널 수준에서 Port 로 이벤트가 전달되는 구조와도 관련이 있습니다"},{"comments":"유럽 연합에 이어서 브라질에서도 앱 스토어 이외에 사이드로딩을 허용해야 한다는 판결이 나왔고 3개월 이내에 변경 사항을 적용하라는 결정이라고 합니다","location":"https:\/\/mjtsai.com\/blog\/2025\/03\/07\/brazilian-court-mandates-ios-sideloading\/","keywords":["Culture","영어"],"title":"Michael Tsai - Blog - Brazilian Court Mandates iOS Sideloading","summary":"2025년 3월 7일, 브라질에서 한 연방법원이 애플이 iOS 생태계를 제3자 앱에 개방해야 한다고 판결했습니다. 이는 애플이 유럽연합의 규제에 따라 취한 조치와 같은 방향이며, 판사는 애플이 개발자들에게 부과한 \"제한\"이 새로운 경쟁자의 진입을 위협할 수 있다고 판단했습니다. \n\n2024년 11월, 브라질의 반독점 규제 기관인 \"Cade\"는 애플이 개발자들이 애플스토어 외부에서 콘텐츠를 판매하거나 앱을 배포하는 것을 막을 수 없다고 결정했습니다. 애플은 브라질의 반독점 법규를 준수하지 않을 경우 하루에 4만 달러 이상의 벌금을 부과받을 수 있습니다.\n\n판사 파블로 주니가는 애플이 향후 3개월 안에 필요한 변경 사항을 시행하라고 명령했습니다. 그는 애플이 주장하는 바와 달리, 다른 국가에서도 유사한 의무를 이행한 경험이 있으며, 이로 인해 사업 모델에 중요한 영향이나 회복할 수 없는 피해가 발생하지 않았음을 언급했습니다.\n\n이러한 변화는 전 세계적으로 규제가 강해지고 있다는 것을 나타내며, 애플은 이러한 상황을 단순하게 대처하든지, 아니면 매번 국가별로 힘든 싸움을 계속 진행해야 할 처지에 놓였습니다.\n\n**핵심 키워드:** 브라질, 애플, iOS, 반독점, 제3자 앱"},{"comments":"스위프트 6.1 베타가 나왔고 흥미로운 내용이 적용되어 있다고 합니다. 구 중에서 가장 관심을 받았던 'isolated synchronous deinit'은 제외됐고 글로벌 액터에 대한 변경이나 태스크 그룹에서 타입 추론도 개선됐다고 합니다","summary":"Swift 6.1 베타 버전이 드디어 출시되었습니다. 이 새로운 버전에는 동시성(Concurrency) 사용자들에게 흥미로운 기능이 포함되어 있습니다. 하나의 주요 요소인 'isolated synchronous deinit'는 이 버전에서는 포함되지 않지만, 향후 릴리스에 추가될 예정입니다. 이 기능은 deinit이 고립(Isolated)되도록 하여 주 스레드(MainActor)와의 연계를 가능하게 합니다.\n\n또한, nonisolated 키워드를 통해 전역 액터로의 추론을 방지하는 새로운 기능도 도입되었습니다. 사용자 정의 프로토콜을 MainActor 타입에 적용할 때, nonisolated를 클래스 확장으로 이동시킬 수 있어 더 직관적인 사용이 가능해졌습니다.\n\nTaskGroup의 ChildTaskResult 타입 추론 기능도 개선되었습니다. 이제 'withTaskGroup' API를 사용할 때, 명시적으로 타입을 지정할 필요가 없이 자동으로 추론됩니다.\n\n이외에도 Swift 6.1은 여러 진단 개선 사항을 포함하고 있으며, 컴파일러의 보수적이던 'sending' 키워드 처리가 더 나아졌습니다. 앞으로 Swift의 데이터 경쟁(Data-race) 안전성을 개선하는 데 중점을 둔 다양한 작업들이 진행될 예정이며, 앞으로의 변화가 기대됩니다.\n\n**핵심 키워드:**\n1. Swift 6.1\n2. 동시성\n3. isolating synchronous deinit\n4. nonisolated 키워드\n5. TaskGroup 개선","title":"New Concurrency Stuff with 6.1 | massicotte.org","location":"https:\/\/www.massicotte.org\/concurrency-6_1","keywords":["Swift","영어"]},{"keywords":["AI\/ML","영어"],"comments":"NSHipster 저자 Matt 가 오랜만에 글을 올리면서 Ollama 설치와 함께 임베딩, RAG 등을 설정하는 방법을 설명합니다. 예전 맥 개발자들도 AI 도구를 적용하는 사례가 늘어나는 것 같습니다","location":"https:\/\/nshipster.com\/ollama\/","title":"Ollama - NSHipster","summary":""},{"location":"https:\/\/medium.com\/@mhamdouchi\/responsive-design-in-swiftui-adapting-to-all-screen-sizes-87d6e66f87fa","summary":"","comments":"모든 화면 크기에 반응하는 화면을 위해 적용해야 하는 사항들을 꼼꼼하게 짚어줍니다. ","keywords":["SwiftUI"],"title":"Responsive Design in SwiftUI: Adapting to All Screen Sizes | by Mohamed Hamdouchi "},{"comments":"`~Copyable` 프로토콜과 관련해서 추가된 borrow, consume, inout 키워드에 대해 고려해 볼 만한 내용들입니다. ","title":"Safer Swift: How ~Copyable Prevents Hidden Bugs","keywords":["Swift","영어"],"location":"https:\/\/arturgruchala.com\/safer-swift-how-copyable-prevents-hidden-bugs\/?","summary":""},{"location":"https:\/\/medium.com\/@nimjea\/server-driven-ui-vs-static-ui-the-future-of-dynamic-ios-apps-70f443a9f9cc","comments":"서버 주도 UI 화면을 구성하기 위해서 적합한 구조와 방식에 대해 설명합니다. 모든 것이 좋다기 보다는 나쁜 이유도 같이 설명해서 좋네요","keywords":["SwiftUI"],"title":"Server-Driven UI vs. Static UI | by Anand Nimje ","summary":""},{"title":"Swift KeyPaths: The hidden gem you’re not using enough | by Tom K ","keywords":["Swift"],"location":"https:\/\/medium.com\/@tttttkkkkk\/swift-keypaths-the-hidden-gem-youre-not-using-enough-4dc695bb0664","summary":"","comments":"키패스 자주 쓰시나요? 키패스를 의미 있게 사용하는 방법을 알려준다고 합니다. `@dynamicMemberLookup` 과 함께 쓰면 더 편리한 방식입니다"},{"keywords":["ServerSide","Swift","영어"],"comments":"Things 라는 GTD 방식 일감 관리로 나름 유명한 앱이 있습니다. 개발사 Cultured Code는 동기화 서비스 Things Cloud 를 Vapor 와 NIO 스위프르 기반으로 개발했다고 합니다. ","summary":"","title":"Swift.org - How Swift's server support powers Things Cloud","location":"https:\/\/www.swift.org\/blog\/how-swifts-server-support-powers-things-cloud\/?"},{"title":"SwiftUI: Connect Two Points with Straight Line Segments + Rounded Corners | by Itsuki ","summary":"","keywords":["SwiftUI"],"location":"https:\/\/levelup.gitconnected.com\/swiftui-connect-two-points-with-straight-line-segments-rounded-corners-dbbad5f27ab4","comments":"두 점을 연결하기 위해 여러 형태 PATH를 만드는 이거 재밌네요. 아주 예전에 Visio 처럼 동작하는 앱을 만들었던 기억이 났습니다"},{"comments":"스크롤하는 시점에 트랜지션 애니메이션을 만드는 다양한 방법을 설명합니다","summary":"","location":"https:\/\/www.createwithswift.com\/symmetrical-and-asymmetrical-transitions-in-swiftui-with-the-scroll-transition-modifier\/?","keywords":["SwiftUI","영어"],"title":"Symmetrical and asymmetrical transitions in SwiftUI with the Scroll Transition modifier"},{"keywords":["Swift"],"location":"https:\/\/medium.com\/@alicantarim\/task-cancellation-in-swift-concurrency-3137c78ca871","title":"Task Cancellation in Swift Concurrency | by Alican Tarım ","comments":"스위프트에서 진행중인 태스크 자체를 외부에서 취소하지 않고, 태스크에게 취소 표시했다고 알려주는 방식입니다. 태스크 취소가 필요한 시점에 취소 처리하는 방법에 대해 설명합니다","summary":""},{"title":"Task.sleep() vs. Task.yield(): The differences explained","comments":"태스크를 잠재우는 sleep() 과 양보하는 yield() 차이를 간단하게 설명합니다. ","location":"https:\/\/www.avanderlee.com\/concurrency\/task-sleep-vs-yield-differences\/?","summary":"","keywords":["Swift"]},{"summary":"","comments":"재미있는 관점의 글이네요. 사람들을 더욱 가깝게 느낄 수 있도록 도와주는 애플 생태계 기능들은 무엇이 있는지 설명합니다. 자주 활용하고 계신가요?","keywords":["Culture"],"title":"The 10 Apple Ecosystem Features That Bring People Closer | by Aditya Darekar ","location":"https:\/\/medium.com\/macoclock\/to-ifamily-ifriends-10-apple-ecosystem-features-that-bring-people-closer-a57a4c30fc05"},{"keywords":["Swift"],"location":"https:\/\/itnext.io\/userdefaults-and-observation-in-swiftui-how-to-achieve-precise-responsiveness-2bd8bda1568e","comments":"`@AppStorage` 속성 래퍼를 통합 관리하기 위해서 Observation 프레임워크와 `@ObservableDefaults` 매크로를 활용하는 방식을 설명합니다. 살짝 낯선 문법이지만 저장하기에 좋은 구조를 만들 수 있네요","title":"UserDefaults and Observation in SwiftUI: How to Achieve Precise Responsiveness | ITNEXT","summary":"SwiftUI에서 Apple의 @AppStorage 속성 래퍼는 개발자가 사용자 기본 설정 내용을 응답하고 수정하는 과정을 간편하게 만들어 줍니다. 그러나 Observation 프레임워크의 도입으로 인해 여러 가지 도전과제가 생겼습니다. 특히, Apple이 Observation에 적합한 UserDefaults 관리 솔루션을 제공하지 않고 있어, 이 글에서는 Observation 프레임워크 하에서 UserDefaults를 효율적으로 관리하는 방법을 제안합니다.\n\n@AppStorage는 각 UserDefaults의 키-값 쌍에 효율적으로 응답하고 수정하는 데 유용하지만, 여러 값을 관리할 때 코드가 복잡해지고 키 이름의 오타 위험이 증가합니다. 이를 해결하기 위해 @AppStorage와 @Published를 사용하여 ObservableObject 내에서 여러 @AppStorage를 통합 관리할 수 있는 방법을 제시합니다. \n\n그러나 ObservableObject의 알림 메커니즘에는 한계가 있어, ObservableObject 내의 값 변경 시 전체 뷰가 다시 그려지는 문제가 있습니다. 새로운 Observation 프레임워크는 이러한 비효율성을 해결할 수 있는 희망을 제공하지만, 여전히 적절한 UserDefaults 포장 솔루션이 없습니다. \n\n저자는 @ObservableDefaults라는 매크로를 사용하여 외부에서의 UserDefaults 수정 사항에도 반응할 수 있는 조치를 취했습니다. 이 매크로는 모든 저장된 변수를 자동으로 UserDefaults 키와 연결하고, 이를 통해 외부에서 수정되는 내용을 감지하여 알림을 보내는 시스템을 구축했습니다. \n\n결론적으로, Observation 프레임워크와 @ObservableDefaults를 통해 SwiftUI에서 UserDefaults 관리를 개선할 수 있으며, 다양한 프로퍼티의 상태 관리를 효과적으로 수행할 수 있음을 강조했습니다.\n\n**핵심 키워드**: SwiftUI, @AppStorage, Observation 프레임워크, UserDefaults, @ObservableDefaults"},{"location":"https:\/\/medium.com\/@mihail_salari\/why-you-should-choose-userdefaults-suite-over-the-singleton-default-instance-a-deep-dive-for-ios-993197d58f5e","title":"UserDefaults suite over the singleton default instance: A deep dive for iOS Developers | by Mihail Salari ","summary":"","keywords":["Framework"],"comments":"UserDefaults 를 다루면서 관심사 분리를 해보셨나요? 의미있는 단위로 UserDefaults를 구분하는 방식을 제안합니다"},{"comments":"최근 Cursor 개발 환경 설정 글들이 매번 있는 것 같습니다. 이번에는 Xcode 와 안드로이드 스튜디오를 위한 설정을 한꺼번에 설명합니다","keywords":["AI\/ML"],"summary":"","location":"https:\/\/itnext.io\/using-cursor-with-xcode-and-android-studio-439d0ef635f4","title":"Using Cursor with Xcode and Android Studio | ITNEXT"},{"summary":"","title":"VariadicView | by Jacob Bartlett ","comments":"`_VariadicView` 라는 내장 private 스러운(?) API에 대한 설명입니다. 내부에서 동작하는 방식을 이해하는 데 도움이 됩니다. 이 글을 읽고 다른 글들도 찾아보시면 도움이 되실 겁니다","keywords":["SwiftUI"],"location":"https:\/\/levelup.gitconnected.com\/secret-swiftui-a-practical-use-for-variadicview-375779271b82"},{"title":"What is Structured Concurrency? - SwiftLee","keywords":["Swift"],"comments":"도대체 구조적인 동시성이 무엇일까요. 이제야 동시에 동작하는 비동기 코드를 구조적으로 작성할 수 있다는 의미일까요. SwiftLee가 그 배경에 대해 설명합니다","location":"https:\/\/www.avanderlee.com\/swift\/what-is-structured-concurrency\/?","summary":""},{"comments":"비교적(한국은 전혀 싸지 않지만) 저렴한 가격에 새로운 C1 모뎀 칩을 테스트할 수 있는 기회라는 것에 매우 동의합니다. ","keywords":["Hardware"],"location":"https:\/\/medium.com\/macoclock\/why-the-iphone-16e-is-apples-smartest-move-in-years-1faa54f8d47b","summary":"","title":"Why The iPhone 16e Is Apple’s Smartest Move In Years | by Aditya Darekar "},{"comments":"Tuist 팀에서 올해도 모듈화된 프로젝트 설정과 프레임워크나 라이브러리 링크를 관리하기 위해 필요한 것을 위해서 끊임없이 노력중이라고 말하네요. 새로운 빌드 시스템도 차츰 큰 역할을 할 지도 모르겠습니다","location":"https:\/\/tuist.dev\/blog\/2025\/02\/25\/project-generation","keywords":["DeveloperTools","영어"],"title":"Why you might want to generate your Xcode projects in 2025","summary":"2025년에도 Xcode 프로젝트 생성의 중요성\n\nApple이 SwiftPM과 Xcode의 빌드 시스템을 통합하고 오픈 소스화하였으며, Xcode 16은 Git 충돌 문제를 해결하였지만, 여전히 프로젝트 생성의 필요성이 존재합니다. 2025년의 모듈화된 Xcode 프로젝트는 빌드 설정과 프레임워크, 라이브러리 간의 링크를 관리하는 데 더 많은 복잡함을 초래합니다. 대규모 프로젝트에서는 수십 또는 수백 개의 모듈 간 의존성을 시각화하고 변경사항을 관리하기가 어려워집니다.\n\nSwiftPM의 채택이 증가하며 개발자들은 복잡한 모듈 프로젝트를 단순화하려 노력하고 있습니다. Tuist는 이러한 문제 해결을 위해 2017년부터 XcodeProj 및 Tuist 프로젝트 생성기를 개발하였습니다. 다른 툴들도 등장해 개발자에게 다양한 선택지를 제공합니다.\n\n2025년에는 프로젝트 생성이 확장 가능한 모듈 코드베이스 관리, 빌드 최적화, CI 시간 단축 등의 역할을 계속해서 하게 됩니다. iOS 개발 툴링의 미래는 유망하며, Apple은 Gradle 및 Bazel의 교훈을 반영하여 발전할 가능성이 큽니다. AI 및 혁신적인 편집기도 Xcode의 기능 확장을 도울 것입니다.\n\n결론적으로, iOS 개발 환경은 빠르게 변화하고 있으며, 다양한 솔루션이 조화를 이루어 최상의 경험을 창출할 것입니다.\n\n**핵심 키워드**: Xcode, 프로젝트 생성, 모듈화, SwiftPM, iOS 개발"},{"comments":"오랜만에 직접 Xcode 내부 동작을 설명하는 글을 작성했습니다. xctest가 동작하는 방식을 이해하려다가 시뮬레이터 디버깅까지 설명하는 글이 됐지만, 도움이 되실 겁니다. 처음으로 미디엄 paywall 글을 작성해봤는데 일주일 지나서 무료로 변경했습니다. ","summary":"","location":"https:\/\/medium.com\/@jungkim\/xcode-internals-%25EC%2588%25A8%25EA%25B2%25A8%25EC%25A7%2584-%25ED%2594%2584%25EB%25A1%259C%25EC%2584%25B8%25EC%258A%25A4-9565524084fc","title":"Xcode Internals : 숨겨진 프로세스 | by Jung Kim ","keywords":["DeveloperTools","한국어","pick"]},{"summary":"이 글에서는 Xcode가 느리게 빌드되는 원인과 이를 개선하기 위한 접근 방법에 대해 설명하고 있습니다. 저자는 자신이 개발 중인 Safari 확장 프로그램을 예로 들어, 빌드 과정 중 \"Gather provisioning inputs\" 단계에서 시간이 지체되는 문제를 발견했습니다. 이 단계는 전체 빌드 시간 중 50.6초나 걸리는데, 저자는 인터넷 연결을 차단했을 때 빌드 시간이 빠름을 알게 되었습니다. \n\nXcode가 애플의 여러 서버와의 연결을 요구하며, 특히 developerservices2.apple.com과의 연결이 느린 빌드를 유발하는 주요 원인으로 나타났습니다. 저자는 Little Snitch 소프트웨어를 사용하여 이러한 연결을 차단함으로써 빠른 빌드를 유지하고 있습니다. 또한 Xcode는 프로젝트를 열 때 appstoreconnect.apple.com와 통신하는데, 이는 유저의 식별 정보를 애플에 전송하는행위로 비춰질 수 있습니다. 저자는 Xcode가 개발자 데이터를 수집하는 기기라는 인식을 하고 있습니다.\n\n결론적으로, Xcode의 여러 연결은 필수적이지 않으며 사용자가 통제할 수 있도록 설정을 조정할 필요가 있다는 메시지를 전달합니다.\n\n**핵심 키워드**: Xcode, 빌드 속도, 연결 차단, 개인 정보 보호, 개발자 데이터 수집.","comments":"빌드 시점에 \"Gather provisioning inputs\" 단계에서 애플 서버에 연결하는 동작이 너무 오래걸린다고 지적합니다. 집에 전화해서 도대체 무엇을 기록하는걸까요 ㅎㅎ","keywords":["DeveloperTools","영어"],"location":"https:\/\/lapcatsoftware.com\/articles\/2025\/2\/5.html","title":"Xcode constantly phones home"},{"location":"https:\/\/medium.com\/@batrakov.vitaly\/async-let-vs-task-group-5cd391d68f71","summary":"","comments":"구조화된 동시성 처리 방식에는 다양한 방식이 있습니다. `async let` 처럼 자식 태스크를 병렬로 만들수도 있고, `TaskGroup`으로 여러 태스크를 묶을 수도 있습니다. 그럼 어떻게 동작하는지 살펴보시죠","keywords":["Swift"],"title":"async let vs Task group | by Vitaly Batrakov "},{"comments":"Xcode Cloud 처리를 도와주는 CLI 명령입니다","summary":"","keywords":["OpenSources"],"title":"finnvoor\/xcc: A CLI for Xcode Cloud","location":"https:\/\/github.com\/finnvoor\/xcc"},{"comments":"새로운 iOS 18.4 베타가 운영중입니다. 한국에서 에어 태그를 비롯한 위치 서비스를 지원하고, 애플 인텔리전스 한국어도 지원되는 버전입니다만 또 여러 기능이 추가됩니다","location":"https:\/\/medium.com\/macoclock\/ios-18-4-is-way-bigger-than-weve-expected-25-amazing-features-f19cd6f02ae4","title":"iOS 18.4 Is Way Bigger Than We’ve Expected — 25+ Amazing Features! | by Nikhil Vemu ","keywords":["Culture"],"summary":""},{"location":"https:\/\/telemetrydeck.com\/survey\/apple\/iOS\/majorSystemVersions\/","keywords":["DeveloperTools","영어"],"title":"iOS Versions Market Share in 2025 | TelemetryDeck","comments":"일주일 단위로 iOS 버전별 시장 점유율을 정리한 글과 데이터입니다. 2025년이 되면서 iOS 18 버전이 더 늘어나지는 않고 유지되는 것을 알 수 있네요","summary":""},{"summary":"","title":"iPhone 16e review: The most expensive cheap iPhone yet - Ars Technica","location":"https:\/\/arstechnica.com\/gadgets\/2025\/03\/iphone-16e-review-the-most-expensive-cheap-iphone-yet\/","comments":"다들 그러더군요. 이렇게 비싼 저가형 아이폰 모델은 없다고 말이죠. A18을 다같이 사용하면서 iPhone 16 패밀리와 성능차이가 별로 없으면서도 차별화를 만드는 전략이 잘 먹힐지 지켜봐야 할 것 같습니다","keywords":["Hardware"]},{"comments":"스위프트UI 화면에서 터치한 곳을 시각적으로 보여주는 라이브러리입니다. 필요한 경우가 있겠죠","summary":"","title":"robb\/visualizeTouches: Touch Visualization in SwiftUI","keywords":["OpenSources"],"location":"https:\/\/github.com\/robb\/visualizeTouches"},{"comments":"애플이 게임 포팅 툴킷을 제공하면서 기대했던 것처럼 콘솔 게임으로만 출시하는 고사양 게임을 맥과 아이패드를 지원하기 시작했습니다. 어쌔신 크리드 즐길 준비 되셨나요? 앞으로도 좀 다양해지면 좋겠네요","summary":"","title":"어쌔신 크리드 섀도우스를 Mac에서 즐길 수 있습니다 - 둘러보기 - Apple Developer","keywords":["APPLE"],"location":"https:\/\/developer.apple.com\/kr\/news\/?id=q2zte70j"}],"releaseAt":761929200}