{"sequence":113,"items":[{"comments":"iOS 18에서 아이폰 사진 앱이 좋은 이유를 소개합니다. 자연어로 사진을 찾을 수 있다는 게 가장 인상적인 것 같구요 나머지는 여러 사진과 복합한 화면을 어떻게 구성할꺼냐에 문제인 것 같네요","keywords":["Culture"],"location":"https:\/\/medium.com\/macoclock\/5-massive-new-photos-app-features-in-ios-18-b4c1ba1ea1ed","title":"5 Massive New Photos App Features in iOS 18 | by The Useful Tech ","summary":""},{"summary":"","title":"6 tools for running Windows games on macOS | by Chris Chinchilla ","location":"https:\/\/medium.com\/macoclock\/6-tools-for-running-windows-linux-on-macos-4b4aac6d046b","comments":"윈도우 기반 게임을 맥에서 하려고 시도해보셨나요? 한동안 PC게임을 포기하고 지냈더니 맥용이 있으면 좋다. 싶지만요 이제 이것저것 해볼 수 있는 방법이 많아지고 있네요","keywords":["Culture"]},{"title":"Accelerating Hugging Face Pre-trained Models on Apple Silicon Using MLX-LM and MPS | by Wei-Meng Lee ","comments":"애플 실리콘에서 MLX 기반으로 허깅 페이스 모델들을 실행하기 좋은데요. 앞으로는 맥 뿐만 아니라 iOS 에서도 쉽게 접근할 수 있을 것 같습니다. 차츰 MLX를 공부해야 하는 시점이 올 것 같습니다","summary":"","keywords":["AI\/ML"],"location":"https:\/\/ai.gopubby.com\/accelerating-hugging-face-pre-trained-models-on-apple-silicon-using-mlx-lm-and-mps-eb7465e4f502"},{"summary":"","title":"Adiós Things3 and all Todo Managers | by AI Rabbit ","keywords":["Culture"],"comments":"Things가 GTD 방식으로 일하는 데 한동안 최선의 방식이었는데요. 이제 다른 것을 원하는 분들이 많아지고 있나봅니다. 투두리스트로 모든 것을 다 관리해야 하느냐 생각도 드네요","location":"https:\/\/medium.com\/@jacktheflipper\/adi%25C3%25B3s-things3-todo-manager-4018f6753655"},{"title":"App development on iPad | MutatingFunc","summary":"","location":"https:\/\/mutatingfunc.github.io\/blog\/2024-10-12-app-development-on-ipad\/?","keywords":["DeveloperTools"],"comments":"아이패드에서 Xcode로 개발하고 싶어하는 개발자들이 있고 스위프트 플레이그라운드에서도 개발해서 앱 스토어 커넥트까지 앱을 올릴 수 있습니다. 물론 디버깅 기능이 좀 불편하고 여러 타겟이나 개발 환경 설정이 좀 제한적입니다. "},{"summary":"","keywords":["Culture"],"title":"Apple Notes Became Apple Notes Pro Max in macOS Sequoia | by The Useful Tech ","location":"https:\/\/medium.com\/macoclock\/apple-notes-became-apple-notes-pro-max-in-macos-sequoia-57e975a2dfe1","comments":"macOS 세콰이아에서는 애플 노트 앱이 더 강력해졌다는 소개글입니다. 음성 받아쓰기, 수학 계산, 하일라이트 표시, 일부 영역 접기 등 새로운 기능을 소개합니다"},{"keywords":["Hardware","영어"],"location":"https:\/\/medium.com\/@techhara\/apple-silicon-mac-has-a-serious-issue-9f69eef7dea1","comments":"애플 실리콘 장비에 USB-C 방식으로 외부 모니터를 연결하는 경우에 깜빡거리는 현상이 심하다는 얘기입니다. 많이들 쓰는 벤큐나 델 모니터에서 발생하다보니 더 그런 것 같네요. 저는 LG 모니터라서 그런가 잘 느끼지 못하고 있긴 합니다","title":"Apple Silicon Mac has a serious issue | by TechHara ","summary":""},{"summary":"Apple의 AI 연구진은 최근 대형 언어 모델(LLM)에 대한 논문을 발표하며, 이러한 모델들이 실제로는 제대로 된 추론을 하지 못한다는 주장을 펼쳤습니다. 이 논문은 LLM의 추론 능력이 '기억'에 의존한다는 점을 지적하며, 이는 AI 기술의 현재 상태에 대한 회의론을 심화시키고 있습니다. 이로 인해 수십억 달러를 투자한 기술 기업들과 AI 연구소들의 미래가 불확실해질 수 있습니다. 연구는 LLM이 복잡한 문제나 새로운 조건에 직면했을 때 성능이 급격히 저하된다는 것을 밝혔습니다. Apple 연구진은 LLM이 진정한 추론이 아닌, 훈련 중 접한 패턴을 기억하는 것으로 나타났습니다. 이러한 결과는 LLM이 기존 패턴을 단순히 모방하고 있다는 점에서 '지능적'이라고 볼 수 없다는 결론을 뒷받침합니다. LLM의 성능 저하, 특히 복잡성이 높아질수록 그 성능이 더욱 떨어지는 점, 그리고 사소한 정보 변화에도 쉽게 혼란스러워지는 점 등이 문제로 지적되고 있습니다. 이 연구는 거대 언어 모델의 추론 능력에 대한 과대평가를 교정할 필요성을 강조하며, AI의 사고 능력을 평가할 때 단순히 출력 결과만이 아닌 실제 추론 과정을 들여다봐야 한다고 주장하고 있습니다. 끝으로, AI의 발전이 기술적 확장에 따른 현혹인지, 실제로 진화된 인공지능을 만들 수 있는지에 대한 회의론이 제기되고 있습니다.\n\n핵심 키워드: Apple, 대형 언어 모델(LLM), 추론 능력, 기억 의존, 연구 결과.","keywords":["AI\/ML","영어","pick"],"title":"Apple Speaks the Truth About AI. It’s Not Good. | Medium","comments":"애플 인공지능 연구 논문에서 LLM 대형 모델이 추론 능력에 대해 한정된 기억에 의존하다보니 현재 상태에서 복잡할 수록 혼란스러워 추론이 안되는 단점을 지적합니다","location":"https:\/\/medium.com\/@ignacio.de.gregorio.noblejas\/apple-speaks-the-truth-about-ai-its-not-good-8f72621cb82d"},{"location":"https:\/\/medium.com\/macoclock\/apple-is-expensive-5e60ba358602","keywords":["Culture"],"comments":"애플 제품은 절대 저렴하지는 않습니다. 초기 투자 비용은 높아보지지만 안정성과 생산성 측면에서 애플 제품끼리 연동성도 뛰어나기 때문에 애플 생태계 내에서 효율적이라는 이야기를 합니다","summary":"이 글은 애플 제품의 가치에 대해 설명합니다. 저자는 스티브 잡스의 팬으로 그의 철학이 애플 브랜드에 어떻게 반영되어 있는지를 강조합니다. 스티브 잡스는 애플 기기들이 개인의 자연스러운 연장선이며, 별도의 설명서 없이도 간단히 사용할 수 있어야 한다고 믿었습니다. 애플은 이 두 가지 원칙을 지키면서 세계에서 가장 존경받는 브랜드가 되었습니다.\n\n애플은 프라이버시와 보안, 하드웨어 및 소프트웨어 품질, 성능과 배터리 수명, 일관성을 통해 독보적인 위치를 차지하고 있습니다. 애플의 프라이버시는 철통같아서 사용자의 데이터에 대한 접근을 철저히 막고 있으며, 기기의 재질과 소프트웨어의 질이 높습니다. 애플 실리콘 칩은 뛰어난 성능과 효율성을 제공하며, 애플 제품은 오랜 시간 동안 꾸준한 업데이트를 받아 사용자에게 높은 가치를 제공합니다.\n\n초기 비용이 높아 보일 수 있지만, 애플 제품은 안정성과 생산성을 제공하며 제품 간의 연동성이 뛰어납니다. 기사에서는 저자가 다른 브랜드의 제품을 사용하면서 겪은 문제를 예로 들며, 애플 제품의 가치와 그로 인해 얻게 되는 시간 절약 및 삶의 효율성을 강조하였습니다.\n\n키워드: 애플, 스티브 잡스, 보안, 품질, 가치.","title":"Apple is Expensive?. Is it value for money? | by Manav Tyagi "},{"title":"Apple, Apple Intelligence를 위해 탄생한 강력한 성능의 신규 iPad mini 공개 - Apple (KR)","keywords":["APPLE"],"location":"https:\/\/www.apple.com\/kr\/newsroom\/2024\/10\/apple-introduces-powerful-new-ipad-mini-built-for-apple-intelligence\/","comments":"신형 아이패드 미니가 등장했습니다. 아직 국내 판매 일정은 미지수지만 개인적으로 아이들 때문에 기다리던 제품이 나왔네요. 그나저나 환율 어쩌죠 ㅜㅜ","summary":""},{"comments":"","keywords":["SwiftUI"],"title":"Applying visual effects combined with scrolling in SwiftUI","location":"https:\/\/www.createwithswift.com\/applying-visual-effects-combined-with-scrolling-in-swiftui\/?","summary":""},{"comments":"macOS 설정 중에 생산성을 높여주는 소소한 팁입니다. 이제 기능이 너무 많고 켜고 끄는 옵션도 많아서 찾기 어려워지는 것 같습니다. 기본 설정말고도 세밀한 설정이 필요한 것 같습니다","keywords":["Culture"],"location":"https:\/\/medium.com\/macoclock\/change-these-5-macos-sequoia-settings-to-supercharge-your-workflow-1cf834b36d91","title":"Change These 5 macOS Sequoia Settings To Supercharge Your Workflow | by The Useful Tech ","summary":""},{"location":"https:\/\/blog.protein.tech\/combine-or-async-await-why-not-both-015826cfb63c","summary":"","keywords":["Swift"],"title":"Combine or Async\/Await? Why not Both? | wereprotein","comments":"Combine과 async\/await 방식을 섞어서 쓰는 방식을 설명합니다. 그렇지만 스위프트 6시대를 앞두고 Copyable 과 Sendable 을 고려해볼 때 이게 과연 좋은가 생각해보게 되네요"},{"location":"https:\/\/useyourloaf.com\/blog\/conditional-swiftui-accessibility-labels\/?","comments":"상태나 조건에 따라 표시하는 명칭도 달라지고, 접근성으로 명시해야 하는 부분도 달라질 수 있습니다. 조건부로 동작하는 방식을 제안합니다. 그렇지만 이걸 뷰에서 하기보다 따로 분리하는 것도 생각해보면 좋겠습니다","keywords":["Accessibility","영어"],"title":"Conditional SwiftUI Accessibility Labels","summary":""},{"title":"Create a Stunning Animated Background in SwiftUI with Metal | by alucchini ","keywords":["SwiftUI"],"comments":"","summary":"","location":"https:\/\/medium.com\/@ant.lucchini\/create-a-stunning-animated-background-in-swiftui-with-metal-32164bda67d9"},{"keywords":["SwiftUI"],"summary":"","title":"Custom Navigation Bar in SwiftUI | by Alessandro Manilii ","comments":"뷰컨트롤러가 없는 상태에서 내비게이션 바를 다루려면 단지 뷰를 보여주는 것 이상으로 내비게이션 스택이나 화면 이동을 고려해서 처리해야 해야 하는데 그 과정을 설명합니다","location":"https:\/\/medium.com\/@alessandromanilii\/custom-navigation-bar-in-swiftui-f8a9ef0ac168"},{"keywords":["Framework","영어","pick"],"summary":"","title":"Faster iOS Networking with Shared Dictionary Compression | Michael Eisel","location":"https:\/\/eisel.me\/shared-dictionary-compression?","comments":"네트워크 요청과 응답에서 JSON 방식을 사용하는 게 당연한 것처럼 느껴지는 요즘입니다. 여전히 네트워크 데이터를 줄이는 것이 사용자와 인프라 측면에서 모두 도움이 됩니다. "},{"location":"https:\/\/tidbits.com\/2024\/09\/23\/how-to-avoid-sequoias-repetitive-screen-recording-permissions-prompts\/?","summary":"TidBITS는 최근 macOS 15 \"Sequoia\" 업데이트에서 발생하는 스크린 녹화 권한 요청 문제에 대해 다루었습니다. macOS 15가 지나치게 자주 권한 요청을 발생시켜 사용자 경험을 저해한다고 설명하며, 이는 사용자를 피로하게 하고, 보안 경각심을 저하시킬 수 있다고 지적했습니다. 또한, 사용자가 이를 회피하도록 유도할 수 있어 진정으로 필요한 보안 요청을 놓치게 할 가능성이 있다고 경고합니다.\n\n기존 macOS 15.0의 문제는 사용자가 앱의 스크린 녹화 권한을 부여할 때 매 달마다 새로운 권한 요청을 표시하게 하는 것입니다. 이러한 반복적인 요청은 자칫 사용자가 무의미하게 느껴질 수 있으며, 시스템에 대한 신뢰를 떨어뜨릴 수 있습니다. 더 나아가, 일부 버튼의 혼란스러운 표시와 Apple의 스타일 가이드 위반 등도 문제로 거론되었습니다.\n\n이 문제를 해결하기 위한 임시 방안으로, 시스템 날짜를 미래로 설정하여 권한 요청을 앞당겨 처리한 후, 다시 현재 시간으로 설정하는 방법이 제안되었습니다. 그러나 이 방법은 달력 알림 등의 예상치 못한 부작용을 초래할 수 있습니다. 또한, Amnesia라는 앱으로 이러한 과정을 더 쉽게 처리할 수 있다는 점이 언급되면서, Apple의 요구 사항이 지나치다는 비판이 제기되었습니다.\n\nTidBITS는 Apple이 이러한 문제를 해결하여 사용자 경험을 개선할 것을 기대하며, 사용자들이 Apple의 피드백 페이지 등을 통해 의견을 제출할 것을 권장합니다.\n\n**핵심 키워드**:\n1. macOS 15 Sequoia\n2. 스크린 녹화 권한 요청 문제\n3. 사용자 경험 저해\n4. Amnesia 앱\n5. Apple 피드백","keywords":["Culture","영어"],"title":"How to Avoid Sequoia’s Repetitive Screen Recording Permissions Prompts - TidBITS","comments":"macOS 세콰이어에서는 앱에서 사용하는 권한 요청을 매달 다시 물어보는 것이 번거롭고 귀찮게 만든다고 지적합니다. 일시적으로 날짜를 미래로 바꿨다가 설정하고 다시 되돌리는 방식으로 우회하는 것을 도와줍니다"},{"summary":"","location":"https:\/\/medium.com\/parable-engineering\/how-to-easily-create-zip-files-in-swift-without-third-party-dependencies-a1c36a451ea1","keywords":["Framework"],"title":"How to easily create ZIP files in Swift without third-party dependencies | by Oleg Dreyman ","comments":"외부 라이브러리 없이 ZIP 압축 파일을 생성하는 방식을 소개하고 예제 코드를 보여줍니다"},{"location":"https:\/\/dimillian.medium.com\/how-to-use-cursor-for-ios-development-54b912c23941","title":"How to use Cursor for iOS development | by Thomas Ricouard ","comments":"iOS 앱 개발을 Cursor 개발 환경에서 진행하는 방식을 설명합니다. 저도 안써봤는데 VSCode 에서 다루던 코파일럿 챗 방식과 비슷한 것 같습니다 ","keywords":["SwiftUI","AI\/ML","OpenSources"],"summary":""},{"comments":"하루 혹은 한 달 개발 과정에서 빌드 시간이 차지하는 크기는 얼마나 될까요. 빌드 시간을 줄이면 그만큼 더 집중하고 해결할 수 있는 부분이 많아질까요. 빌드 시간을 2배 단축하기 위해서 했던 노력들을 정리한 글입니다","title":"How we reduced the build time by 2 with(out) Xcode at Shopmium. Part 1 | by Christopher Saez ","location":"https:\/\/medium.com\/@SaezChristopher\/%25EF%25B8%258F-how-we-reduced-the-build-time-by-2-with-out-xcode-at-shopmium-part-1-f66f6ec51b05","summary":"","keywords":["DeveloperTools"]},{"summary":"","comments":"생각해 볼만한 이야기네요. macOS도 iOS도 이제는 너무 거대해지고 전부다 사용하지도 않는 기능들이 계속해서 추가되고 있죠. 아마 최근에 실행하지도 않았지만 기본 탑재된 앱들도 많을 겁니다. 모두가 모든 앱이 필요하지 않다면 무엇을 선택할 수 있을까요","location":"https:\/\/chris-langley.medium.com\/macos-is-bloated-f2a81b130a29","keywords":["Culture"],"title":"MacOS is bloated | by Chris Langley "},{"summary":"","keywords":["Swift"],"title":"Making Environment Variables Easier in Swift | by Weslley Campos ","location":"https:\/\/weslleycampos.medium.com\/making-environment-variables-easier-in-swift-08c90739c5e4","comments":"SwiftUI 에서 사용하는 Environment 아니구요. 프로세스 실행할 때 전달되는 환경 변수 자체를 의미합니다. 실행할 때 넘겨줄 수도 있고, 터미널에 변수를 지정할 수도 있죠. 스위프트로 환경 변수를 읽어서 처리하는 방법도 포함합니다"},{"comments":"","keywords":["SwiftUI"],"title":"Making charts accessible with Swift Charts","location":"https:\/\/www.createwithswift.com\/making-charts-accessible-with-swift-charts\/?","summary":""},{"title":"Migrating Combine to AsyncAlgorithms - by Jacob Bartlett","summary":"","location":"https:\/\/blog.jacobstechtavern.com\/p\/migrating-combine-to-asyncalgorithms?","comments":"Combine 방식에서 AsyncAlgorithms 패키지로 넘어가서 마이그레이션하는 방식을 설명합니다. AsyncStream<>이나 AsyncSequence에서 Combine 연산자와 비슷하게 처리할 수 있습니다","keywords":["Swift","pick"]},{"keywords":["Framework"],"title":"Networking Async\/Await in SwiftUI | by Rishabh Sharma ","location":"https:\/\/medium.com\/@rishixcode\/networking-async-await-in-swiftui-e3bdc9a92cfb","summary":"","comments":"SwiftUI 에서 호출해서 처리하기 위한 async\/await 방식으로 구현한 네트워크 처리 라이브러리라고 합니다. 개인적으로는 의존성도 높고 응집도도 높고 모든 화면에서 요청하는 모든 요구사항을 구현한 방식이 마음에 들지 않습니다. 나쁜 사례라도 살펴보면 좋을 것 같습니다"},{"title":"Reducing SwiftUI Memory Usage in Large Applications | by Wesley Matlock ","comments":"SwiftUI에서 뷰를 그리러면 여러 종류의 상태 관리 방식을 선택할 수 있고, 메모리 소유권도 조금씩 다릅니다. 각 방식에 차이를 살펴보고 메모리 관리 측면에서 효율성을 높이는 방식을 설명합니다. ","keywords":["SwiftUI"],"location":"https:\/\/medium.com\/@wesleymatlock\/reducing-swiftui-memory-usage-in-large-applications-71ed7ff1ac64","summary":""},{"summary":"","keywords":["Framework"],"title":"Reinventing Core Data Development with SwiftData Principles | Fatbobman","location":"https:\/\/fatbobman.com\/en\/posts\/reinventing-core-data-development-with-swiftdata-principles\/?","comments":"이 분 블로그 오랜만인데 좀 독특합니다. SwiftData 처리 방식을 Core Data로 처리하려는 실험적인 코드를 보여줍니다. 성능과 안정성까지 높이려고 했던 노력이 신기했습니다. "},{"location":"https:\/\/www.avanderlee.com\/swift\/security-scoped-bookmarks-for-url-access\/?","comments":"URL 접근에 대해 암호화된 권한을 북마크로 남겨놓는 방식을 사용해서 특정 디렉토리나 앱에 권한을 관리하는 방식 `Security-scoped bookmark`에 대한 글입니다. 세콰이어 15.0 에서 에이전트가 버그가 있어서 키체인이 잠기는 문제가 있었다고 합니다","title":"Security-scoped bookmarks for URL access - SwiftLee","keywords":["Swift","영어"],"summary":"\"보안 범위 북마크\"의 개념과 그 사용법에 대해 설명합니다. 보안 범위 북마크란 사용자가 선택한 URL에 대한 접근 권한을 저장하는 데이터 객체로, macOS에서 주로 사용됩니다. 사용자가 선택한 디렉토리에 대한 접근을 복원할 수 있게 도와줍니다. 이러한 기술은 샌드박스 환경에서의 작업에 큰 가치를 줍니다.\nmacOS Sequoia에서 \"ScopedBookmarksAgent\"와 연관된 큰 버그가 발생했습니다. 이 버그는 macOS 15.1에서 수정되었고, 해당 문제는 \"ScopedBookmarksAgent\"가 키체인이 잠긴 채 실행될 때 발생할 수 있는 문제입니다. 많은 앱들이 이 문제로 정상 작동을 하지 못하며, 사용자에게 명시적인 권한 요청을 재차 요구해야 했습니다. 필자는 이 문제를 피하기 위해 북마크 데이터를 세션 당 메모리에 저장하는 방식으로 해결했고, 이는 앱이 완전히 작동하지 않게 되는 것보다는 나은 해결책입니다. \n보안 범위 북마크는 사용자 선택 목적지에 대한 권한 저장의 업계 표준입니다.\n\n키워드: 보안 범위 북마크, macOS Sequoia 버그, Swift, Xcode, RocketSim."},{"location":"https:\/\/github.com\/wojciech-kulik\/xcodebuild.nvim\/issues\/201?","comments":"xcodebuild 명령에서 애플 개발 서비스 API 주소를 호출하는 동작이 주기적으로 호출하는 문제에 대한 설명입니다. 이건 좀 끌 수 있어야 할 것 같은데요","summary":"","keywords":["DeveloperTools"],"title":"Slow incremental builds using `xcodebuild` · Issue #201 · wojciech-kulik\/xcodebuild.nvim"},{"location":"https:\/\/medium.com\/@wesleymatlock\/optimizing-swiftui-reducing-body-recalculation-and-minimizing-state-updates-8f7944253725","title":"State Updates | by Wesley Matlock ","summary":"SwiftUI의 최적화를 다루며 성능 향상을 위한 방법을 설명합니다. SwiftUI는 선언적 패러다임을 채택하여 UI 개발을 간단하게 하지만, 성능 최적화와 관련한 새로운 도전을 제시합니다. 본문에서는 불필요한 body 재계산을 줄이고 @State 업데이트를 최소화하는 전략을 중점적으로 다룹니다.\n\nSwiftUI의 렌더링 메커니즘을 이해하기 위해서는 각 뷰의 상태 변화가 어떻게 처리되는지를 아는 것이 중요합니다. 성능 최적화를 위해, 뷰 구조 내 변수를 불변하도록 유지하고, 변동이 필요한 경우에만 @State, @ObservedObject 등을 활용합니다.\n\nbody 프로퍼티 내부의 무거운 계산은 피하며, 필요한 계산은 body 외부에서 수행하여 불필요한 재계산을 방지합니다. 또한 LazyVStack을 사용하여 자원을 절약하고 대규모 데이터셋에 효율적인 성능을 제공합니다. 뷰의 고유 식별자를 제공하여 업데이트 효율성을 높이고, @State는 UI에만 관련된 속성에 사용합니다.\n\n@Binding을 통해 두 방향 데이터 흐름을 관리하며, 고빈도 업데이트는 디바운스를 사용해 줄입니다. 예제 앱에서는 이 최적화 기법을 통해 효율적인 카운터 앱을 구현하고, EquatableView 등의 고급 기법을 활용하여 성능을 향상시킵니다.\n\nSwiftUI에서의 성능 최적화는 부드럽고 반응성 있는 사용자 경험을 제공하기 위한 중요한 요소이며, 적절한 상태 관리 및 뷰 구성으로 이를 달성할 수 있습니다.\n\n키워드: SwiftUI, 성능 최적화, @State 최소화, 뷰 구조체 불변성, LazyVStack 사용","keywords":["SwiftUI"],"comments":"뷰 내부에 UI 렌더링과 관련된 데이터와 아닌 것으로 구분하고 상태값이 양방향인지 소유권을 가진 경우인지 구분해서 반응성과 성능을 높이는 방식에 대해 설명합니다."},{"location":"https:\/\/medium.com\/macoclock\/stop-using-iphone-cases-theyre-ruining-your-experience-f2cce3336e3d","comments":"아이폰 케이스를 벗고 쓰라.라는 도전적인 글입니다. 우리는 고장나거나 깨질 것이 두려워서 케이스를 쓰는 거겠죠. 그렇지만 적어도 벗고 쓰는게 어떤 점에서 좋은지 설명합니다. ","summary":"","keywords":["Hardware"],"title":"Stop Using iPhone Cases — They’re Ruining Your Experience! | by Manav Tyagi "},{"title":"SwiftUI: Static Widgets with WidgetKit | by Itsuki ","summary":"","keywords":["SwiftUI"],"location":"https:\/\/levelup.gitconnected.com\/swiftui-static-widgets-with-widgetkit-b8b4a4960457","comments":"위젯킷을 사용해서 (라이브 위젯이 아니라) 정적 위젯을 만드는 예제입니다. watchKit을 한동안 사용 안하다가 최근에 살펴보니 모두 WidgetKit으로 개발해야 하더군요. 결국 워치는 위젯이었나요"},{"comments":"","keywords":["SwiftUI"],"location":"https:\/\/levelup.gitconnected.com\/swiftui-styling-tables-63a9d2c76869","summary":"","title":"SwiftUI: Styling Tables. What we can change and what we cannot! | by Itsuki "},{"keywords":["Swift"],"location":"https:\/\/medium.com\/@noahlittle199\/swifts-isolated-keyword-a-small-trick-to-simplify-code-in-actors-570ff692f8e2","comments":"액터가 분리된 상태 값을 처리하는 함수를 만들기 위한 과정을 설명합니다. 설명이나 정리가 잘 된 글은 아니고 흐름을 살펴보는 정도로 보는 정도로 보시길 추천드립니다","title":"Swift’s isolated keyword: A small trick to simplify code in actors | by Noah Little ","summary":""},{"location":"https:\/\/www.fline.dev\/test-your-swift-packages-linux-compatibility-on-mac\/?","summary":"","comments":"맥에서 리눅스 호환 명령들을 직접 테스트하기 위해서 도커 컨테이너 내부 명령을 연결하는 방법을 제안합니다","keywords":["DeveloperTools","VisionOS","Framework"],"title":"Test your Swift Packages Linux Compatibility on Mac"},{"title":"The iMac Has One Small Problem — Its Display | by Michael Swengel ","keywords":["Hardware"],"location":"https:\/\/medium.com\/@michaelswengel\/the-imac-has-one-small-problem-its-display-f0baac4377b0","comments":"아이맥이 24인치만 나오고 더 큰 맥이 없다는 것에 대해 언급합니다","summary":""},{"location":"https:\/\/tomdeneire.medium.com\/the-perfect-color-scheme-for-your-terminal-environment-2515d6d748c0","comments":"터미널 환경을 위해서 완벽한 색상 조합이 있을까요. 어떤 조합을 쓰고 계신가요","summary":"","title":"The perfect color scheme for your terminal environment | by Tom Deneire ","keywords":["DeveloperTools","영어"]},{"keywords":["Testing"],"title":"Using Swift Package Manager to Structure Test-Only Code in Swift | by Steven Curtis ","location":"https:\/\/stevenpcurtis.medium.com\/using-swift-package-manager-to-structure-test-only-code-in-swift-7bc4999d31a8","comments":"패키지 매니저로 패키지를 나누고 테스트 전용 코드를 별도 타겟으로 분리하는 방식은 구조적으로도 좋은 방식일 수 있습니다. 그 과정을 설명해주는 글입니다","summary":""},{"summary":"","keywords":["Testing","ServerSide"],"comments":"데이터베이스와 인-메모리 모두 하나 인터페이스로 병렬적으로 테스트하기 위한 방식을 설명합니다. ","title":"Vapor and Swift Testing: Running tests in parallel - SwiftLee","location":"https:\/\/www.avanderlee.com\/general\/vapor-and-swift-testing-running-tests-in-parallel\/?"},{"location":"https:\/\/medium.com\/@erezhod\/understanding-viewbuilder-in-swiftui-dynamic-and-static-view-construction-in-custom-views-d99398e58cb5","title":"ViewBuilder in SwiftUI: Dynamic and Static View Construction in Custom Views | by Erez Hod ","comments":"커스텀 뷰를 생성하기 위한 뷰 빌더 동작을 동적으로 구현하거나 정적으로 구현하는 방식을 비교해서 설명합니다. 업데이트 빈도나 구현 방식에 대해 고민해볼 필요가 있겠네요","summary":"","keywords":["SwiftUI"]},{"keywords":["Culture","영어"],"comments":"기계어를 만드는 AOT 컴파일러가 어떻게 가상머신이 있는 JIT 컴파일러를 이겼는지 설명하는 글입니다","title":"Why AOT beat JIT compilers | by Jan Kammerath ","location":"https:\/\/medium.com\/@jankammerath\/why-aot-beat-jit-compilers-740ae4e4ab20","summary":"AOT(앞서 컴파일)와 JIT(즉시 컴파일) 컴파일러의 성능에 대한 논의는 Rust, Go의 인기가 높아지고 C, C++의 중요성이 지속되면서 활발해지고 있습니다. AOT는 빌드 시 소스 코드를 기계어로 변환하여 실행 파일을 생성하며, 사용자가 별도의 런타임 환경이 필요 없습니다. 반면, JIT는 실행 시 ByteCode를 기계어로 변환하여 실행하며, 사용자는 .NET Framework나 JRE와 같은 런타임이 필요합니다.\n\nAOT 컴파일러는 순수 기계어로 변환되어 최상의 실행 성능을 제공하며, 종속성이 적어 더 작은 바이너리를 생성합니다. 이는 성능과 비용 측면에서 이점이 있어, 고성능이 요구되는 시스템에서 유리합니다. 특히, 머신러닝이나 AI와 같이 높은 연산 능력이 필요한 상황에서 AOT 컴파일러가 더 효과적입니다.\n\nJIT 컴파일러는 원활한 호환성을 유지해야 하며, 신뢰할 수 있는 런타임 환경이 요구됩니다. 이는 AOT처럼 지속적인 운영 체제와의 최적화가 필요하지 않지만, 종종 높은 메모리 용량을 요구하게 됩니다. 현대의 소프트웨어 세계에서는 AOT 컴파일러가 재조명받고 있으며, 이는 성능과 비용을 중시하는 환경에서 큰 장점으로 작용하고 있습니다.\n\n**핵심 키워드: AOT, JIT, 컴파일러 성능, 종속성, 기계어**"},{"title":"Why I Stopped Building for visionOS (And What Could Bring Me Back) | by Cihat Gündüz ","comments":"visionOS 제공하는 API가 한정적이고 부족해서 멈추게 된 내용들을 짚어줍니다. 일부는 visionOS 2.x 새 버전에서 지원하기도 하고 아직은 표준도 없는 것도 있습니다. 공간을 다루는 기술과 API가 더 발전해야 하는 부분도 크겠네요","location":"https:\/\/jeehut.medium.com\/why-i-stopped-building-for-visionos-and-what-could-bring-me-back-e86fe26e3631","summary":"애플이 Vision Pro를 처음 발표했을 때, 저는 엄청난 기대를 가졌습니다. 그러나 visionOS를 사용하며 앱을 개발하면서 일부 제약으로 인해 완벽한 혼합 현실 플랫폼이 되지 못함을 발견했습니다. 핵심 문제는 여러 핵심 API가 부족하다는 것입니다. 이러한 API가 구현되면 Vision Pro는 진정한 AR\/VR 경험을 제공하는 플랫폼으로 탈바꿈할 수 있을 것입니다.\n\n1. **표면에 창과 객체 고정 API**: 창이나 3D 객체를 방의 표면에 고정시켜 사용하는 기능이 필요합니다. 이러한 고정 객체는 시스템을 재시작해도 위치가 변하지 않아야 하며, 현재 비전 프로나 제공하는 경험에 충분히 부합할 수 있습니다.\n\n2. **고급 방 스캐닝 및 편집 가능한 3D 모델 API**: 방의 색상과 텍스처까지 포함하는 고해상도의 3D 모델을 만들 수 있는 API입니다. 이를 통해 개발자들에게 보다 상호작용이 가능한 공간을 만들어 낼 수 있는 도구를 제공합니다.\n\n3. **골격 인식 API**: 재미있는 AR 상호작용을 위해 신체의 움직임과 제스처를 인식할 수 있는 간단한 골격 추적 API가 필요합니다. 이는 사용자의 움직임을 기반으로 한 인터랙티브한 경험을 가능하게 합니다.\n\n4. **인터랙티브 공간 360°\/180° 비디오 요소**: 비디오 내에서 클릭 가능한 요소를 만들어 상호작용적인 영상 경험을 제공합니다. 이는 교육이나 이야기 전달에 크게 도움이 될 것입니다.\n\n5. **직관적인 지도를 위한 Apple Maps API**: 사용자가 실제 장소와 상호작용할 수 있는 3D 환경에 직접 배치하여 탐색하는 기능이 필요합니다.\n\n이러한 API의 발전과 도입 없이 Vision Pro가 시장에서 성공하기 어려울 것이라고 애기합니다. 개발자와 사용자가 실제로 Vision Pro의 잠재력을 발휘할 수 있도록 만들기 위해 애플이 더 많은 혁신을 보여주어야 한다는 결론입니다.\n\n**키포인트 키워드**: Vision Pro, API 제약, 혼합 현실, AR\/VR 개발, 인터랙티브 기능.","keywords":["VisionOS"]},{"summary":"","keywords":["DeveloperTools"],"location":"https:\/\/dimillian.medium.com\/why-you-should-use-xcode-16-buildable-folders-instead-of-groups-6f438611914d","comments":"","title":"Why you should use Xcode 16 buildable folders instead of groups | by Thomas Ricouard "},{"location":"https:\/\/swiftrocks.com\/working-at-startups-vs-large-companies?","comments":"iOS 개발자도 얼마나 큰 회사에서 조직에 속하느냐에 따라 일하는 경험이 다를 수 있겠죠. 스타트업과 중견기업, 대기업이 일하는 방식도 다르니까요. 각기 장단점을 이야기해보는 글입니다","keywords":["Culture","영어"],"title":"Working at startups vs large companies","summary":"이 글은 스타트업과 중견기업, 대기업에서의 근무 경험을 비교하며 각기 다른 장단점을 제시하고 있습니다. \n\n스타트업은 다양한 경험을 얻고 빠른 성장이 가능하지만 불안정성과 혼돈, 낮은 급여와 큰 기술적 도전이 부족하다는 단점이 있습니다. 스타트업은 특히 기업가 정신이 강한 사람에게 적합합니다. \n\n중견기업은 안정적인 생활과 좋은 급여, 적당한 기술 도전이 가능하지만, 성장 잠재력이 작고 다소의 관료주의가 존재합니다. 이들은 대기업의 방식을 모방하려다 자원이 부족한 문제가 생길 수도 있습니다. \n\n대기업은 높은 급여와 세계적 수준의 기술 도전 과제에 참여할 기회를 제공하지만, 지나친 정치와 엄청난 관료주의 때문에 성장이 어렵다는 문제점이 있습니다. 이러한 상황에서 각 기업의 문화적 적합성을 이해하여 본인에게 맞는 회사를 선택하는 것이 중요합니다.\n\n키포인트 키워드:\n1. 스타트업 경험\n2. 중견기업 장단점\n3. 대기업 관료주의\n4. 기업 문화 적합성\n5. 기술적 도전 및 성과"},{"title":"Xcode 16 now comes with swift-format out of the box | by King","summary":"","comments":"지난호에도 잠시 소개했는데 Xcode 16에는 swift-format 기능이 내장되었습니다. 이제 원할 때 포맷을 처리할 수 있게 도와줍니다","keywords":["DeveloperTools"],"location":"https:\/\/kingskode.medium.com\/xcode-16-now-comes-with-swift-format-out-of-the-box-5fb5e5c8c839"},{"summary":"","title":"Xcode 16: A New Era of Predictive Code Completion | by Arijit Mukherjee ","keywords":["DeveloperTools"],"location":"https:\/\/medium.com\/@ben.arijit\/xcode-16-a-new-era-of-predictive-code-completion-4e9c9686aa17","comments":"그렇습니다. 이제 Xcode 16에서는 스위프트 코드를 학습시켜서 예측 가능한 코드 완성 기능을 사용하면 생성형 AI 도움을 받는 셈이죠"},{"summary":"","keywords":["Hardware"],"title":"iPad mini 7 is FINALLY here! | by David Lewis ","comments":"아이패드 미니 7이 나왔습니다. 크기나 사용성을 보면 미니가 딱 좋은 것 같은데 말이죠. 아참 USB-C가 달렸습니다","location":"https:\/\/medium.com\/macoclock\/ipad-mini-7-is-finally-here-502b17f923ee"},{"title":"preconcurrency thing work? | massicotte.org","keywords":["Swift","영어","pick"],"comments":"액터 내에 함수가 명확하게 분리되지 않거나 sendable 하지 않아서 일치하지 않는 경우에 `@preconcurrency` 특성을 추가해서 컴파일 오류를 일시적으로 해결할 수 있다고 합니다. 하지만 이게 안전하게 동작한다는 것을 의미하지 않으니까 이전 버전을 옮기는 동안에만 써야할 것 같네요","location":"https:\/\/www.massicotte.org\/preconcurrency?","summary":""},{"keywords":["Hardware"],"location":"https:\/\/medium.com\/macoclock\/watchos-11-on-my-apple-watch-ultra-2-a-runners-unfiltered-take-on-the-latest-update-5a208cebe6d1","summary":"","comments":"애플 워치 울트라2 기능을 충분히 사용하기 위해서는 watchOS 11 버전이 필요한 걸까요. 울트라를 안써서 잘 모르겠습니다 ㅎㅎ ","title":"watchOS 11 On My Apple Watch Ultra 2: A Runner’s Unfiltered Take On The Latest Update | by Aditya Darekar "},{"comments":"테스트플라이트도 계속해서 업데이트가 되고 있네요. 초대시 앱 요약으로 스크린샷과 앱 카테고리를 보고 선택할 수 있도록 공개 링크 주소를 만들 수 있다고 하네요","location":"https:\/\/developer.apple.com\/kr\/news\/?id=fps422ld","title":"테스터 모집에 유용한 TestFlight 개선 사항 - 최신 뉴스 - Apple Developer","keywords":["APPLE"],"summary":""}],"version":"1.0","releaseAt":750438000}