{"version":"1.0","sequence":125,"releaseAt":766162800,"items":[{"summary":"","location":"https:\/\/medium.com\/coding-nexus\/5-open-source-mcp-servers-thatll-make-your-ai-agents-unstoppable-89498fcada16","keywords":["AI\/ML"],"comments":"요즘 MCP 서버 광풍이 몰아치고 있습니다. 거의 모든 도구들을 연결하도록 도와주도록 확장하고 있습니다. 애플 개발자 도구도 공식 지원하는 날이 올까요","title":"5 Open-Source MCP Servers That’ll Make Your AI Agents Unstoppable | by Code Pulse "},{"summary":"이 글에서는 아이폰 사용자들이 Doomscrolling 대신 사용할 수 있는 8개의 유용한 앱을 소개하고 있습니다. \n\n1. **Headway**: 비소설 서적의 핵심 아이디어를 요약해주는 앱으로, 쉽게 학습할 수 있게 도와줍니다. 장시간 소모적이지 않으며, 목표에 따라 맞춤형 서적 요약을 제공합니다.\n\n2. **Deepstash**: 책, 팟캐스트, 기사 등 여러 가지 읽고 싶었던 내용을 간단히 요약해서 제공하는 앱으로, 다양한 주제를 손쉽게 탐색할 수 있습니다.\n\n3. **Substack**: 흥미로운 뉴스레터를 구독하는 플랫폼으로, 관심 있는 주제에 대한 깊이 있는 글을 제공합니다. \n\n4. **Imprint**: 복잡한 아이디어를 시각적 슬라이드로 간단히 설명하여, 짧은 시간 안에 학습할 수 있게 돕는 앱입니다.\n\n5. **Voice Dream Reader**: 다양한 문서를 음성으로 읽어주는 앱으로, 통근 중 긴 문서를 손쉽게 소화할 수 있습니다.\n\n6. **Lumosity**: 기억력과 주의력을 향상시키는 짧은 게임을 제공하여, 즐겁게 뇌를 훈련할 수 있게 해주는 앱입니다.\n\n7. **Inshorts**: 주요 뉴스 내용을 60단어 이하로 요약하여 제공하며, 빠르게 정보를 얻고 싶을 때 유용합니다.\n\n8. **Web Roulette**: 좋아하는 웹사이트를 무작위로 탐색할 수 있게 돕는 앱으로, 사용자가 쉽게 재미를 느낄 수 있습니다.\n\n이 앱들을 활용하면 무의미한 시간을 줄이고 유용한 정보와 지식을 흡수할 수 있습니다.\n\n**주요 키워드**: 앱, 학습, 정보, 효율성, 대체","location":"https:\/\/medium.com\/macoclock\/8-apps-to-use-instead-of-doomscrolling-on-your-iphone-e62d8ed32616","keywords":["Culture"],"comments":"습관적으로 아이폰을 켜고 생각없이 계속해서 의미없는 소식들과 영상들을 보는 습관이 늘고 있지는 않나요. 의미있는 내용을 읽기 위한 노력을 도와주는 앱을 추천합니다","title":"8 Apps to Use Instead of Doomscrolling on Your iPhone | by The Useful Tech "},{"summary":"","location":"https:\/\/itnext.io\/advance-architectural-rules-in-swiftlint-just-kidding-80ac5e5a911d","keywords":["DeveloperTools"],"comments":"SwiftLint에 커스텀 규칙 만들어서 활용하고 계신가요? 아키텍처 구성 요소나 계층이나 맥락에 따라 다른 Lint 규칙을 적용하는 방식을 설명합니다","title":"Advanced architectural rules in SwiftLint — just kidding | by Eric Silverberg "},{"summary":"이 글에서는 주요 운영 체제인 Windows, MacOS, Linux, Chrome OS, Android 및 iOS에 대해 간략히 설명합니다.\n\n**Windows**는 1985년부터 사용자에게 신뢰받아온 운영 체제로, 거의 모든 PC에서 작동하며 호환성이 뛰어난 장점이 있습니다. 하지만 잦은 업데이트와 \"블루 스크린\" 문제 등 단점도 존재합니다.\n\n**MacOS**는 애플 제품 전용으로, 하드웨어와 소프트웨어의 최적화가 잘 되어 있습니다. 그러나 가격이 비싸고 게임 지원이 부족하다는 점에서 단점이 있습니다.\n\n**Linux**는 오픈소스이며 많은 배포판을 포함하고 있어 사용자 정의가 용이하지만, 기본 명령어 사용이 필요해 초보자에게는 어려울 수 있습니다.\n\n**Chrome OS**는 클라우드 기반으로 빠른 부팅이 장점이며, 주로 웹 브라우저를 사용하는 사용자에게 적합하지만 오프라인에서의 사용이 제한적입니다.\n\n**Android**는 다양한 제조사가 사용하는 유연한 모바일 운영 체제에 속하며, 사용자 맞춤화가 가능하지만 모든 기기가 소프트웨어 업데이트를 받지 않을 수 있습니다.\n\n**iOS**는 안정적이면서 직관적인 인터페이스로 잘 알려져 있지만, 높은 가격과 제한된 커스터마이징이 단점입니다.\n\n이러한 운영 체제는 각각의 필요와 라이프스타일에 따라 선택될 수 있습니다. 일반 사용자와 게이머는 Windows, 창작 활동을 하는 이들은 MacOS, 개발자들은 Linux, 그리고 학생이나 가벼운 사용자에게는 Chrome OS가 추천됩니다.\n\n**핵심 키워드:** 운영 체제, Windows, MacOS, Linux, Chrome OS","location":"https:\/\/medium.com\/@simpleandkind788\/all-major-operating-systems-explained-in-6-minutes-4635c7b5cfa3","keywords":["Culture","영어"],"comments":"핵심적인 운영체제들을 소개해주는 글입니다. 이제 이런 소개가 필요한 시대가 된걸까요 ㅎㅎ","title":"All Major Operating Systems Explained in 6 Minutes | by Zeeshan Saghir "},{"summary":"","location":"https:\/\/medium.com\/macoclock\/apples-leakers-just-went-nuclear-and-we-re-all-witnesses-to-the-greatest-ios-leak-in-history-7193d2911eb8","keywords":["Culture"],"comments":"iOS 19 유출 루머와 증거를 모아서 설명하는 글입니다. 이번 iOS 19 업데이트가 기대되네요. 아참 개발자들은 엄청 귀찮을 수 있음 주의요망입니다 ","title":"Apple’s Leakers Just Went Nuclear — And We’re All Witnesses to the Greatest iOS Leak in History | by Juan Cienfuegos "},{"summary":"","location":"https:\/\/medium.com\/@tushar.sharma0214\/building-decoupled-swift-packages-a-clean-architecture-approach-200e6d9fe5ec","keywords":["Architecture"],"comments":"앱 구조 - 아키텍처라는 것이 단지 타입에 대한 것이 아니고 파일 단위, 모듈 단위 그리고 패키지 단위에서도 의존성을 고민해야하죠. 스위프트 패키지의 의존성 관리 관점에서 이야기하는 글입니다","title":"Building Decoupled Swift Packages: A Clean Architecture Approach | by Tushar Sharma "},{"summary":"","location":"https:\/\/blog.stackademic.com\/clean-code-in-swiftui-312e1311fdd7","keywords":["SwiftUI"],"comments":"클린 코드에서 권장하는 많은 규칙들 중에서 SwiftUI 에 꼭 필요한 걸 추천한다는 느낌의 글이네요. 적어도 화면 단위로 역할을 분리하고 테스트 가능성을 높이는 것부터 시작이네요","title":"Clean Code in SwiftUI | by Jerry PM "},{"comments":"코틀린 코루틴과 스위프트 동시성을 서로 비교해주는 글입니다. 이렇게 하나씩 직접 비교해주는 글은 드문 것 같아서 소개합니다","location":"https:\/\/medium.com\/@sharmapraveen91\/concurrency-face-off-kotlin-vs-swift-what-every-mobile-dev-should-know-e5bca3dd2282","keywords":["Culture"],"title":"Concurrency Face-Off: Kotlin vs Swift — What Every Mobile Dev Should Know | by praveen sharma ","summary":""},{"comments":"iOS17에 추가된 `containerRelativeFrame()` 방식으로 다양한 화면 크기와 장치를 지원하도록 구현하는 방식에 대해 설명합니다","location":"https:\/\/www.createwithswift.com\/create-flexible-interfaces-in-swiftui\/?","keywords":["SwiftUI"],"title":"Create flexible interfaces in SwiftUI","summary":""},{"comments":"MCP 프로토콜 공식 Swift SDK 를 이용해서 MCP 서버를 구현하는 예제입니다. 클라이언트는 ChatGPT 랑 Claude 모두 지원하고 동작은 버전 하나 뿐이긴 하지만 구현 과정을 알아보기 너무 좋습니다","location":"https:\/\/www.artemnovichkov.com\/blog\/creating-mcp-servers-in-swift?","keywords":["AI\/ML","영어","pick"],"title":"Creating MCP Servers in Swift","summary":""},{"comments":"스위프트 6 버전부터 적용되는 엄격한 동시성 원칙에 맞춰서 의존성 주입을 구현하는 과정을 설명합니다. ","location":"https:\/\/medium.com\/@darrenthiores\/automatic-dependency-injection-di-in-swift-6-to-make-your-code-clean-4e0160c049ce","keywords":["Swift"],"title":"Dependency Injection (DI) in Swift 6 | Medium","summary":"이 글은 Swift 6에서의 자동 의존성 주입(Automatic Dependency Injection, DI) 구현에 관한 것이다. DI는 객체 지향 프로그래밍에서 객체가 다른 객체에 의존할 때, 그 의존성을 주입하는 디자인 패턴이다. 자동 DI는 이러한 과정을 자동화하여 개발자가 의존성을 수동으로 주입할 필요를 없애준다.\n\n이 구현에서는 카운터 앱을 예제로 하여, 의존성을 주입하는 방법을 설명한다. 먼저, 의존성 주입을 위한 도우미 클래스를 정의하고, Swift 6의 엄격한 동시성 원칙을 따라 코드를 작성한다. 의존성 객체를 등록하는 `DependenciesInjector` 클래스를 생성하고, 의존성을 주입하는 새로운 속성 래퍼인 `@Inject`와 `@Provider`를 정의한다. 그런 후, 카운터 모델을 프로토콜과 클래스의 형태로 구현하고, `AppModule` 구조체를 통해 의존성을 제공한다. 메인 뷰모델인 `MainViewModel`을 설정하여 UI에서 카운터 기능을 사용하고 결과를 출력한다.\n\n이러한 자동 의존성 주입 방식은 복잡한 코드베이스에서 의존성 관리에 도움을 주고, 코드의 가독성을 높여준다.\n\n**핵심 키워드**: 자동 의존성 주입, Swift 6, MVVM 아키텍처, 코드 가독성, 의존성 관리."},{"comments":"듀오링고 팀은 UX 사용자 경험이라는 용어 대신에 PX 제품 경험이라는 용어로 대신합니다. 제품을 중심으로 문제를 접근하고 개발한다는 의미가 어떤 의미일까요","location":"https:\/\/blog.prototypr.io\/duolingo-just-ended-the-term-ux-design-acc0dfeaec8d","keywords":["Design","영어"],"title":"Duolingo Just Ended The Term “UX Design” | by Punit Chawla ","summary":"듀오링고의 UX 책임자인 미그 레예스는 최근 링크드인에서 UX 디자인이라는 용어가 “PX 디자인”으로 변경될 것이라고 발표하여 주목을 받았다. PX 디자인이란 무엇일까? 듀오링고는 UX를 “제품 경험(Product Experience)”으로 바꾸겠다고 설명하며, 이는 자사의 제품 중심 접근 방식을 강조한 것이다. 이들은 UX라는 용어가 오래되고 자신의 정체성과 맞지 않다고 판단했다. 반응은 다양했으며, 일부는 이 변화를 혁신이라고 보았고 다른 일부는 마케팅 수단으로 간주했다.\n\n디자인 직무의 이름이 변하는 현상은 드문 일이 아니다. UX는 1993년 도널드 노먼에 의해 시작되었으며, 그 이후 다양한 변형이 있었다. 최근에는 “개발자 경험(Developer Experience)”과 “에이전트 경험(Agent Experience)” 같은 새로운 용어도 등장하고 있다. 이러한 변화는 디자이너가 기술 발전과 사용자 기대에 맞춰 진화해야 함을 의미하며, 특히 인공지능의 발전에 따라 PX와 AX 같은 용어가 그 의미를 더해갈 것으로 보인다. 디자이너는 앞으로 비즈니스와 제품 기능에 초점을 맞춘 기술을 발전시켜야 할 필요성을 느낄 것이다.\n\n결론적으로, 용어는 변할 수 있지만 UX\/UI 디자인의 기본 원칙은 여전히 중요하고, 새로운 아이디어와 프로세스를 개발하는 것은 그 어느 때보다 필요하다.\n\n핵심 키워드: 듀오링고, UX 디자인, PX 디자인, 제품 경험, 디자인 변화"},{"comments":"설명하는 코드가 파이썬 코드이긴 합니다만 요즘 로컬에서 ollama로 LLM 실행하고 활용하는 방식이라 추천합니다. ","location":"https:\/\/medium.com\/data-science-collective\/convert-pdfs-to-markdown-using-local-llms-c5232f3b50fc","keywords":["AI\/ML"],"title":"From PDF to Markdown with Local LLMs — Fast, Private, and Free | by Gwang-Jin ","summary":""},{"comments":"딥링크를 앱 내부에서 처리할 때 어떻게 구조적으로 나눠서 처리하시나요. 동시성 알고리즘을 활용하는 방식을 설명합니다. ","location":"https:\/\/levelup.gitconnected.com\/handle-deep-links-with-async-algorithms-83615f79b32f","keywords":["Framework","pick"],"title":"Handle Deep Links with Async Algorithms | by Jacob Bartlett ","summary":""},{"comments":"프롬프트로 SwiftUI 화면 프로토타입을 만들고 플러그인을 활용해서 피그마까지 만드는 과정을 설명합니다. ","location":"https:\/\/medium.com\/design-bootcamp\/how-i-created-ui-with-chatgpts-new-image-generator-4o-d52389a5833e","keywords":["AI\/ML"],"title":"How I created UI with ChatGPT’s new image generator (4o) | by Xinran Ma ","summary":""},{"comments":"가끔씩 어떤 앱을 분석하고 싶을 때가 있습니다. `.ipa` 파일을 받아서 내부를 분석하는 방법을 소개합니다","location":"https:\/\/www.artemnovichkov.com\/blog\/how-to-inspect-ipa-files?","keywords":["DeveloperTools","영어"],"title":"How to inspect .ipa files and secure your iOS app from common mistakes","summary":""},{"comments":"저는 애플 마우스는 포기하고 트랙패드 위주로 사용하는 데요. 맥에 적합한 마우스를 찾기 위해 노력한 사례를 공유하네요","location":"https:\/\/medium.com\/@simpleandkind788\/i-spent-1-year-to-find-the-best-mouse-for-mac-03625256519b","keywords":["Hardware"],"title":"I Spent 1 Year To Find The Best Mouse For Mac | by Zeeshan Saghir ","summary":""},{"comments":"SwiftUI 를 주로 사용해서 개발하고 있지만 여전히 특정 동작을 UIKit 구현이 더 쉬운 상황이 있죠. 항상 새로운 기술 - SwiftUI 가 좋은 것은 아니라는 것을 강조합니다","location":"https:\/\/collin.blog\/2025\/04\/24\/loving-swiftui-missing-uikit\/","keywords":["SwiftUI","영어"],"title":"Loving SwiftUI, missing UIKit. – Collin Donnell","summary":"Collin Donnell은 현재 SwiftUI를 주로 사용하고 있으며, AppKit이나 UIKit을 사용하지 않고 macOS 및 iOS 작업을 하고 있다고 설명합니다. 그는 SwiftUI의 선언적 접근법과 UIKit의 명령적 접근법의 차이에 대해 논의하며, SwiftUI의 장점은 코드 작성이 단순해진다는 것이라고 언급합니다. 하지만 그는 명령적 접근방식이 여전히 그리운 경우가 많으며, 특정 행위를 쉽게 구현할 수 있는 명령적 방법이 편리하다고 느낍니다. SwiftUI에서는 상태에 따라 UI를 정의하는 방식이기 때문에, 때때로 복잡하게 느껴질 수 있습니다. Donnell은 SwiftUI가 웹 개발과 유사한 점이 있는지, 또는 이런 시스템에서 영감을 받았는지 의문을 제기합니다. 그는 두 시스템 모두 고유한 가치가 있으며, SwiftUI가 더 우수하다고 단정짓는 것은 잘못이라고 강조합니다. 결국 두 접근법 각각의 장단점이 있으며, 앞으로도 서로의 장점을 그리워하면서 일하게 될 것이라고 결론짓습니다.\n\n**핵심 키워드:** SwiftUI, UIKit, 프로그래밍, 선언적 접근법, 명령적 접근법"},{"comments":"테스트 가능한 구조로 만드는 것은 어디서부터 어떻게 시작해야 할까요. 특히 코어데이터 처럼 영구 저장소가 있다면 고민할 부분이 많아집니다. 그렇지만 좋은 구조에 정답은 없습니다","location":"https:\/\/medium.com\/@gabrynet83\/making-swiftui-testable-5-5-coredata-8ab075fce1d2","keywords":["Architecture"],"title":"Making SwiftUI Testable 5\/5 — CoreData | by Gabriele Trabucco ","summary":""},{"comments":"코딩 스타일 가이드를 정하는 것도 중론을 모으기 어렵고 막상 지키기도 어려운 일입니다. 특히 SwiftUI 코드 작성을 위한 스타일 가이드는 또 다른 고민꺼리가 생길 수 있습니다. 앱이 커지면 고려해야 하는 상황까지 설명합니다","location":"https:\/\/medium.com\/fiverr-engineering\/mastering-coding-style-guides-for-large-scale-codebases-with-a-swiftui-case-study-29619450bc79","keywords":["SwiftUI"],"title":"Mastering Coding Style Guides for Large-Scale Codebases - With a SwiftUI Case Study | by Itay Amzaleg ","summary":"이 글에서는 대규모 코드베이스의 스타일 가이드를 만드는 방법에 대해 설명하며, 특히 SwiftUI를 사례로 다룹니다. 개발자들은 기술적 능력 향상에 집중하다 보니 팀워크와 협업의 중요성을 간과할 수 있습니다. 팀은 일관된 스타일 가이드를 토대로 가독성 높은, 유지보수가 용이한 코드를 작성하려고 합니다. 이를 통해 미래의 개발자들이 쉽게 이해할 수 있는 구조를 만들고, 코드의 논리에 집중춰야 한다고 강조합니다.\n\n스타일 가이드의 목표는 코드의 가독성을 높이고, 단순한 오류를 줄이며, 각 구성요소의 역할을 명확히 하여 코드의 유지보수성을 개선하는 것입니다. 이 글에서는 파일 조직, 코드 포맷팅, 명명 규칙, 코드 스타일 및 아키텍처에 대한 기본 지침을 제시하며, 특히 SwiftUI의 경우 뷰 구조와 속성 래퍼에 대한 구체적인 설명을 포함하여 일관된 코드 작성을 위한 규칙을 나열합니다. 최종적으로, 팀의 요구에 맞는 스타일 가이드를 설정하는 것이 중요하며, 모든 언어나 플랫폼 적용 가능한 공통 원칙을 유지하는 것이 필요하다고 강조합니다.\n\n**핵심 키워드**: SwiftUI, 스타일 가이드, 코드 유지보수, 협업, 개발자."},{"comments":"코어 데이터랑 스위프트 데이터에서 데이터 트래킹과 알림을 할 수 있다는 것 아시죠? 아주 예전부터 되던 것은 아니지만 추적할 수 있다는 것은 디버깅을 쉽게 도와줍니다","location":"https:\/\/itnext.io\/mastering-data-tracking-and-notifications-in-core-data-and-swiftdata-a21921ebfa9d","keywords":["Framework"],"title":"Mastering Data Tracking and Notifications in Core Data and SwiftData | ITNEXT","summary":""},{"comments":"이 글이 엄청난 처세술을 말하지는 않습니다. 아주 단순한 사실을 말할 뿐입니다. 개발자는 핵심 문제를 찾아서 과도하게 일반화하기 보다는 명확하게 본질적으로 해결하도록 노력하고, 자신의 코드에 책임감을 가지라고 말합니다. ","location":"https:\/\/www.mobilesystemdesign.com\/blog\/advice-to-younger-self\/?","keywords":["Culture","pick"],"title":"Mobile System Design - Advice to My Younger Self","summary":"주요 내용은 변화하는 프레임워크 속에서도 지속 가능한 시스템을 만드는 것이 중요하다는 점입니다. 최신 기술에 의존하기보다는 안정적이고 간단한 코드를 작성하고, UI와 독립적으로 기능이 작동하도록 하는 것이 장기적으로 유연성을 제공합니다.\n\n재사용 가능한 코드는 과도한 일반화가 아닌 명확한 목적을 가진 코드에서 비롯된다는 점을 강조합니다. 제3자 의존성을 추가할 때는 그 필요성과 위험성을 잘 따져야 하고, 기존 코드베이스를 변경할 때는 전체 맥락을 이해한 후 결정해야 합니다. 코드 이해도가 낮다고 해서 해당 코드가 나쁘다고 단정짓기보다는, 자신에게 맞는지 평가할 필요가 있습니다.\n\n개발자들은 핵심 문제를 명확히 해결하는 데 집중해야 하며, 잘못된 코드에 대해 책임감을 느껴야 합니다. 마지막으로, 코드 스타일에 대한 논쟁은 실제 제품에 긍정적인 영향을 미치도록 초점을 맞춰야 하며, 결국 좋은 제품을 긍정적으로 배포하는 것을 목표로 삼아야 한다고 결론짓습니다.\n\n**주요 키워드**: 시스템 디자인, 재사용성, 의존성 관리, 코드 품질, 개발 전략"},{"comments":"자극적인 제목과 내용이네요. 애자일이 멍청하기 보다 사람들이 멍청하게 사용하는 게 아닐까요. 지라로 일을 관리하는 것 자체가 시간 낭비인 것일까요 ㅎㅎ","location":"https:\/\/medium.com\/@thecodingteacher_52591\/modern-agile-is-stupid-on-why-all-great-ideas-are-killed-by-simple-minded-idiots-why-jira-kills-02080b937de2","keywords":["Culture","영어"],"title":"Modern Agile is Stupid: on why all great ideas are killed by simple-minded idiots | by Victor Moreno ","summary":"이 글에서 Victor Moreno는 소프트웨어 개발 프로세스와 관리에 대한 비판을 제기합니다. 그는 언어가 복잡한 아이디어나 프로세스를 완벽하게 전달하지 못하며, 문서화된 프로세스가 실제 성과와 다를 수 있음을 강조합니다. 특히 \"Jira로 관리하는 것\"을 비판하며, 메타 작업(불필요한 서류 작업)이 소프트웨어 개발 팀에 미치는 부정적인 영향을 지적합니다. 이러한 작업은 시간 낭비, 비효율적인 관리 문화, 그리고 생산성 저하를 초래한다고 주장합니다. 그는 관리자들이 백서나 보고서 작성에 매몰되기보다 실제 작업을 이해하고 이에 기반하여 팀을 이끌어야 한다고 역설합니다. 프로세스는 필요하지만, 그것이 오히려 팀의 능력을 저해하는 경우가 많다고 주장하면서, 진정한 성공은 복잡한 문제를 깊이 이해하고 창의적으로 해결하는 데서 온다고 말합니다. \n\n이 글은 관리자가 팀의 진정한 성과를 이해하고 지원하는 방향으로 나아가야 한다는 메시지를 전달합니다.\n\n**핵심 키워드**: 소프트웨어 개발, 메타 작업, Jira, 효과적인 관리, 생산성"},{"comments":"Xcode Cloud 빌드 사용할 때 스위프트 매크로 빌드 신뢰성 오류 에러가 발생할 때 해결하는 과정을 설명합니다. ","location":"https:\/\/jeehut.medium.com\/solving-swift-macro-trust-issues-in-xcode-cloud-builds-a0fc27bc60b8","keywords":["DeveloperTools"],"title":"Solving Swift Macro Trust Issues in Xcode Cloud Builds | by Cihat Gündüz ","summary":""},{"comments":"","location":"https:\/\/danielsaidi.com\/blog\/2025\/04\/08\/supercharging-swiftui-text-with-dynamic-content-styling?","keywords":["SwiftUI","영어"],"title":"Supercharging SwiftUI Text with Dynamic Content Styling | Daniel Saidi","summary":""},{"comments":"스위프트 6.2 동시성 관련 변경사항으로 Data Racing 현상을 방지하기 위해 추가된 내용들을 정리해서 설명합니다.","location":"https:\/\/www.avanderlee.com\/concurrency\/swift-6-2-concurrency-changes\/?","keywords":["Swift"],"title":"Swift 6.2: A first look at how it's changing Concurrency - SwiftLee","summary":"Swift 6.2는 Apple의 프로그래밍 언어인 Swift의 최신 버전으로 현재 적극 개발 중에 있다. 이번 버전에서는 병행성(Concurrency) 안전성을 개선하기 위한 여러 변화가 예고되었다. Swift 팀은 Swift병행성이 사용자에게 더 접근하기 쉬워야 한다고 인식하고 있으며, 이에 대한 비전 문서를 2025년 2월 발표했다. 이 문서에서는 언어의 사용성을 높이기 위한 다양한 경로를 제시하고 있으며, 주로 두 가지 사용 사례에 초점을 맞추고 있다: 병행성을 전혀 사용하지 않는 간단한 상황과 병행성 라이브러리를 사용하는 기존 코드의 조정.\n\nSwift 6.2의 주요 변경 사항으로는 데이터 경합을 방지하면서 간단한 코드 작성, 비동기 코드 작성 그리고 병렬성을 통한 성능 향상이 포함된다. 특히, 데이터 경합 안전성을 자동으로 관리할 수 있는 기능이 포함될 예정이며, 이러한 변화들은 새로이 Swift를 배우는 이들에게 보다 쉽게 다가갈 수 있도록 도와줄 것이다.\n\n현재 Swift 6.2의 개발에 대한 몇 가지 제안이 이미 수용되었으며, 이들에 따라 비동기 함수의 기본 실행 환경이 호출자의 actor에 맞춰 조정되는 등의 변화가 이루어질 것이다. 이로써 개발자들이 불필요한 경고에 시달리지 않도록 하여, Swift의 병행성을 보다 원활하게 사용할 수 있도록 한다.\n\n총체적으로 Swift 6.2는 개발자들이 더 쉽게 병행 프로그래밍을 습득하고, 기존 프로젝트의 마이그레이션이 원활할 수 있도록 구조적으로 변화하고 있다.\n\n**핵심 키워드:**\n- Swift 6.2\n- 병행성\n- 데이터 경합\n- 사용자 경험\n- 마이그레이션"},{"comments":"","location":"https:\/\/levelup.gitconnected.com\/swift-charts-animate-marks-6e76b2ddb0c4","keywords":["SwiftUI"],"title":"Swift Charts: Animate Marks. Lines and Bars! | by Itsuki ","summary":""},{"comments":"","location":"https:\/\/levelup.gitconnected.com\/swiftui-all-kinds-of-pinned-headers-4af878b50b85","keywords":["SwiftUI"],"title":"SwiftUI: All Kinds of Pinned Headers | by Itsuki ","summary":""},{"comments":"맥에서도 어쌔신 크리드 게임을 즐길 수 있는 시대가 됐습니다. 이 글은 좀 엉뚱하지만 저자가 기억하는 예전의 '어쌔신 크리드' 시리즈에서 그리운 점을 설명합니다. 저도 어쌔신 크리드 해보고 싶어지는 글입니다","location":"https:\/\/xander51.medium.com\/the-top-3-things-i-miss-from-old-assassins-creed-games-cfef7392f804","keywords":["Culture","영어"],"title":"The Top 3 Things I Miss From Old Assassin’s Creed Games | by Alex Rowe ","summary":"최근 게임 'Mirage'는 오래된 '어쌔신 크리드' 게임의 감각을 가장 잘 재현하고 있지만, 여전히 몇 가지 중요한 요소가 부족하다는 평가를 받고 있다. 본 글에서는 저자가 예전 '어쌔신 크리드' 시리즈에서 그리워하는 세 가지 점에 대해 이야기하고 있다.\n\n첫 번째는 '흐르는 전투'다. 최신 게임들은 신중한 방어와 회피, 무기 삭제 등을 강조하는 방향으로 변화하였으나, 이전 게임들은 전투가 좀 더 영화적인 연출 경향을 보이며, 플레이어가 전투의 유연함과 리듬을 즐길 수 있었다. 특히 '어쌔신 크리드 신디케이트'에서의 전투 시스템은 속도감과 잔인함이 특징적이었다.\n\n두 번째는 '밀집된 도시 환경'이다. 초기 게임들은 도시를 탐험하는 데 중점을 두었으며, 다양한 건물 내부와 NPC가 가득한 풍부한 환경을 제공했다. 반면 최신작들은 넓은 외부 경관을 중심으로 구성되어, 도시의 밀도가 줄어들고 있다. 'Mirage'는 이러한 요소를 다시 도입하려는 시도를 했지만 부족함이 남아 있다.\n\n마지막으로, '기발한 게임 플레이 요소'에 대한 그리움이다. 이전 게임들은 매작마다 독특한 기믹을 도입하여 색다른 경험을 제공했지만, 현재는 RPG적인 요소에 치중해 이러한 특징이 희석되었다.\n\n결국, 저자는 게임이 발전하면서 재미있던 요소들이 사라진 점에 대해 아쉬움을 표현하며,이런 변화가 앞으로의 시리즈에 어떤 영향을 미칠지에 대한 기대감을 나타냈다.\n\n- 키포인트: \n1. 흐르는 전투\n2. 밀집된 도시 환경\n3. 기발한 게임 플레이 요소\n4. 어쌔신 크리드 시리즈\n5. 진화하는 게임 디자인"},{"comments":"iOS 19 SDK 에서 UIApplication 일부 델리게이트 메소드들이 막힌다고 하네요. 어쩌면 UI 방식이 바뀌면서 새로운 방식의 델리게이트가 추가되려나요","location":"https:\/\/lapcatsoftware.com\/articles\/2025\/4\/5.html?","keywords":["UIKit","영어"],"title":"UIApplication delegate deprecation coming in iOS 19 SDK","summary":""},{"comments":"여전히 RIBs 기반으로 개발하는 회사들이 많은 것으로 알고 있습니다. 회사에 맞는 단위로 변형되기도 하구요. 우버에서 만든 초기 RIBs 방식에 대해 상세하게 설명합니다","location":"https:\/\/medium.com\/@gauravharkhani01\/ubers-ios-ribs-architecture-a-deep-dive-716105a7454c","keywords":["Architecture"],"title":"Uber’s iOS RIBs Architecture: A Deep Dive | by Gaurav Harkhani ","summary":""},{"comments":"","location":"https:\/\/itnext.io\/understanding-swiftuis-view-update-mechanism-starting-from-a-timelineview-update-issue-41c7aa5d6139","keywords":["SwiftUI"],"title":"Understanding SwiftUI’s View Update Mechanism: Starting from a TimelineView Update Issue | ITNEXT","summary":""},{"comments":"","location":"https:\/\/tanaschita.com\/swiftui-navigation-path-with-tabview\/","keywords":["SwiftUI","영어"],"title":"Using NavigationPath with TabView in SwiftUI","summary":""},{"comments":"비동기 함수에서 defer 구문에서 의미있게 데이터를 전달하는 방식을 설명합니다. ","location":"https:\/\/www.swiftbysundell.com\/articles\/using-defer-within-async-and-throwing-contexts\/?","keywords":["Swift","영어"],"title":"Using Swift’s defer keyword within async and throwing contexts | Swift by Sundell","summary":""},{"comments":"싱글톤을 만들 때 Data Racing 문제를 해결하기 위해서 안전하게 처리하는 방식을 설명합니다. ","location":"https:\/\/www.donnywals.com\/using-singletons-in-swift-6\/","keywords":["Swift"],"title":"Using singletons in Swift 6 – Donny Wals","summary":""},{"comments":"Cursor IDE로 iOS 개발하시는 분들이 늘어나는 것 같습니다. 아참 저는 Copilot 만 써봤고 Cursor는 아직 안해봤습니다 ㅎㅎ 이상하게 안 궁금하네요","location":"https:\/\/uxplanet.org\/vibe-coding-with-cursor-ai-52f5023bc59a","keywords":["AI\/ML"],"title":"Vibe Coding for mobile with Cursor AI | by Nick Babich ","summary":""},{"comments":"WWDC 25 루머가 본격적으로 나오는군요. 아무래도 iOS 19 루머가 가장 강력한 것 같고, AI 가 어디까지 적용될 것인가 궁금해하네요. LLDB MCP 서버도 있던데 디버깅 말로 하는 게 되면 재밌을 것 같네요","location":"https:\/\/medium.com\/@dhavaljasoliya8\/wwdc-2025-what-to-expect-rumors-leaks-and-bold-predictions-ec180d2cf44e","keywords":["Culture"],"title":"WWDC 2025: What to Expect — Rumors, Leaks, and Bold Predictions | by Dhaval Jasoliya ","summary":""},{"comments":"DeepSeek 와 Qwen 처럼 중국 LLM 을 오픈소스로 공개하는 이유에 대해 설명합니다. AI 패권을 차지하기 위한 전략이 충돌하고 경쟁하는 요즘이 정말 정신없는 것 같네요","location":"https:\/\/medium.com\/data-science-collective\/why-are-chinese-companies-open-sourcing-their-large-language-models-73270f8af06e","keywords":["AI\/ML"],"title":"Why Chinese Companies Are Open-Sourcing Their LLMs — and What It Means | by Shailey Dash ","summary":""},{"comments":"숨겨진 macOS 설정들을 짚어줍니다. 이제 macOS 설정이 찾기 힘들어져서 검색해야 하는 상황이 많아지긴 했습니다. 알아두면 유용한 것도 있습니다","location":"https:\/\/medium.com\/macoclock\/youre-using-macos-wrong-fix-these-10-settings-now-f846ff0c74e3","keywords":["Culture","영어"],"title":"You’re Using macOS Wrong—Fix These 10 Settings Now | Mac O","summary":""},{"comments":"스위프트 테스팅 기반으로 SwiftUI 화면 요소를 스냅샷 테스트를 도와주는 매크로 기반 오픈소스입니다. 흥미롭네요","location":"https:\/\/swiftpackageindex.com\/adammcarter\/swift-snapshot-testing-macros","keywords":["OpenSources"],"title":"swift-snapshot-testing-macros – Swift Package Index","summary":""},{"comments":"스위프트 공식 저장소 중에 하나로 프로세스를 실행하는 것을 도와주는 크로스 플랫폼 패키지입니다. 저도 이걸 좀 테스트해봐야겠네요","location":"https:\/\/github.com\/swiftlang\/swift-subprocess?","keywords":["OpenSources"],"title":"swiftlang\/swift-subprocess: Subprocess is a cross-platform package for spawning processes in Swift.","summary":""},{"comments":"macOS 에서 다른 프로세스의 Task 포트에 접근해서 디버거로 Task를 추가하는 방법을 설명합니다. 이렇게 깊이있게 접근할 일이 필요한 업무도 있을 것 같네요","location":"https:\/\/afine.com\/task-injection-on-macos\/","keywords":["AppKit"],"title":"Task Injection on macOS | afine","summary":""}]}