{"sequence":124,"items":[{"summary":"","keywords":["SwiftUI"],"location":"https:\/\/blog.stackademic.com\/12-powerful-swiftui-component-d450dc6e7d69","title":"12 Powerful SwiftUI Component | by Jerry PM ","comments":"쓸만한 SwiftUI 콤포넌트들을 소개해주지만 필요할 때 찾을 수 있어야 할텐데 말이죠 :)"},{"summary":"Git은 20년 전 리누스 토발즈에 의해 처음 개발되어 현재 가장 널리 사용되는 버전 관리 시스템으로 성장했습니다. Git의 초기 목적은 효과적인 패치와 tarball 관리로, 기존의 느리고 불편한 버전 관리 시스템에서 벗어나기 위해 탄생했습니다. 초기 Git의 기능은 낮은 수준의 데이터베이스 도구와 연관되어 있으며, 사용자 친화적인 고급 명령어(\"porcelain\")는 시간이 지나면서 점진적으로 추가되었습니다.\n\n정체성 및 기능의 변경은 여러 요소에 의해 이루어졌으며, 초기 명령어들은 저수준의 기능을 포함하는 스크립트로 시작되었습니다. 예를 들어, \"git log\" 명령어는 매우 간단한 스크립트로 처음 구현되어 점차 복잡한 기능으로 발전했습니다. Git의 다양한 기능은 커뮤니티의 피드백을 통해 에러 수정 및 개선되었으며, 발전의 역사는 Git 개발자들의 통찰력과 실험에 기인합니다. \n\n현재도 많은 소프트웨어 프로젝트에서 Git이 사용되고 있으며, GitButler와 같은 새로운 도구들은 Git의 장점을 바탕으로 더욱 향상된 사용자 경험을 제공하고 있습니다. Git은 여전히 독특하며 유용한 도구로 남아있습니다.\n\n**핵심 키워드**:\n1. Git\n2. 버전 관리\n3. 리누스 토발즈\n4. 사용자 경험\n5. 패치 관리","keywords":["Culture","영어"],"location":"https:\/\/blog.gitbutler.com\/20-years-of-git\/","title":"20 years of Git. Still weird, still wonderful.","comments":"토르발즈가 Git 을 만든지 20주년이 되었네요. 그전에 소스 패치와 배포 방식을 생각하면 꽤 많은 변화가 있었습니다. 많이 쓰이지만 여전히 다른 도구를 쓰는 곳도 있습니다"},{"summary":"","keywords":["OpenSources","영어"],"location":"https:\/\/www.magnuskahr.dk\/posts\/2025\/03\/announcing-FlowNavigation\/?","title":"Announcing FlowNavigation | magnuskahr","comments":"SwiftUI 화면 전환 - 내비게이션을 도와주는 오픈소를 만들었다고 하네요. SwiftUI 뷰 의존성 관리해주는 도구라고 생각하셔도 됩니다"},{"summary":"","keywords":["Culture"],"location":"https:\/\/stevenpcurtis.medium.com\/apple-to-introduce-quantum-commit-review-in-xcode-17-180fb8c64df0","title":"Apple to Introduce Quantum Commit Review in Xcode 17 | by Steven Curtis ","comments":"4월 1일 만우절 글로 한참 지났지만 한 번 읽어보시라고 가져왔습니다. 양자 컴퓨팅 기반 양자 리뷰 방식이라고 합니다"},{"summary":"","keywords":["DeveloperTools","영어"],"location":"https:\/\/fatbobman.com\/en\/posts\/building-wasm-applications-with-swift\/","title":"Building WASM Applications with Swift","comments":"Swift 를 WASM 웹 어셈블리 앱 개발 환경으로 사용하기 좋다는 글을 본 적이 있는데요, SwiftWASM 기반으로 웹 어셈블리 앱을 만드는 방식을 설명하는 글입니다"},{"summary":"","keywords":["AI\/ML"],"location":"https:\/\/wonderwhy-er.medium.com\/claude-with-mcps-replaced-cursor-windsurf-how-did-that-happen-c1d1e2795e96","title":"Claude with MCPs Replaced Cursor & Windsurf — How Did That Happen? | by Eduard Ruzga ","comments":"최근 MCP 프로토콜 방식을 구현한 MCP 서버들이 쏟아져 나오면서, 로컬에서 Cursor 나 Windsurf 같은 도구를 대체해서 사용할 수 있는 방법들이 공유되고 있습니다. 통합 개발 환경이 아니더라도 워크플로우를 개선하는 데 도움이 될 것은 분명하네요"},{"summary":"","keywords":["Architecture"],"location":"https:\/\/medium.com\/@mo.fawzy\/clean-architecture-in-swiftui-4eb33a187cdc","title":"Clean Architecture in SwiftUI. Clean Architecture | by Mohamed Fawzy ","comments":"SwiftUI 기반 클린 아키텍처 예제입니다. SwiftUI 라고 클린 아키텍처가 달라져야 할지 모르겠지만 또 하나의 예제 코드라고 생각하고 참고하시면 됩니다"},{"summary":"","keywords":["Swift"],"location":"https:\/\/itnext.io\/comprehensive-guide-to-mastering-keypath-in-swift-bb0b357bb890","title":"Comprehensive Guide to Mastering KeyPath in Swift | ITNEXT","comments":"KeyPath도 접근 방식과 권한에 따라 체계가 있습니다. 언제 어떻게 사용하는 게 다른지 비교하면서 상세하게 설명해주는 글입니다"},{"summary":"","keywords":["SwiftUI"],"location":"https:\/\/duruldalkanat.medium.com\/creating-engaging-fuel-gauge-animations-in-swiftui-1b76c1abeecc","title":"Creating Engaging Fuel Gauge Animations in SwiftUI | by Durul Dalkanat ","comments":"자동차 연료 표시등 게이지처럼 보이는 애니메이션 구현하는 방식을 소개합니다"},{"summary":"","keywords":["SwiftUI"],"location":"https:\/\/medium.com\/think-diffrent\/creating-paging-scrollview-using-variadicview-289566da94f7","title":"Creating Paging ScrollView using _VariadicView | by Omar Elsayed ","comments":"`_VariadicView` 라는 뷰 빌더로 페이징 스크롤뷰를 구현하는 방식을 소개합니다"},{"summary":"","keywords":["ServerSide"],"location":"https:\/\/swifttoolkit.dev\/posts\/deploy-fly-railway","title":"Deploying a Swift Server App to Fly.io and Railway @ SwiftToolkit.dev","comments":"Vapor 서버 프로젝트를 만들었는 때 fly.io 와 railway 각각에 배포하는 방식을 설명합니다. 은근히 서버 배포를 도와주는 서비스가 있습니다"},{"summary":"","keywords":["Framework","영어"],"location":"https:\/\/www.createwithswift.com\/detecting-body-poses-in-a-live-video-feed\/?","title":"Detecting body poses in a live video feed","comments":"애플 샘플에서 제공하는 것과 거의 비슷합니다만 조금더 간결한 형식입니다"},{"summary":"애플의 Exclaves에 대한 최근 블로그 포스트에서는 Secure Kernel(SK)와 관련된 여러 가지 새로운 발견 사항을 공유하고 있습니다. 저자는 iOS 18의 Exclaves와 관련된 disassembly 작업을 통해, 다양한 서브시스템 및 시스템 호출 메커니즘을 탐구하고 있습니다. 특히, CPUTRACE 서브시스템이 새로 추가되며, Secure Kernel이 기존의 GENTER와 HVC 명령을 통해 SPTM과 상호 작용하는 방식에 대해 설명하고 있습니다.\n\nSK는 GL1에서 실행되며, Exclaves로부터의 시스템 호출은 SVC 명령을 통해 이루어집니다. 저자는 또한 Exclaves에서 사용되는 자원과 구성 요소를 확인하며, 이들이 com.apple.kernel 도메인과 중복되는 경우도 있다는 점을 언급하고 있습니다. 한편, ExclaveCore는 Secure Kernel과 함께 작동하는 OS 바이너리의 집합체로, ExclaveKit에서는 Exclaves에 필요한 코드와 리소스를 포함하고 있습니다.\n\n결론적으로, 저자는 애플이 기존 OS에 마이크로커널처럼 고립된 구조를 접목시키려는 시도를 하고 있다는 점을 강조하며, 향후 포스트에서 이 개념에 대한 더 많은 논의를 진행할 예정이라고 언급합니다.\n\n**핵심 키워드:** Exclaves, Secure Kernel, SPTM, 시스템 호출, 마이크로커널","keywords":["AppKit"],"location":"https:\/\/randomaugustine.medium.com\/disassembling-apple-exclaves-7979bb987f86","title":"Disassembling Apple Exclaves. Now I have a Mac mini! | by Random Augustine ","comments":"macOS 만 해당하는 것은 아니고 iOS 18 부터 시큐어 커널과 함께 ExclaveCore 가 어떻게 동작하는 지 설명합니다. 오래전 유저 모드와 커널 모드 구조와 비슷하면서도 또 다르네요. ExclaveKit 프레임워크 내부를 분석한 내용입니다"},{"summary":"","keywords":["DeveloperTools","영어"],"location":"https:\/\/alexanderweiss.dev\/blog\/2025-03-09-docc-for-multi-platform-documentation","title":"DocC for Multi-Platform Documentation | Teabyte","comments":"오랜만에 DocC 관한 글입니다. 이번에는 복수 플랫폼 문서를 만드는 데 어떻게 활용할 수 있는가 설명합니다"},{"summary":"","keywords":["Swift"],"location":"https:\/\/levelup.gitconnected.com\/does-asyncstream-replace-combine-a4fc091a8175","title":"Does AsyncStream Replace Combine? No. | by Michael Long ","comments":"이거 생각해볼 문제입니다. 분명 async\/await로 combine 동작을 대신할 수 있고 문법상 문제가 되지 않지만 actor가 누가 되느냐에 따라 await 동작에서 오래 걸릴 수 있죠. 도구의 차이를 명확하게 이해하고 사용하는 게 필요한 시점입니다"},{"summary":"최근 플러터(Flutter)에 대한 비판적인 논의가 급증하고 있다. 많은 개발자들이 플러터 앱의 품질과 사용자 경험이 기대에 미치지 못한다는 문제를 인식하게 되었다. 플러터 개발팀이 최근 여러 중요한 이슈를 무시하고 있다고 주장하며, 해당 문제들이 앱의 고유한 성격을 저해하고 있다고 강조하고 있다. 텍스트 렌더링에서부터 카메라, 비디오, 스크롤링, UI 결함 등 다양한 문제들이 있으며, 이로 인해 앱 전문성이나 신뢰성을 떨어뜨린다고 지적하고 있다. \n\n플러터의 카메라 기능은 여러 문제로 인해 실용성이 떨어지며, 비디오 플레이어는 오래된 이슈들이 해결되지 않고 있어 사용자 경험을 저해한다. 유저 인터페이스에 대한 불안정한 성능은 앱 심사에서Rejected 될 수 있는 이유가 되기도 한다. 개발팀은 커뮤니티와 소통이 원활하지 않으며, 많은 이슈가 해결되지 않은 채 방치되고 있다는 비판도 있다. \n\n이러한 상황에서 개발자들에게 실질적인 해결책을 알리고, 구글에게 플러터의 제한 사항을 명확히 하라고 촉구하고 있다. 플러터의 현재 상태는 1.0 버전에서는 수용할 수 있었던 품질이지만, 현재로서는 매우 실망스럽다는 의견이 지배적이다.\n\n**핵심 키워드:** 플러터, 앱 품질, 커뮤니티 문제, 개발자 이슈, 신뢰성","keywords":["Culture"],"location":"https:\/\/medium.com\/@lucydev8\/flutter-apps-look-cheap-and-untrustworthy-23a36b2755fd","title":"Flutter issues make apps look cheap and untrustworthy. | by Lucydev ","comments":"최근 모바일 네이티브 개발보다 크로스 플랫폼 방식과 도구에 대한 관심과 선호도가 높아지는 것 같습니다. 플러터도 여전히 문제점을 갖고 있고 해결책이 필요한 상황이지만 구글에서 지원을 충분히 받지 못하는 것 같습니다"},{"summary":"이 글은 생성적 AI 코드와 자율주행차의 딜레마를 다루고 있습니다. generative AI 시스템이 왜 위험한가에 대한 논의로 시작하며, 대부분의 경우 잘 작동하는 시스템이 사람들의 신뢰를 과도하게 쌓이게 만들고 결과적으로 감독 능력을 저하시키는 문제를 지적합니다. 특히 테슬라의 풀 자율주행(FSD) 시스템을 언급하며, 운전자가 신뢰를 쌓아가면서 일어날 수 있는 사고의 예시를 들어 설명합니다.\n\nAI가 생성하는 코드는 거의 항상 잘 작동하지만, 이로 인해 개발자는 경계심을 잃고 오류를 넘길 수 있는 위험이 발생합니다. 이와 유사한 사고가 발생할 수 있음을 경고하며, 그러한 상황을 피하기 위해서는 사람들이 시스템에 계속적으로 참여하도록 하는 도구와 워크플로우 설계가 필요하다고 강조합니다.\n\n마지막으로, 현재 AI 모델은 방대한 데이터에서 패턴을 학습하기 때문에 발생하는 부작용을 지적하며, 기업이 AI 기반의 프로그래밍 도구를 도입할 때 적절한 검증 및 검토 프로세스가 필요하다고 요청합니다.\n\n**핵심 키워드**: 생성적 AI, 자율주행차, 감독 능력, 코드 오류, 검증 및 검토","keywords":["AI\/ML"],"location":"https:\/\/generativeai.pub\/generative-code-and-the-fsd-dilemma-d009aaf849e1","title":"Generative Code and the FSD Dilemma | by Michael Long ","comments":"요즘 어느 회사나 개발자 대신 AI가 코드를 생성하는 경우가 많아진다고 들었습니다. AI가 생성하는 코드가 항상 나쁜 것은 아니지만, 항상 좋은 것도 아니라서 개발자들이 경계심을 내려놓기 어려운 것 같습니다. 그 딜레마를 이야기합니다"},{"summary":"AFINE 사이버 보안 블로그의 \"macOS에서의 NULL 포인터 역참조의 역사\" 포스트는 macOS에서 NULL 포인터 역참조가 더 이상 악용되지 않는 이유를 설명합니다. NULL 포인터 역참조란 소프트웨어가 NULL 주소(0번지)에 접근하려는 시도로, 이 경우 시스템은 즉시 패닉 상태에 빠지며, 이는 서비스 거부(DoS)로 이어집니다. 역사적으로는 공격자가 이를 악용할 수 있었으나, macOS의 여러 보안 조치가 이러한 위험을 줄여 왔습니다. \n\n특히 Apple Silicon에서, 메모리 보호 조치가 강화되어 0번지 주소가 사용자 프로세스에 대해 매핑되지 않도록 했고, 데이터나 코드를 실행할 수 없도록 설정했습니다. 이전 버전에서는 32비트 프로세스의 지원이 있었으나, macOS 10.15부터는 이 지원이 중단되어 NULL 주소를 악용할 수 없게 되었습니다. 현재 macOS에서의 NULL 포인터 역참조는 유효한 공격 벡터가 아니며, Apple은 여전히 이러한 문제를 패치하고 있지만, 이를 보안 문제로 간주하지 않습니다. \n\n결국, 현대의 macOS에서는 NULL 포인터 역참조가 DoS 공격으로 이어질 수는 있지만, 권한 상승이나 코드 실행으로 이어지는 것은 거의 불가능합니다.\n\n**주요 키워드:** \n1. NULL 포인터 역참조\n2. macOS 보안\n3. Apple Silicon\n4. 서비스 거부(DoS)\n5. 악용 방지 조치","keywords":["AppKit"],"location":"https:\/\/afine.com\/history-of-null-pointer-dereferences-on-macos\/","title":"History of NULL Pointer Dereferences on macOS","comments":"ARM64 이상 아키텍처를 사용하는 애플 실리콘에서는 NULL 주소(0번)을 역참조하는 매핑을 막아서 역참조 공격 보안 문제를 막았다고 합니다. NULL 포인터 역참조에 대한 역사적인 배경을 설명하는 글입니다"},{"comments":"꽤 길고 상세한 내용을 포함하고 있습니다. 앱이나 서비스를 두려움 없이 배포하려면 무엇을 준비하고 점검해야 할까 몇 가지 기준을 제시합니다. 수동으로 QA 점검을 위한 체크리스트 Health Checks를 제안합니다","keywords":["Testing","pick"],"summary":"이 글에서는 모바일 앱 출시를 효율적이고 안전하게 수행하기 위한 전략과 경험을 공유하고 있습니다. 스타트업에서의 빠른 개발과 운영 부담을 이해하며, 안정적인 출시를 위한 몇 가지 방법들을 제안합니다. \n\n먼저, 코어 기능이나 주요 사용자 흐름을 확인하는 수동 QA 접근법에 대해 설명하고, 이를 위해 체크리스트를 만들어 팀원이 각 기능을 점검하도록 하는 방법이 소개됩니다. 또한, 자동화 테스트의 한계와 함께 UI 및 E2E 테스트의 효과적인 활용법에 대해서도 논의합니다. \n\n특히 \"Health Checks™\"라는 새로운 접근법이 제안되며, 이는 단계적 출시에서의 핵심 지표를 실시간으로 모니터링하여 출시 중 문제를 조기에 발견할 수 있게 합니다. 출시 전후에 수집된 분석 데이터로 각 버전 간의 성능을 비교하고, 문제가 발생할 시 즉각적으로 대응할 수 있는 방법이 소개됩니다.\n\n이러한 방식을 통해 스타트업은 안정성은 높이고, 출시 속도를 줄이지 않으면서도 비즈니스 리스크를 줄일 수 있습니다. 전체적으로는, 스타트업의 성장과 성공적인 앱 출시를 위한 실용적 조언이 가득한 글입니다.\n\n**핵심 단어**: 앱 출시, Health Checks™, QA, 자동화, 스타트업","title":"How To Release Without Fear | by Jacob Bartlett ","location":"https:\/\/levelup.gitconnected.com\/how-to-release-without-fear-a262c3aceacc"},{"comments":"llama.cpp 을 iOS 용으로 빌드해서 앱에 포함시키고 채팅 앱을 만드는 방식을 설명합니다. llama.cpp 스위프트로 래핑 프레임워크가 눈에 띄네요","keywords":["AI\/ML"],"summary":"","title":"How to embed local LLMs into iOS apps | by Sau Sheong ","location":"https:\/\/levelup.gitconnected.com\/how-to-embed-local-llms-into-ios-apps-e8076c01f352"},{"comments":"공식 인스트루먼츠 앱 튜토리얼이 업데이트되었습니다. 멈추는 지점을 찾아서 스레드 활동과 병목 지점을 찾아내는 과정을 배울 수 있습니다","keywords":["APPLE","pick"],"summary":"","title":"Instruments Tutorials | Apple Developer Documentation","location":"https:\/\/developer.apple.com\/tutorials\/instruments"},{"comments":"Vapor로 만든 앱을 크로스 컴파일 하는 방식을 설명하는 자료입니다. 서버에 배포하는 것은 앱 스토어에 올리는 것과 또 다른 영역에서 전쟁터(?)라고 할 수 있죠","keywords":["ServerSide","영어"],"summary":"이 블로그 포스트는 Swift를 사용하여 다양한 플랫폼에서 프로그램을 크로스 컴파일하는 방법에 대해 다루고 있습니다. 작성자는 Gentoo Linux에서 실행할 수 있는 Discord 봇과 Bluesky 봇을 개발하면서 Swift의 새로운 정적 Linux SDK 및 크로스 컴파일의 도전정신을 경험했습니다. \n\n첫 번째 프로젝트는 링크 임베드 봇으로, Instagram 링크를 Discord 메시지에서 사용 가능하게 하려고 했습니다. 이 봇은 24시간 작동 가능하며, 메모리 요구사항도 충족합니다. 처음에는 정적 Linux SDK를 사용하여 컴파일하고자 했으나, Xcode의 Swift 버전으로 인한 혼인이 발생해, Docker를 통해 다시 시도했습니다. \n\nDocker를 이용한 두 번째 방법은 Swift 프로젝트를 Docker 컨테이너 내에서 컴파일한 후, 실행 파일을 호스트 시스템으로 복사하는 것이었습니다. 이를 통해 상대적으로 간단하게 크로스 컴파일을 수행할 수 있었습니다. Docker 컨테이너를 사용한 이 방식은 다양한 Linux 배포판에 호환성이 좋습니다.\n\n결론적으로 Swift의 크로스-컴파일링 능력은 발전해왔으며, 작성자는 Swift의 발전과 커뮤니티에 대한 감사한 마음을 표현했습니다.\n\n**키워드:** \n1. Swift\n2. 크로스-컴파일\n3. Docker\n4. 정적 Linux SDK\n5. Discord 봇","title":"Khan's Blog · Cross Compiling Swift","location":"https:\/\/khanwinter.com\/2025-03-29-Cross-Compiling-Swift\/"},{"comments":"스위프트라고 모두 static 정적 디스패치인 것도 아니고 dynamic 동적 디스패치가 가능합니다. 어느 시점에 어떻게 동적으로 찾는지 Objective-C 방식과 비교해줍니다","keywords":["Swift","영어"],"summary":"","title":"Method dispatch mechanisms in Swift: static and dynamic dispatch","location":"https:\/\/nilcoalescing.com\/blog\/MethodDispatchMechanismsInSwift\/?"},{"comments":"커서가 비주얼 스튜디오 코드 VSCode 오픈소스를 활용하면서, 호환성 차단 방식으로 확장도구를 사용하지 못하도록 막아버리는 시대가 됐네요","keywords":["Culture"],"summary":"마이크로소프트가 VSCode 확장 프로그램에서 커서를 사용하는 것을 차단한 이유에 대한 문제를 다룬 기사입니다. 사용자가 커서를 사용하려고 했으나, 마이크로소프트의 언어 서비스 확장에서 발견된 한 줄의 코드가 호환성을 깨뜨렸습니다. 이 변경에 대해 커뮤니티는 \"포옹, 확장, 소멸\"이라는 과거의 마이크로소프트 전략을 떠올리고 있습니다. VSCode는 다양한 프로그래밍 언어를 지원하는 오픈소스 IDE로, 마이크로소프트는 이를 기반으로 많은 확장 프로그램을 개발하여 제공하고 있습니다.\n\n그러나 경쟁업체인 커서가 등장하면서 VSCode의 오픈소스 모델을 사용하였고, 이는 마이크로소프트에게 위협이 되었습니다. 최근 추가된 JSON 파일의 특정 문구는 커서에서 마이크로소프트 확장을 사용할 수 없도록 했습니다. 이는 마이크로소프트가 비공식적인 방식으로 \"호환성 차단\"을 실시하는 것으로 해석될 수 있으며, 오픈소스 조건에 따라 사용자들이 이를 우회하기 어려워졌습니다. 결국, 이 사건은 마이크로소프트가 소프트웨어 개발 생태계에서의 지배력을 어떻게 행사할 수 있는지를 보여줍니다.\n\n핵심 키워드:\n1. 마이크로소프트\n2. VSCode\n3. 커서\n4. 오픈소스\n5. 호환성 차단","title":"Microsoft Quietly Blocked Cursor from Using Its VSCode Extension — Here’s the Line of Code That Did It | by Tom Smykowski ","location":"https:\/\/tomaszs2.medium.com\/microsoft-quietly-blocked-cursor-from-using-its-vscode-extension-heres-the-line-of-code-that-8d664caf0de5"},{"comments":"뷰를 균형있게 보여주려면 여백과 공간도 구조적으로 다뤄야 합니다. 시스템 디자인을 만들면서 고려할 사항 중에 여백과 공간에 대한 설명입니다.  ","keywords":["SwiftUI","영어"],"summary":"","title":"Mobile System Design - Structuring Spacing for Scalable Mobile UIs","location":"https:\/\/www.mobilesystemdesign.com\/blog\/design-system-spacing\/?"},{"comments":"ModelActor를 사용하면서 마주한 의문점과 해결 방식을 차례차례 설명합니다. 어떤 스레드에서 생성되느냐에 따라 동작이 달라지는 부분은 살짝 충격적이네요","keywords":["Swift","영어"],"summary":"이 글에서는 SwiftData와 Core Data에 대한 경험을 다루고 있으며, 특히 SwiftData의 새로운 기능과 ModelActor 행태에 집중하고 있다. 작성자는 SwiftData가 Core Data를 감싸는 얇은 레이어라고 설명하며, 공존하는 다양한 동시성 기능들 때문에 ModelActor 사용 시 많은 당혹스러움이 생긴다고 언급한다. ModelActor는 전용 모형의 속성에 대해 상호 배타적 접근을 제공하며, 이 프로토콜과 @ModelActor 매크로를 활용하는 방식에서는 여러 가지 이상한 상황이 발생할 수 있다.\n\n저자는 ModelActor를 사용하는 도중 마주친 여러 의문점과 그에 대한 해결책을 제시한다. 특히, ModelActor가 어떤 스레드에서 생성되느냐에 따라 실행되는 방식이 달라지며, 주 스레드에서 생성되는 경우와 백그라운드에서 생성되는 경우의 결과가 너무 상이하다고 지적한다. 이를 피하기 위해 non-isolated async 함수를 활용하여 백그라운드 실행을 보장할 수 있다고 설명한다.\n\n마지막으로, 작성자는 ModelActor의 제한사항을 극복하기 위한 여러 방법을 제시하며, ModelActor의 안전한 사용을 위한 메커니즘을 설계하는 과정을 확인시켜준다. 이러한 복잡한 시스템을 이해하고 활용하는 것은 어려운 과제이지만, SwiftData 시스템을 더 잘 구성할 수 있는 기초가 될 수 있다.\n\n**핵심 키워드**: SwiftData, ModelActor, Core Data, 동시성, 비동기","title":"ModelActor is Just Weird | massicotte.org","location":"https:\/\/www.massicotte.org\/model-actor?"},{"comments":"존 선델의 스위프트 블로그가 돌아왔습니다. 복귀 글도 있는데 생략하고, 최근 URL을 생성하고 다루는 방식 글을 소개합니다","keywords":["Framework","영어"],"summary":"","title":"Modern URL construction in Swift | Swift by Sundell","location":"https:\/\/www.swiftbysundell.com\/articles\/modern-url-construction-in-swift\/"},{"comments":"생각해 볼만한 글입니다. 예전에 비해서 하드웨어와 성능 스펙으로 보면 모바일 기기와 컴퓨터 모두 사용자들에게 과분하게 빠르고 좋습니다. 그럼에도 여전히 실제 문제에 도움이 안되고 일상적인 부분은 오히려 미미한 것 같다고 지적합니다. ","keywords":["Culture"],"summary":"최근 기술 발전에 따른 컴퓨터의 과도한 성능에 대한 고찰을 다룬 글에서, 현대의 모바일 기기와 컴퓨터는 사용자들이 실제로 필요로 하는 성능을 훨씬 초과하는 경우가 많다고 주장하고 있습니다. 특정 유튜버가 2024년형 아이패드 미니의 A16 Pro 칩을 언급하며 기기의 성능을 칭찬했지만, 저자는 실제 사용자 경험에서는 대부분의 일반적인 작업에 이러한 성능이 필요하지 않다고 지적합니다. \n\n저자는 기술 회사들이 강력한 칩을 생산하는 이유를 경제적 규모와 경쟁 우위 확립으로 분석하며, 이러한 강력한 성능이 종종 실제 문제를 해결하기보다는 단지 기술적 업적을 자랑하기 위한 수단으로 자리 잡고 있다고 강조합니다. 예를 들어, 기존의 하드웨어에서도 다양한 최신 운영체제를 구동할 수 없는 문제와 컴퓨터 사용 환경의 표준화된 요구사항이 주어짐에 따라 이용자의 요구는 상대적으로 낮아졌다는 것입니다. \n\n마지막으로, 저자는 기술의 발전이 사용자들의 경험을 개선하는데 기여하고 있지만, 이러한 성능의 과잉은 종종 실질적인 유용성과는 무관하다고 평가하고 있습니다. 즉, 많은 사용자들이 일상적인 작업에서 경험하는 성능 개선이 미미해졌다는 점을 강조하며 글을 마무리합니다.\n\n**핵심 키워드**: 컴퓨터 성능, 기술 발전, 사용자 요구, 과잉 성능, 경제적 규모.","title":"Modern computers are too powerful | by Chris Langley ","location":"https:\/\/chris-langley.medium.com\/modern-computers-are-too-powerful-97a64dffcb7f"},{"comments":"포인트 프리에서 스위프트 6.1에 포함된 테스트 범위와 방식을 조합할 수 있는 Trait에 대해 소개합니다. Trait 프로토콜이 조금 복잡해 보이지만, 테스트 케이스도 구조적으로 작성하는 데 도움이 될 것 같습니다","keywords":["Testing","영어"],"summary":"","title":"New in Swift 6.1: Test Scoping Traits","location":"https:\/\/www.pointfree.co\/blog\/posts\/169-new-in-swift-6-1-test-scoping-traits?"},{"comments":"기존에 OOP, FP 같은 전통적인 패러다임이 아니라 메모리 관리 방식에 따라 언어를 구분하자는 방식을 제안합니다. 꽤 흥미로운 글입니다. 회계사 스타일 언어라고 부르는 군요 ㅎㅎ","keywords":["Culture"],"summary":"이 글에서는 전통적인 프로그래밍 언어의 분류 기준인 패러다임(객체 지향, 함수형, 절차적) 대신, 메모리 관리 방식에 따라 언어를 구분하는 새로운 분류 체계를 제안합니다. 저자는 프로그램 언어가 이러한 분류로 확실히 나뉘지 않는 현대의 언어 환경을 설명하며, 메모리 관리 방식이 언어의 성능, 안전성, 개발자 경험에 미치는 영향이 크다고 주장합니다.\n\n새로운 분류 체계는 메모리 관리 전략에 따라 네 가지 클래스로 나뉩니다:\n1. **Sovereign Languages (주권 언어)**: 프로그래머가 메모리를 직접 관리하며 높은 성능과 높은 오류 가능성을 가짐 (예: C, Zig).\n2. **Guardian Languages (수호자 언어)**: RAII 원칙을 통해 deterministic하게 메모리를 관리하는 언어. (예: Rust, 현대 C++).\n3. **Custodian Languages (관리자 언어)**: 가비지 컬렉션을 통해 프로그래밍의 많은 메모리 관리 작업을 수행. (예: Java, Python).\n4. **Accountant Languages (회계 언어)**: 자동 참조 카운팅을 사용하는 언어. (예: Swift).\n\n메모리 관리 방식을 중심으로 언어의 선택을 고려해야 하며, 이를 통해 성능, 안전성, 개발 효율성 등의 요구사항에 맞춘 언어를 선택할 수 있습니다. 저자는 현재의 언어 분류가 과거의 유용성에서 벗어나 현대의 복잡한 상황을 반영하지 못한다고 지적하며, 메모리 관리 방식이 진정한 차별점이라고 강조합니다.\n\n**주요 키워드**: 메모리 관리, 프로그래밍 언어, 분류 체계, 성능, 안전성.","title":"OOP vs. Functional is Dead | by Alexander Paul Gilbert ","location":"https:\/\/medium.com\/@alexander.paul.gilbert\/oop-vs-functional-is-dead-ff51a70c83ce"},{"comments":"","keywords":["Framework"],"summary":"","title":"Rendering Markdown in iOS Swift | by Adonis Gaitatzis ","location":"https:\/\/gaitatzis.medium.com\/rendering-markdown-in-ios-swift-3e9d8343e372"},{"comments":"dismiss 환경 값의 위험성에 대해 설명하는 글입니다. dismiss 를 호출할 때 성능 문제도 고민해볼 필요가 있군요","keywords":["SwiftUI"],"summary":"이 글은 SwiftUI 개발에서 'dismiss' 환경 값의 위험성에 대해 경고하며, 더 유지보수가 용이한 상태 중심의 대안적인 접근 방식을 제안하고 있다. dismiss는 많은 개발자들이 선호하는 기능으로, 상황에 따라 유연하게 현재 뷰를 닫을 수 있지만 과도하게 사용하면 안정성 문제와 테스트의 복잡성을 증가시킬 수 있다. \n\n저자는 dismiss의 사용에 대한 조심스러운 태도를 취하고, 이를 뷰의 상태 관리에서 분리해야 한다고 주장한다. 이렇게 하면 코드의 가독성과 테스트 가능성, 유지보수성이 향상된다. 대안으로는 Binding을 통한 분리, 함수로서의 dismiss 전달, 사용자 정의 환경 값 사용 등이 있다. \n\n이 외에도, dismiss를 호출할 때 성능 문제를 피하기 위한 최적화 전략도 논의된다. 예를 들어, Equatable 프로토콜을 사용하여 필요한 경우에만 비교를 수행하거나, transformEnvironment 기능을 통해 환경 값을 선택적으로 수정하는 방법을 다룬다. \n\n마지막으로, 필요에 따라 dismiss 로직을 커스터마이징하여 더욱 유연하고 풍부한 사용자 경험을 제공할 수 있는 방법을 제안하며, 개발자들이 더 명확하고 안전한 방식으로 뷰 상태를 관리해야 한다고 강조한다.\n\n**핵심 키워드**: SwiftUI, dismiss, 상태 관리, 코드 안정성, 최적화","title":"Say Goodbye to dismiss - A State-Driven Path to More Maintainable SwiftUI","location":"https:\/\/fatbobman.com\/en\/posts\/say-goodbye-to-dismiss\/?"},{"comments":"이미 소식을 접하셨을 것 같은데요, 스위프트 툴체인 버전 관리를 도와주는 공식 도구 swiftly 가 나왔습니다. 이제 링크 찾아가면서 받지 않아도 손 쉽게 여러 버전을 관리할 수 있습니다","keywords":["Swift","영어"],"summary":"","title":"Swift.org - Introducing swiftly 1.0","location":"https:\/\/www.swift.org\/blog\/introducing-swiftly_10\/"},{"comments":"스위프트 6의 마이너 업데이트 6.1 버전이 공식적으로 나왔습니다. 동시성에서 속성이나 함수에 `nonisolated` 지정할 때 동작이 변화가 있고, `@objc` 구현 코드를 작성할 수 있나 봅니다","keywords":["Swift"],"summary":"","title":"Swift.org - Swift 6.1 Released","location":"https:\/\/www.swift.org\/blog\/swift-6.1-released\/"},{"comments":"async 함수 병렬 호출할 때 throw가 어떤 흐름 변화를 가져오는 지 그림으로 보여줍니다. ","keywords":["Swift","pick"],"summary":"","title":"Swift: Parallel Execution for Async Throws Functions | by Itsuki ","location":"https:\/\/levelup.gitconnected.com\/swift-multi-threading-with-async-await-bb4e23b09c87"},{"comments":"저는 아직 SwiftData 로만 영구 저장소를 구현해본 적은 없는데 이 글을 읽어보니 이번에 한 번 해봐야겠다 싶네요","keywords":["Framework"],"summary":"SwiftData에 대해 알아보며 얻은 인사이트를 소개합니다. SwiftData는 Swift 개발자들을 위해 데이터 지속성을 더 쉽게 만들어주는 선언적 접근 방식을 제공합니다. 이 글에서는 SwiftData의 세 가지 핵심 구성 요소를 설명하고자 합니다: \n\n1. **ModelContainer**: 데이터 관리를 위한 기초입니다. 이를 통해 앱의 모든 뷰가 데이터에 접근할 수 있습니다.\n   \n2. **ModelContext**: 데이터와 상호작용하는 환경을 제공합니다. 데이터의 삽입, 수정, 삭제 및 검색을 효율적으로 수행할 수 있습니다.\n   \n3. **Model 및 속성**: 속성과 모델의 개념을 이해해야 합니다. SwiftData에서는 복잡한 관리 객체를 만들 필요 없이 @Model을 사용하여 모델을 정의하고, @Attribute(.unique)와 같은 속성을 통해 고유값을 보장하거나, @Transient를 사용하여 일시적인 데이터 관리를 수행할 수 있습니다.\n\nSwiftData의 @Query를 사용하여 데이터를 쉽게 검색할 수 있으며, 각 모델 간의 관계를 정의할 수 있는 @Relationship 속성을 통해 관련 데이터를 효율적으로 가져올 수 있습니다. enum을 활용하여 데이터의 유형 안전성을 높일 수도 있습니다.\n\nSwiftData는 iOS 개발자들에게 데이터 관리의 복잡성을 줄여주고, 더 나은 애플리케이션 로직에 집중할 수 있게 돕는 중요한 도구입니다.\n\n**주요 키워드**: SwiftData, ModelContainer, ModelContext, 속성, iOS 개발","title":"SwiftData Uncovered: My Learnings and Insights | by Naren Krishnaa ","location":"https:\/\/medium.com\/@narenkrishnaar\/swiftdata-uncovered-my-learnings-and-insights-5cb2ad142ce0"},{"comments":"","keywords":["SwiftUI","영어"],"summary":"","title":"SwiftUI Alert Guide + Code Examples - SwiftLee","location":"https:\/\/www.avanderlee.com\/swiftui\/swiftui-alert-presenting\/?"},{"comments":"","keywords":["SwiftUI","영어"],"summary":"","title":"SwiftUI Default Scroll Anchor","location":"https:\/\/useyourloaf.com\/blog\/swiftui-default-scroll-anchor\/?"},{"comments":"","keywords":["SwiftUI","영어"],"summary":"","title":"SwiftUI Grid, LazyVGrid, LazyHGrid Explained with Code Examples","location":"https:\/\/www.avanderlee.com\/swiftui\/grid-lazyvgrid-lazyhgrid-gridviews\/?"},{"comments":"","keywords":["SwiftUI","영어"],"summary":"","title":"SwiftUI Keyboard Shortcut Scope","location":"https:\/\/useyourloaf.com\/blog\/swiftui-keyboard-shortcut-scope\/"},{"comments":"","keywords":["SwiftUI","영어"],"summary":"","title":"SwiftUI TabView: Explained with Code Examples - SwiftLee","location":"https:\/\/www.avanderlee.com\/swiftui\/tabview-tabbed-views\/?"},{"comments":"SwiftData 구조와 예제가 비교적 상세한 글입니다. 참고 자료로 좋을 것 같네요","keywords":["Framework","pick"],"summary":"","title":"Swiftdata Architecture Patterns And Practices | AzamSharp","location":"https:\/\/azamsharp.com\/2025\/03\/28\/swiftdata-architecture-patterns-and-practices.html?"},{"comments":"아무리 잘 만든 앱이라도 마케팅을 하지 않고 개발자만 아는 앱이 좋은 앱이 아니라는 화두를 던집니다. 개발자들은 자기가 완벽한 앱을 만들면 알아서 팔리거나 사줄꺼라고 믿는 것 같기도 하네요","keywords":["Culture","영어"],"summary":"이 글은 인디 앱 개발자들이 자신의 애플리케이션을 효과적으로 마케팅하지 않으면 아무리 훌륭한 앱이라도 알려지지 않은 상태로 남게 될 것이라는 점을 강조합니다. 저자 조던 모건은 유명한 화가 빈센트 반 고흐의 예를 들며, 그의 작품이 생전에 한 점만 팔렸던 것을 언급합니다. 그는 마케팅이 개발만큼이나 중요하다며, 자신의 앱 'Elite Hoops'가 성장한 이유는 마케팅에 집중했기 때문이라고 설명합니다. \n\n모건은 마케팅을 위해 다양한 방법을 시도해보라고 권장합니다. 예를 들어, 적은 예산으로 유료 광고를 해보거나, 개발 대신 마케팅에 집중하는 것을 제안합니다. 그뿐만 아니라, 자신의 앱 사용 모습을 소셜 미디어에 게시하는 것도 좋은 방법이라고 언급합니다. 인디 개발자는 마케팅을 고려해야 하며, 실패를 두려워하지 말고 다양한 시도를 통해 점점 나아질 것이라는 희망적인 메시지를 전하고 있습니다.\n\n**주요 키워드:**\n1. 인디 앱\n2. 마케팅\n3. 반 고흐\n4. 애플리케이션 성장\n5. 실패와 학습","title":"The Great App That Nobody Knows About | Swiftjective-C","location":"https:\/\/www.swiftjectivec.com\/a-great-app-that-no-one-knows-about\/?"},{"comments":"맥을 효과적으로 사용하기 위해 설정하는 팁이라고 합니다 (대부분 이 정도는 알고 쓰시죠? ㅎㅎ)","keywords":["Culture"],"summary":"","title":"The Ultimate Minimalist Mac Setup: Less Clutter, More Efficiency | by Andrii ","location":"https:\/\/medium.com\/@andriizolkin\/the-ultimate-minimalist-mac-setup-less-clutter-more-efficiency-caa235f6fc15"},{"comments":"편리함에 감춰진 인지 비용에 대해 이야기 합니다. 간편하고 쉬운 방식일 수록 비판적 사고와 문제 해결 능력 자체를 저하시킨다는 글입니다","keywords":["Design"],"summary":"이 글은 현대의 사용자 경험(UX)이 사용하는 편리한 기술이 우리의 인지 능력을 약화시키고 있다는 문제를 다룹니다. 저자는 자신의 젊은 시절의 자동차 여행 경험을 통해 GPS와 같은 편리한 도구가 소중한 생각할 기회를 빼앗는다고 설명합니다. 간편함이 증가할수록 사용자들은 인지적 참여를 줄이고, 이는 점차적으로 비판적 사고와 문제 해결 능력을 저하시킵니다. 예를 들어 자동 완성 기능은 언어 표현을 단순화시키고, AI 도구는 사고 과정을 대체함으로써 사용자들이 자신의 사고를 발전시키는 기회를 줄입니다.\n\n저자는 심리학자 스티븐 핑커의 '정신 언어(metalese)' 개념을 언급하며, 우리가 정보를 처리할 때 기존 지식과 연결하여 의미를 구성해야 한다고 강조합니다. 따라서, UX 디자인에서는 단순히 모든 불편함을 제거하는 것보다 사용자들이 점진적으로 복잡성을 이해하고 자율성을 가질 수 있도록 돕는 디자인이 필요하다고 주장합니다. 그는 지속적인 인지적 참여가 사용자에게 중요한 이유를 설명하며, 깊이 있는 UX가 사용자에게 더 의미 있는 경험을 제공할 수 있다고 강조합니다.\n\n**핵심 키워드:** \n1. 인지 비용\n2. 사용자 경험 (UX)\n3. 지능형 시스템\n4. 비판적 사고\n5. 인지적 참여","title":"The cognitive cost of convenience | by Michael F. Buckley ","location":"https:\/\/uxdesign.cc\/the-cognitive-cost-of-convenience-e97083ed09b5"},{"comments":"바이브 코딩으로 앱을 만드는 데 시간이 단축되지만, 앱 스토어 출시를 위해서 리뷰는 여전히 병목 구간이라고 지적합니다. 애플도 바이브 리뷰(?)라도 해줘야 하는 게 아닐까요 ㅎㅎ","keywords":["Culture","영어"],"summary":"Apple의 인공지능(AI) 노력에 대한 최근 비판은 흥미롭지만, 앱 리뷰에 대한 비판이 절실한 필요성을 갖고 있다. Apple은 AI 도구 개발이 뒤처지는 상황에서 소프트웨어 개발이 가속화되고 있다는 점을 간과하고 있다. 많은 이들이 Cursor, Replit와 같은 AI 도구를 통해 생산성을 높이는데 반해, Apple의 도구는 여전히 부족하다. 이는 숙련된 개발자들마저도 우선적으로 대체 도구를 사용하도록 만든다.\n\n앱을 만드는 것은 용이해졌지만, 이를 배포하는 과정에서의 마찰이 그 어떤 때보다 크다. 개발자들은 Apple의 앱 리뷰 절차 때문에 소프트웨어를 배포하는 데 큰 어려움을 겪고 있으며, 이는 점점 더 큰 문제로 대두되고 있다. 실제로 앱을 만드는 시간이 단축되는 것과 반대로 앱 배포에 걸리는 시간이 비합리적으로 느려지면서 더욱 더 개발자들에게 부담이 되고 있다.\n\nApple은 앱 리뷰의 비효율성을 해결하지 않으면, 개발자들의 신뢰를 잃고 장기적으로 시장 지배력을 잃을 위험이 크다. 더욱이, 개발자 도구 및 정책에 대한 긍정적 이미지를 유지하는 것이 시장 점유율에 직결된다는 점에서 상당한 우려가 있다. Apple의 정책이 불완전하고 불투명할 경우, 사용자 경험에도 부정적인 영향을 미칠 수 있음을 강조할 필요가 있다.\n\n**핵심 키워드:** APP 리뷰, 개발자 도구, AI, 소프트웨어 배포, Apple의 시장 위치","title":"Tim, don’t kill my vibe · Bryan Irace","location":"https:\/\/irace.me\/vibe"},{"comments":"가끔씩 맥 설정을 터미널 명령으로 바꿔야 하는 경우가 있는데요 그럴 때 참고하면 좋은 자료입니다","keywords":["DeveloperTools"],"summary":"","title":"Unlock the Incredible Hidden MacOS Settings With the Terminal App | by Andrii ","location":"https:\/\/medium.com\/@andriizolkin\/unlock-the-incredible-hidden-macos-settings-with-the-terminal-app-81c27e07d1ed"},{"comments":"슬슬 WWDC25 루머(라고 쓰고 희망사항을 적는) 글들이 올라오는 군요. iOS 19 디자인이 새롭게 바뀔 것이라는 전망이 가장 기대되네요","keywords":["Culture"],"summary":"","title":"WWDC 2025: AI Magic, iOS 19 Redesign, Vision Pro Updates and New Macs Ahead | by Zeeshan Saghir ","location":"https:\/\/medium.com\/@simpleandkind788\/wwdc-2025-ai-magic-ios-19-redesign-vision-pro-updates-and-new-macs-ahead-518f7aaf6a09"},{"comments":"싱글톤 방식을 피해서 구현할 수 있는 여러 대안을 소개합니다. 특히 동시성이 중요하고 필요한 요즘에는 싱글톤이 위험 요소가 될 수 있죠","keywords":["Swift"],"summary":"이 글에서는 Swift 프로그래밍 언어에서 Singleton 패턴의 사용을 피해야 할 이유와 대체 방안을 소개합니다. 저자 Shobhakar Tiwari는 iOS 개발자로서 Singleton 패턴에 대한 다양한 문제점을 강조하며, 그로 인해 발생할 수 있는 여러 복잡한 상황에 대해 설명합니다. \n\nSingleton 패턴은 전역적으로 접근 가능한 단일 인스턴스를 제공하지만, 글로벌 상태 문제로 인해 버그를 발생시킬 수 있으며, 여러 스레드에서 동시 접근할 경우 데이터 경쟁 문제를 일으킬 수 있습니다. 또한, Singleton은 테스트 시 상태를 유지하므로 유닛 테스트에 어려움을 주며, 의존성 주입을 통해 더 나은 테스트 환경을 만들 수 있습니다. \n\n대신 저자는 의존성 주입, 팩토리 패턴, 서비스 로케이터와 같은 대안들을 제안합니다. 이러한 방법들은 코드의 유연성을 높이고 모듈성을 강화할 수 있습니다. 그러나 Singleton을 사용할 수 있는 적절한 경우도 존재하며, 예를 들어 네트워크 매니저와 같은 공유 자원 관리나 애플리케이션 설정을 위한 경우에 한정할 수 있습니다. \n\n결국, Singleton을 사용할 때는 신중해야 하며 다른 대안이 있는지 고민하는 것이 중요합니다.\n\n**키워드**: Singleton, 의존성 주입, 패턴, Swift, 개발자","title":"When to Avoid Using a Singleton in Swift | by Shobhakar Tiwari ","location":"https:\/\/medium.com\/@shobhakartiwari\/when-to-avoid-using-a-singleton-in-swift-4821de7d2b65"},{"comments":"MCP 유행과 함께 등장한 XcodeBuildMCP 서버입니다. 필요한 Xcode 명령을 자연어로 말만하면 되나보내요! ","keywords":["OpenSources"],"summary":"","title":"cameroncooke\/XcodeBuildMCP: A Model Context Protocol (MCP) server that provides Xcode-related tools for integration with AI assistants and other MCP clients.","location":"https:\/\/github.com\/cameroncooke\/XcodeBuildMCP"},{"comments":"iOS 18.4 로 모두 업데이트하셨나요? 새로워진 자잘한 기능들 모두를 소개하는 글입니다. 한국 지원 만큼이나 많네요","keywords":["Culture"],"summary":"","title":"iOS 18.4 Released — 50+ Amazing New Features You NEED To Try Now! | by Nikhil Vemu ","location":"https:\/\/medium.com\/macoclock\/ios-18-4-released-50-amazing-new-features-you-need-to-try-now-93ec92857305"},{"comments":"Tuist 블로그에서 민감한 정보를 감추는 방식으로 Mise 라는 도구를 제안합니다. 저도 써본적이 없는데 구경을 해봐야겠습니다","keywords":["DeveloperTools"],"summary":"Tuist는 Swift 애플리케이션에서 민감한 데이터를 안전하게 처리하는 방법을 제시합니다. 애플리케이션 개발 시 API 키나 서명 인증서와 같은 민감한 정보를 다뤄야 할 수 있으며, 이를 코드 리포지토리에 직접 저장하는 것은 바람직하지 않습니다. 일반적으로 협업 팀은 CI\/CD 환경에서 비밀을 관리하고, 환경 변수를 통해 값을 읽어옵니다. 하지만 이 방법은 디버깅을 어렵게 만들 수 있습니다.\n\n이를 해결하기 위해 Fastlane Match는 인증서와 프로비저닝 프로필을 암호화하는 방법을 제안했으며, Mise라는 도구를 통해 이 접근 방식을 일반화할 수 있습니다. Mise는 개발 환경을 구성하고 필요한 도구와 환경 변수를 동적으로 설정할 수 있게 도와줍니다.\n\nMise를 사용하여 민감한 데이터를 암호화하고, CI\/CD 환경에서도 안전하게 노출할 수 있는 시스템을 설정하는 방법에 대해 다루었습니다. 실질적인 예로, 인증서 파일을 Base64로 인코딩하여 `.env.json` 파일에 저장하고, 환경 변수를 통해 접근 가능하게 하는 절차 등이 포함됩니다. 이러한 방식을 통해 코드를 안전하게 보호하고 CI\/CD 환경에서도 민감한 정보를 안전하게 관리할 수 있습니다.\n\n결론적으로, 민감한 데이터의 암호화와 관리는 앱의 보안을 강화하고 공격으로부터 데이터를 보호하는 중요한 과정입니다.\n\n**키워드**: 민감한 데이터, Swift 애플리케이션, Mise, 암호화, CI\/CD 환경","title":"Keeping your Swift apps' sensitive data secret","location":"https:\/\/tuist.dev\/blog\/2025\/04\/09\/secrets"}],"version":"1.0","releaseAt":764348400}